S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/*
 * Copyright (C) 2015-2016 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 * @file     DA14680AE.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     22. November 2016
 * @note     Generated by SVDConv V3.2.53 on Tuesday, 22.11.2016 15:46:32
 *           from File 'DA14680AE.xml',
 *           last modified on Tuesday, 22.11.2016 13:43:32
 */



/** @addtogroup Dialog
  * @{
  */


/** @addtogroup DA14680AE
  * @{
  */


#ifndef DA14680AE_H
#define DA14680AE_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS_DA14680AE
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

/**
 * @brief Interrupt Number Definition
 */
typedef enum {
/* =======================================  ARM Cortex-M0 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =========================================  DA14680AE Specific Interrupt Numbers  ========================================== */
  BLE_WAKEUP_LP_IRQn        =   0,              /*!< 0  BLE_WAKEUP_LP                                                          */
  BLE_GEN_IRQn              =   1,              /*!< 1  BLE_GEN                                                                */
  FTDF_WAKEUP_IRQn          =   2,              /*!< 2  FTDF_WAKEUP                                                            */
  FTDF_GEN_IRQn             =   3,              /*!< 3  FTDF_GEN                                                               */
  RFCAL_IRQn                =   4,              /*!< 4  RFCAL                                                                  */
  COEX_IRQn                 =   5,              /*!< 5  COEX                                                                   */
  CRYPTO_IRQn               =   6,              /*!< 6  CRYPTO                                                                 */
  MRM_IRQn                  =   7,              /*!< 7  MRM                                                                    */
  UART_IRQn                 =   8,              /*!< 8  UART                                                                   */
  UART2_IRQn                =   9,              /*!< 9  UART2                                                                  */
  I2C_IRQn                  =  10,              /*!< 10 I2C                                                                    */
  I2C2_IRQn                 =  11,              /*!< 11 I2C2                                                                   */
  SPI_IRQn                  =  12,              /*!< 12 SPI                                                                    */
  SPI2_IRQn                 =  13,              /*!< 13 SPI2                                                                   */
  ADC_IRQn                  =  14,              /*!< 14 ADC                                                                    */
  KEYBRD_IRQn               =  15,              /*!< 15 KEYBRD                                                                 */
  IRGEN_IRQn                =  16,              /*!< 16 IRGEN                                                                  */
  WKUP_GPIO_IRQn            =  17,              /*!< 17 WKUP_GPIO                                                              */
  SWTIM0_IRQn               =  18,              /*!< 18 SWTIM0                                                                 */
  SWTIM1_IRQn               =  19,              /*!< 19 SWTIM1                                                                 */
  QUADEC_IRQn               =  20,              /*!< 20 QUADEC                                                                 */
  USB_IRQn                  =  21,              /*!< 21 USB                                                                    */
  PCM_IRQn                  =  22,              /*!< 22 PCM                                                                    */
  SRC_IN_IRQn               =  23,              /*!< 23 SRC_IN                                                                 */
  SRC_OUT_IRQn              =  24,              /*!< 24 SRC_OUT                                                                */
  VBUS_IRQn                 =  25,              /*!< 25 VBUS                                                                   */
  DMA_IRQn                  =  26,              /*!< 26 DMA                                                                    */
  RF_DIAG_IRQn              =  27,              /*!< 27 RF_DIAG                                                                */
  TRNG_IRQn                 =  28,              /*!< 28 TRNG                                                                   */
  DCDC_IRQn                 =  29,              /*!< 29 DCDC                                                                   */
  XTAL16RDY_IRQn            =  30,              /*!< 30 XTAL16RDY                                                              */
  RESERVED31_IRQn           =  31               /*!< 31 RESERVED31                                                             */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M0 Processor and Core Peripherals  =========================== */
#define __CM0_REV                 0x0100U       /*!< CM0 Core Revision                                                         */
#define __NVIC_PRIO_BITS               2        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                           /*!< ARM Cortex-M0 processor and core peripherals                              */
#include "system_DA14680.h"                     /*!< DA14680AE System                                                          */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


