S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/** @addtogroup Device_Peripheral_peripherals_DA14680AE
  * @{
  */


#if 0
/* =========================================================================================================================== */
/* ================                                           NVIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cortex M0 NVIC registers (NVIC)
  */

typedef struct {                                /*!< (@ 0xE000E100) NVIC Structure                                             */
  __IOM uint32_t  ISER;                         /*!< (@ 0x00000000) Interrupt set-enable register                              */
  __IM  uint32_t  RESERVED[31];
  __IOM uint32_t  ICER;                         /*!< (@ 0x00000080) Interrupt clear-enable register                            */
  __IM  uint32_t  RESERVED1[31];
  __IOM uint32_t  ISPR;                         /*!< (@ 0x00000100) Interrupt set-pending register                             */
  __IM  uint32_t  RESERVED2[31];
  __IOM uint32_t  ICPR;                         /*!< (@ 0x00000180) Interrupt clear-pending register                           */
  __IM  uint32_t  RESERVED3[95];
  __IOM uint32_t  IPR0;                         /*!< (@ 0x00000300) Interrupt priority register 0                              */
  __IOM uint32_t  IPR1;                         /*!< (@ 0x00000304) Interrupt priority register 1                              */
  __IOM uint32_t  IPR2;                         /*!< (@ 0x00000308) Interrupt priority register 2                              */
  __IOM uint32_t  IPR3;                         /*!< (@ 0x0000030C) Interrupt priority register 3                              */
  __IOM uint32_t  IPR4;                         /*!< (@ 0x00000310) Interrupt priority register 4                              */
  __IOM uint32_t  IPR5;                         /*!< (@ 0x00000314) Interrupt priority register 5                              */
  __IOM uint32_t  IPR6;                         /*!< (@ 0x00000318) Interrupt priority register 6                              */
  __IOM uint32_t  IPR7;                         /*!< (@ 0x0000031C) Interrupt priority register 7                              */
} NVIC_Type;                                    /*!< Size = 800 (0x320)                                                        */
#endif


#if 0
/* =========================================================================================================================== */
/* ================                                            SCB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cortex M0 SCB registers (SCB)
  */

typedef struct {                                /*!< (@ 0xE000ED00) SCB Structure                                              */
  __IOM uint32_t  CPUID;                        /*!< (@ 0x00000000) CPUID base register                                        */
  __IOM uint32_t  ICSR;                         /*!< (@ 0x00000004) Interrupt control and state register                       */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  AIRCR;                        /*!< (@ 0x0000000C) Application interrupt and reset control register           */
  __IOM uint32_t  SCR;                          /*!< (@ 0x00000010) System control register                                    */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000014) Configuration and control register                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  SHPR2;                        /*!< (@ 0x0000001C) System handler priority register 2                         */
  __IOM uint32_t  SHPR3;                        /*!< (@ 0x00000020) System handler priority register 3                         */
} SCB_Type;                                     /*!< Size = 36 (0x24)                                                          */
#endif


#if 0
/* =========================================================================================================================== */
/* ================                                          SysTick                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Cortex M0 SysTick registers (SysTick)
  */

typedef struct {                                /*!< (@ 0xE000E010) SysTick Structure                                          */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x00000000) SysTick Control and Status register                        */
  __IOM uint32_t  LOAD;                         /*!< (@ 0x00000004) SysTick Reload value register                              */
  __IOM uint32_t  VAL;                          /*!< (@ 0x00000008) SysTick Current value register                             */
  __IM  uint32_t  CALIB;                        /*!< (@ 0x0000000C) SysTick Calibration value register                         */
} SysTick_Type;                                 /*!< Size = 16 (0x10)                                                          */
#endif


/* =========================================================================================================================== */
/* ================                                         AES_HASH                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief AES_HASH registers (AES_HASH)
  */

typedef struct {                                /*!< (@ 0x40020000) AES_HASH Structure                                         */
  __IOM uint32_t  CRYPTO_CTRL_REG;              /*!< (@ 0x00000000) Crypto Control register                                    */
  __IOM uint32_t  CRYPTO_START_REG;             /*!< (@ 0x00000004) Crypto Start calculation                                   */
  __IOM uint32_t  CRYPTO_FETCH_ADDR_REG;        /*!< (@ 0x00000008) Crypto DMA fetch register                                  */
  __IOM uint32_t  CRYPTO_LEN_REG;               /*!< (@ 0x0000000C) Crypto Length of the input block in bytes                  */
  __IOM uint32_t  CRYPTO_DEST_ADDR_REG;         /*!< (@ 0x00000010) Crypto DMA destination memory                              */
  __IOM uint32_t  CRYPTO_STATUS_REG;            /*!< (@ 0x00000014) Crypto Status register                                     */
  __IOM uint32_t  CRYPTO_CLRIRQ_REG;            /*!< (@ 0x00000018) Crypto Clear interrupt request                             */
  __IOM uint32_t  CRYPTO_MREG0_REG;             /*!< (@ 0x0000001C) Crypto Mode depended register 0                            */
  __IOM uint32_t  CRYPTO_MREG1_REG;             /*!< (@ 0x00000020) Crypto Mode depended register 1                            */
  __IOM uint32_t  CRYPTO_MREG2_REG;             /*!< (@ 0x00000024) Crypto Mode depended register 2                            */
  __IOM uint32_t  CRYPTO_MREG3_REG;             /*!< (@ 0x00000028) Crypto Mode depended register 3                            */
  __IM  uint32_t  RESERVED[53];
  __IOM uint32_t  CRYPTO_KEYS_START;            /*!< (@ 0x00000100) Crypto First position of the AES keys storage
                                                                    memory                                                     */
} AES_HASH_Type;                                /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                          ANAMISC                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief ANAMISC registers (ANAMISC)
  */

typedef struct {                                /*!< (@ 0x50001B00) ANAMISC Structure                                          */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  ANA_TEST_REG;                 /*!< (@ 0x00000002) Analog test registers                                      */
  __IM  uint32_t  RESERVED1;
  __IOM uint16_t  CHARGER_CTRL1_REG;            /*!< (@ 0x00000008) Charger control register 1                                 */
  __IOM uint16_t  CHARGER_CTRL2_REG;            /*!< (@ 0x0000000A) Charger control register 2                                 */
  __IOM uint16_t  CHARGER_STATUS_REG;           /*!< (@ 0x0000000C) Charger status and trimming register                       */
  __IM  uint16_t  RESERVED2[25];
  __IOM uint16_t  SOC_CTRL1_REG;                /*!< (@ 0x00000040) Fuel Gauge Control register 1                              */
  __IOM uint16_t  SOC_CTRL2_REG;                /*!< (@ 0x00000042) Fuel Gauge Control register 2                              */
  __IOM uint16_t  SOC_CTRL3_REG;                /*!< (@ 0x00000044) Fuel Gauge Control register 3                              */
  __IOM uint16_t  SOC_ADD2CH_REG;               /*!< (@ 0x00000046) Fuel Gauge manually add extra charge to SOC_CHARGE_CNTRx_REG */
  __IOM uint16_t  SOC_CHARGE_CNTR1_REG;         /*!< (@ 0x00000048) Fuel Gauge Charge counter bits 15-0                        */
  __IOM uint16_t  SOC_CHARGE_CNTR2_REG;         /*!< (@ 0x0000004A) Fuel Gauge Charge counter bits 31-16                       */
  __IOM uint16_t  SOC_CHARGE_CNTR3_REG;         /*!< (@ 0x0000004C) Fuel Gauge Charge counter bits 39-32                       */
  __IM  uint16_t  RESERVED3;
  __IOM uint16_t  SOC_CHARGE_AVG_REG;           /*!< (@ 0x00000050) Fuel Gauge Average charge counter                          */
  __IOM uint16_t  SOC_STATUS_REG;               /*!< (@ 0x00000052) Fuel Gauge Status register                                 */
  __IOM uint16_t  SOC_EXT_IN_REG;               /*!< (@ 0x00000054) Fuel Gauge input test register                             */
  __IOM uint16_t  SOC_EXT_OUT_REG;              /*!< (@ 0x00000056) Fuel Gauge output test register                            */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint16_t  CLK_REF_SEL_REG;              /*!< (@ 0x00000060) Select clock for oscillator calibration                    */
  __IOM uint16_t  CLK_REF_CNT_REG;              /*!< (@ 0x00000062) Count value for oscillator calibration                     */
  __IOM uint16_t  CLK_REF_VAL_L_REG;            /*!< (@ 0x00000064) DIVN reference cycles, lower 16 bits                       */
  __IOM uint16_t  CLK_REF_VAL_H_REG;            /*!< (@ 0x00000066) DIVN reference cycles, upper 16 bits                       */
} ANAMISC_Type;                                 /*!< Size = 104 (0x68)                                                         */



/* =========================================================================================================================== */
/* ================                                            APU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief APU registers (APU)
  */

typedef struct {                                /*!< (@ 0x50004000) APU Structure                                              */
  __IOM uint32_t  SRC1_CTRL_REG;                /*!< (@ 0x00000000) SRC1 control register                                      */
  __IOM uint32_t  SRC1_IN_FS_REG;               /*!< (@ 0x00000004) SRC1 Sample input rate                                     */
  __IOM uint32_t  SRC1_OUT_FS_REG;              /*!< (@ 0x00000008) SRC1 Sample output rate                                    */
  __IOM uint32_t  SRC1_IN1_REG;                 /*!< (@ 0x0000000C) SRC1 data in 1                                             */
  __IOM uint32_t  SRC1_IN2_REG;                 /*!< (@ 0x00000010) SRC1 data in 2                                             */
  __IOM uint32_t  SRC1_OUT1_REG;                /*!< (@ 0x00000014) SRC1 data out 1                                            */
  __IOM uint32_t  SRC1_OUT2_REG;                /*!< (@ 0x00000018) SRC1 data out 2                                            */
  __IOM uint32_t  APU_MUX_REG;                  /*!< (@ 0x0000001C) APU mux register                                           */
  __IOM uint32_t  COEF10_SET1_REG;              /*!< (@ 0x00000020) SRC coefficient 1,0 set 1                                  */
  __IOM uint32_t  COEF32_SET1_REG;              /*!< (@ 0x00000024) SRC coefficient 3,2 set 1                                  */
  __IOM uint32_t  COEF54_SET1_REG;              /*!< (@ 0x00000028) SRC coefficient 5,4 set 1                                  */
  __IOM uint32_t  COEF76_SET1_REG;              /*!< (@ 0x0000002C) SRC coefficient 7,6 set 1                                  */
  __IOM uint32_t  COEF98_SET1_REG;              /*!< (@ 0x00000030) SRC coefficient 9,8 set 1                                  */
  __IOM uint32_t  COEF0A_SET1_REG;              /*!< (@ 0x00000034) SRC coefficient 10 set 1                                   */
  __IM  uint32_t  RESERVED[50];
  __IOM uint32_t  PCM1_CTRL_REG;                /*!< (@ 0x00000100) PCM1 Control register                                      */
  __IOM uint32_t  PCM1_IN1_REG;                 /*!< (@ 0x00000104) PCM1 data in 1                                             */
  __IOM uint32_t  PCM1_IN2_REG;                 /*!< (@ 0x00000108) PCM1 data in 2                                             */
  __IOM uint32_t  PCM1_OUT1_REG;                /*!< (@ 0x0000010C) PCM1 data out 1                                            */
  __IOM uint32_t  PCM1_OUT2_REG;                /*!< (@ 0x00000110) PCM1 data out 2                                            */
} APU_Type;                                     /*!< Size = 276 (0x114)                                                        */



/* =========================================================================================================================== */
/* ================                                            BLE                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief BLE registers (BLE)
  */

