S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x40000000) BLE Structure                                              */
  __IOM uint32_t  BLE_RWBLECNTL_REG;            /*!< (@ 0x00000000) BLE Control register                                       */
  __IOM uint32_t  BLE_VERSION_REG;              /*!< (@ 0x00000004) Version register                                           */
  __IOM uint32_t  BLE_RWBLECONF_REG;            /*!< (@ 0x00000008) Configuration register                                     */
  __IOM uint32_t  BLE_INTCNTL_REG;              /*!< (@ 0x0000000C) Interrupt controller register                              */
  __IOM uint32_t  BLE_INTSTAT_REG;              /*!< (@ 0x00000010) Interrupt status register                                  */
  __IOM uint32_t  BLE_INTRAWSTAT_REG;           /*!< (@ 0x00000014) Interrupt raw status register                              */
  __IOM uint32_t  BLE_INTACK_REG;               /*!< (@ 0x00000018) Interrupt acknowledge register                             */
  __IOM uint32_t  BLE_BASETIMECNT_REG;          /*!< (@ 0x0000001C) Base time reference counter                                */
  __IOM uint32_t  BLE_FINETIMECNT_REG;          /*!< (@ 0x00000020) Fine time reference counter                                */
  __IOM uint32_t  BLE_BDADDRL_REG;              /*!< (@ 0x00000024) BLE device address LSB register                            */
  __IOM uint32_t  BLE_BDADDRU_REG;              /*!< (@ 0x00000028) BLE device address MSB register                            */
  __IOM uint32_t  BLE_CURRENTRXDESCPTR_REG;     /*!< (@ 0x0000002C) Rx Descriptor Pointer for the Receive Buffer
                                                                    Chained List                                               */
  __IOM uint32_t  BLE_DEEPSLCNTL_REG;           /*!< (@ 0x00000030) Deep-Sleep control register                                */
  __IOM uint32_t  BLE_DEEPSLWKUP_REG;           /*!< (@ 0x00000034) Time (measured in Low Power clock cycles) in
                                                                    Deep Sleep Mode before waking-up the device                */
  __IOM uint32_t  BLE_DEEPSLSTAT_REG;           /*!< (@ 0x00000038) Duration of the last deep sleep phase register             */
  __IOM uint32_t  BLE_ENBPRESET_REG;            /*!< (@ 0x0000003C) Time in low power oscillator cycles register               */
  __IOM uint32_t  BLE_FINECNTCORR_REG;          /*!< (@ 0x00000040) Phase correction value register                            */
  __IOM uint32_t  BLE_BASETIMECNTCORR_REG;      /*!< (@ 0x00000044) Base Time Counter                                          */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  BLE_DIAGCNTL_REG;             /*!< (@ 0x00000050) Diagnostics Register                                       */
  __IOM uint32_t  BLE_DIAGSTAT_REG;             /*!< (@ 0x00000054) Debug use only                                             */
  __IOM uint32_t  BLE_DEBUGADDMAX_REG;          /*!< (@ 0x00000058) Upper limit for the memory zone                            */
  __IOM uint32_t  BLE_DEBUGADDMIN_REG;          /*!< (@ 0x0000005C) Lower limit for the memory zone                            */
  __IOM uint32_t  BLE_ERRORTYPESTAT_REG;        /*!< (@ 0x00000060) Error Type Status registers                                */
  __IOM uint32_t  BLE_SWPROFILING_REG;          /*!< (@ 0x00000064) Software Profiling register                                */
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  BLE_RADIOCNTL0_REG;           /*!< (@ 0x00000070) Radio interface control register                           */
  __IOM uint32_t  BLE_RADIOCNTL1_REG;           /*!< (@ 0x00000074) Radio interface control register                           */
  __IOM uint32_t  BLE_RADIOCNTL2_REG;           /*!< (@ 0x00000078) Radio interface control register                           */
  __IOM uint32_t  BLE_RADIOCNTL3_REG;           /*!< (@ 0x0000007C) Radio interface control register                           */
  __IOM uint32_t  BLE_RADIOPWRUPDN_REG;         /*!< (@ 0x00000080) RX/TX power up/down phase register                         */
  __IM  uint32_t  RESERVED2[3];
  __IOM uint32_t  BLE_ADVCHMAP_REG;             /*!< (@ 0x00000090) Advertising Channel Map                                    */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  BLE_ADVTIM_REG;               /*!< (@ 0x000000A0) Advertising Packet Interval                                */
  __IOM uint32_t  BLE_ACTSCANSTAT_REG;          /*!< (@ 0x000000A4) Active scan register                                       */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  BLE_WLPUBADDPTR_REG;          /*!< (@ 0x000000B0) Start address of public devices list                       */
  __IOM uint32_t  BLE_WLPRIVADDPTR_REG;         /*!< (@ 0x000000B4) Start address of private devices list                      */
  __IOM uint32_t  BLE_WLNBDEV_REG;              /*!< (@ 0x000000B8) Devices in white list                                      */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  BLE_AESCNTL_REG;              /*!< (@ 0x000000C0) Start AES register                                         */
  __IOM uint32_t  BLE_AESKEY31_0_REG;           /*!< (@ 0x000000C4) AES encryption key                                         */
  __IOM uint32_t  BLE_AESKEY63_32_REG;          /*!< (@ 0x000000C8) AES encryption key                                         */
  __IOM uint32_t  BLE_AESKEY95_64_REG;          /*!< (@ 0x000000CC) AES encryption key                                         */
  __IOM uint32_t  BLE_AESKEY127_96_REG;         /*!< (@ 0x000000D0) AES encryption key                                         */
  __IOM uint32_t  BLE_AESPTR_REG;               /*!< (@ 0x000000D4) Pointer to the block to encrypt/decrypt                    */
  __IOM uint32_t  BLE_TXMICVAL_REG;             /*!< (@ 0x000000D8) AES / CCM plain MIC value                                  */
  __IOM uint32_t  BLE_RXMICVAL_REG;             /*!< (@ 0x000000DC) AES / CCM plain MIC value                                  */
  __IOM uint32_t  BLE_RFTESTCNTL_REG;           /*!< (@ 0x000000E0) RF Testing Register                                        */
  __IOM uint32_t  BLE_RFTESTTXSTAT_REG;         /*!< (@ 0x000000E4) RF Testing Register                                        */
  __IOM uint32_t  BLE_RFTESTRXSTAT_REG;         /*!< (@ 0x000000E8) RF Testing Register                                        */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  BLE_TIMGENCNTL_REG;           /*!< (@ 0x000000F0) Timing Generator Register                                  */
  __IOM uint32_t  BLE_GROSSTIMTGT_REG;          /*!< (@ 0x000000F4) Gross Timer Target value                                   */
  __IOM uint32_t  BLE_FINETIMTGT_REG;           /*!< (@ 0x000000F8) Fine Timer Target value                                    */
  __IOM uint32_t  BLE_SAMPLECLK_REG;            /*!< (@ 0x000000FC) Samples the Base Time Counter                              */
  __IOM uint32_t  BLE_COEXIFCNTL0_REG;          /*!< (@ 0x00000100) Coexistence interface Control 0 Register                   */
  __IOM uint32_t  BLE_COEXIFCNTL1_REG;          /*!< (@ 0x00000104) Coexistence interface Control 1 Register                   */
  __IOM uint32_t  BLE_BLEMPRIO0_REG;            /*!< (@ 0x00000108) Coexistence interface Priority 0 Register                  */
  __IOM uint32_t  BLE_BLEMPRIO1_REG;            /*!< (@ 0x0000010C) Coexistence interface Priority 1 Register                  */
  __IOM uint32_t  BLE_BLEPRIOSCHARB_REG;        /*!< (@ 0x00000110) Priority Scheduling Arbiter Control Register               */
  __IM  uint32_t  RESERVED7[59];
  __IOM uint32_t  BLE_CNTL2_REG;                /*!< (@ 0x00000200) BLE Control Register 2                                     */
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  BLE_EM_BASE_REG;              /*!< (@ 0x00000208) Exchange Memory Base Register                              */
  __IOM uint32_t  BLE_DIAGCNTL2_REG;            /*!< (@ 0x0000020C) Debug use only                                             */
  __IOM uint32_t  BLE_DIAGCNTL3_REG;            /*!< (@ 0x00000210) Debug use only                                             */
} BLE_Type;                                     /*!< Size = 532 (0x214)                                                        */



/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CACHE registers (CACHE)
  */

typedef struct {                                /*!< (@ 0x400C3000) CACHE Structure                                            */
  __IOM uint32_t  CACHE_CTRL1_REG;              /*!< (@ 0x00000000) Cache control register 1                                   */
  __IOM uint32_t  CACHE_LNSIZECFG_REG;          /*!< (@ 0x00000004) Cache line size configuration register                     */
  __IOM uint32_t  CACHE_ASSOCCFG_REG;           /*!< (@ 0x00000008) Cache associativity configuration register                 */
  __IM  uint32_t  RESERVED[5];
  __IOM uint32_t  CACHE_CTRL2_REG;              /*!< (@ 0x00000020) Cache control register 2                                   */
  __IOM uint32_t  CACHE_CTRL3_REG;              /*!< (@ 0x00000024) Cache control register 3 (for the Cache Controller
                                                                    configuration reset values)                                */
  __IOM uint32_t  CACHE_MRM_HITS_REG;           /*!< (@ 0x00000028) Cache MRM (Miss Rate Monitor) HITS register                */
  __IOM uint32_t  CACHE_MRM_MISSES_REG;         /*!< (@ 0x0000002C) Cache MRM (Miss Rate Monitor) MISSES register              */
  __IOM uint32_t  CACHE_MRM_CTRL_REG;           /*!< (@ 0x00000030) Cache MRM (Miss Rate Monitor) CONTROL register             */
  __IOM uint32_t  CACHE_MRM_TINT_REG;           /*!< (@ 0x00000034) Cache MRM (Miss Rate Monitor) TIME INTERVAL register       */
  __IOM uint32_t  CACHE_MRM_THRES_REG;          /*!< (@ 0x00000038) Cache MRM (Miss Rate Monitor) THRESHOLD register           */
  __IM  uint32_t  RESERVED1[5];
  __IOM uint32_t  SWD_RESET_REG;                /*!< (@ 0x00000050) SWD HW reset control register                              */
} CACHE_Type;                                   /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                       CHIP_VERSION                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief CHIP_VERSION registers (CHIP_VERSION)
  */

typedef struct {                                /*!< (@ 0x50003200) CHIP_VERSION Structure                                     */
  __IOM uint8_t   CHIP_ID1_REG;                 /*!< (@ 0x00000000) Chip identification register 1.                            */
  __IOM uint8_t   CHIP_ID2_REG;                 /*!< (@ 0x00000001) Chip identification register 2.                            */
  __IOM uint8_t   CHIP_ID3_REG;                 /*!< (@ 0x00000002) Chip identification register 3.                            */
  __IOM uint8_t   CHIP_SWC_REG;                 /*!< (@ 0x00000003) Software compatibility register.                           */
  __IOM uint8_t   CHIP_REVISION_REG;            /*!< (@ 0x00000004) Chip revision register.                                    */
  __IOM uint8_t   CHIP_CONFIG1_REG;             /*!< (@ 0x00000005) Chip configuration register 1.                             */
  __IOM uint8_t   CHIP_CONFIG2_REG;             /*!< (@ 0x00000006) Chip configuration register 2.                             */
  __IOM uint8_t   CHIP_CONFIG3_REG;             /*!< (@ 0x00000007) Chip configuration register 3.                             */
  __IM  uint16_t  RESERVED;
  __IOM uint8_t   CHIP_TEST1_REG;               /*!< (@ 0x0000000A) Chip test register 1.                                      */
  __IOM uint8_t   CHIP_TEST2_REG;               /*!< (@ 0x0000000B) Chip test register 2.                                      */
} CHIP_VERSION_Type;                            /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           COEX                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief COEX registers (COEX)
  */

