S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50002F00) COEX Structure                                             */
  __IOM uint16_t  COEX_CTRL_REG;                /*!< (@ 0x00000000) COEX Control Register                                      */
  __IOM uint16_t  COEX_STAT_REG;                /*!< (@ 0x00000002) COEX Status Register                                       */
  __IOM uint16_t  COEX_INT_MASK_REG;            /*!< (@ 0x00000004) COEX Interrupt Mask Register                               */
  __IOM uint16_t  COEX_INT_STAT_REG;            /*!< (@ 0x00000006) COEX Interrupt Status Register                             */
  __IOM uint16_t  COEX_BLE_PTI_REG;             /*!< (@ 0x00000008) COEX BLE PTI Control Register                              */
  __IOM uint16_t  COEX_FTDF_PTI_REG;            /*!< (@ 0x0000000A) COEX FTDF PTI Control Register                             */
  __IOM uint16_t  COEX_DIAG_REG;                /*!< (@ 0x0000000C) COEX Diagnostic Monitor Register                           */
  __IM  uint16_t  RESERVED[2];
  __IOM uint16_t  COEX_PRI1_REG;                /*!< (@ 0x00000012) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI2_REG;                /*!< (@ 0x00000014) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI3_REG;                /*!< (@ 0x00000016) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI4_REG;                /*!< (@ 0x00000018) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI5_REG;                /*!< (@ 0x0000001A) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI6_REG;                /*!< (@ 0x0000001C) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI7_REG;                /*!< (@ 0x0000001E) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI8_REG;                /*!< (@ 0x00000020) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI9_REG;                /*!< (@ 0x00000022) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI10_REG;               /*!< (@ 0x00000024) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI11_REG;               /*!< (@ 0x00000026) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI12_REG;               /*!< (@ 0x00000028) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI13_REG;               /*!< (@ 0x0000002A) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI14_REG;               /*!< (@ 0x0000002C) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI15_REG;               /*!< (@ 0x0000002E) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI16_REG;               /*!< (@ 0x00000030) COEX Priority Register                                     */
  __IOM uint16_t  COEX_PRI17_REG;               /*!< (@ 0x00000032) COEX Priority Register                                     */
} COEX_Type;                                    /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_PER                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_PER registers (CRG_PER)
  */

typedef struct {                                /*!< (@ 0x50001C00) CRG_PER Structure                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint16_t  CLK_PER_REG;                  /*!< (@ 0x00000004) Peripheral divider register                                */
  __IM  uint16_t  RESERVED1[29];
  __IOM uint16_t  PCM_DIV_REG;                  /*!< (@ 0x00000040) PCM divider and enables                                    */
  __IOM uint16_t  PCM_FDIV_REG;                 /*!< (@ 0x00000042) PCM fractional division register                           */
  __IOM uint16_t  PDM_DIV_REG;                  /*!< (@ 0x00000044) PDM divider and enables                                    */
  __IOM uint16_t  SRC_DIV_REG;                  /*!< (@ 0x00000046) SRC divider and enables                                    */
  __IOM uint16_t  EH_REG;                       /*!< (@ 0x00000048) EH_REG                                                     */
  __IOM uint16_t  USBPAD_REG;                   /*!< (@ 0x0000004A) USB pads control register                                  */
} CRG_PER_Type;                                 /*!< Size = 76 (0x4c)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_TOP                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_TOP registers (CRG_TOP)
  */

typedef struct {                                /*!< (@ 0x50000000) CRG_TOP Structure                                          */
  __IOM uint16_t  CLK_AMBA_REG;                 /*!< (@ 0x00000000) HCLK, PCLK, divider and clock gates                        */
  __IOM uint16_t  CLK_FREQ_TRIM_REG;            /*!< (@ 0x00000002) Xtal frequency trimming register.                          */
  __IM  uint32_t  RESERVED;
  __IOM uint16_t  CLK_RADIO_REG;                /*!< (@ 0x00000008) Radio PLL control register                                 */
  __IOM uint16_t  CLK_CTRL_REG;                 /*!< (@ 0x0000000A) Clock control register                                     */
  __IOM uint16_t  CLK_TMR_REG;                  /*!< (@ 0x0000000C) Clock control for the timers                               */
  __IM  uint16_t  RESERVED1;
  __IOM uint16_t  PMU_CTRL_REG;                 /*!< (@ 0x00000010) Power Management Unit control register                     */
  __IOM uint16_t  SYS_CTRL_REG;                 /*!< (@ 0x00000012) System Control register                                    */
  __IOM uint16_t  SYS_STAT_REG;                 /*!< (@ 0x00000014) System status register                                     */
  __IOM uint16_t  TRIM_CTRL_REG;                /*!< (@ 0x00000016) Control trimming of the XTAL16M                            */
  __IOM uint16_t  DIVN_SYNC_REG;                /*!< (@ 0x00000018) Trigger to sync DIVN with the RF clock divider
                                                                    in case of 32 MHz crystal                                  */
  __IM  uint16_t  RESERVED2[3];
  __IOM uint16_t  CLK_32K_REG;                  /*!< (@ 0x00000020) 32 kHz oscillator register                                 */
  __IOM uint16_t  CLK_16M_REG;                  /*!< (@ 0x00000022) 16 MHz RC and xtal oscillator register                     */
  __IOM uint16_t  CLK_RCX20K_REG;               /*!< (@ 0x00000024) 20KHz RXC-oscillator control register                      */
  __IM  uint16_t  RESERVED3;
  __IOM uint16_t  BANDGAP_REG;                  /*!< (@ 0x00000028) bandgap trimming                                           */
  __IOM uint16_t  ANA_STATUS_REG;               /*!< (@ 0x0000002A) status bit of analog (power management) circuits           */
  __IOM uint16_t  STARTUP_STATUS_REG;           /*!< (@ 0x0000002C) Startup timeout bits                                       */
  __IM  uint16_t  RESERVED4;
  __IOM uint16_t  VBUS_IRQ_MASK_REG;            /*!< (@ 0x00000030) IRQ masking                                                */
  __IOM uint16_t  VBUS_IRQ_CLEAR_REG;           /*!< (@ 0x00000032) Clear pending IRQ register                                 */
  __IOM uint16_t  BOD_CTRL_REG;                 /*!< (@ 0x00000034) Brown Out Detection control register                       */
  __IOM uint16_t  BOD_CTRL2_REG;                /*!< (@ 0x00000036) Brown Out Detection control register                       */
  __IOM uint16_t  BOD_STATUS_REG;               /*!< (@ 0x00000038) Brown Out Detection status register                        */
  __IOM uint16_t  LDO_CTRL1_REG;                /*!< (@ 0x0000003A) LDO control register                                       */
  __IOM uint16_t  LDO_CTRL2_REG;                /*!< (@ 0x0000003C) LDO control register                                       */
  __IOM uint16_t  SLEEP_TIMER_REG;              /*!< (@ 0x0000003E) Timer for regulated sleep                                  */
  __IOM uint16_t  POWER_CTRL_REG;               /*!< (@ 0x00000040) Power control register                                     */
  __IM  uint16_t  RESERVED5[7];
  __IOM uint16_t  XTALRDY_CTRL_REG;             /*!< (@ 0x00000050) Control register for XTALRDY IRQ                           */
  __IOM uint16_t  XTALRDY_STAT_REG;             /*!< (@ 0x00000052) Difference between XTAL_OK and XTALRDY_IRQ in
                                                                    LP clock cycles                                            */
  __IM  uint32_t  RESERVED6[3];
  __IOM uint16_t  FORCE_SLEEP_REG;              /*!< (@ 0x00000060) Force FTDF/BLE to sleep                                    */
  __IOM uint16_t  LDOS_DISABLE_REG;             /*!< (@ 0x00000062) Force off all LDOs                                         */
  __IOM uint16_t  AON_SPARE_REG;                /*!< (@ 0x00000064) Spare register                                             */
} CRG_TOP_Type;                                 /*!< Size = 102 (0x66)                                                         */



/* =========================================================================================================================== */
/* ================                                           DCDC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DCDC registers (DCDC)
  */

typedef struct {                                /*!< (@ 0x50000080) DCDC Structure                                             */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  DCDC_CTRL_0_REG;              /*!< (@ 0x00000002) DCDC First Control Register                                */
  __IOM uint16_t  DCDC_CTRL_1_REG;              /*!< (@ 0x00000004) DCDC Second Control Register                               */
  __IOM uint16_t  DCDC_CTRL_2_REG;              /*!< (@ 0x00000006) DCDC Third Control Register                                */
  __IOM uint16_t  DCDC_V14_0_REG;               /*!< (@ 0x00000008) DCDC V14 First Control Register                            */
  __IOM uint16_t  DCDC_V14_1_REG;               /*!< (@ 0x0000000A) DCDC V14 Second Control Register                           */
  __IOM uint16_t  DCDC_V18_0_REG;               /*!< (@ 0x0000000C) DCDC V18 First Control Register                            */
  __IOM uint16_t  DCDC_V18_1_REG;               /*!< (@ 0x0000000E) DCDC V18 Second Control Register                           */
  __IOM uint16_t  DCDC_VDD_0_REG;               /*!< (@ 0x00000010) DCDC VDD First Control Register                            */
  __IOM uint16_t  DCDC_VDD_1_REG;               /*!< (@ 0x00000012) DCDC VDD Second Control Register                           */
  __IOM uint16_t  DCDC_V18P_0_REG;              /*!< (@ 0x00000014) DCDC VPA First Control Register                            */
  __IOM uint16_t  DCDC_V18P_1_REG;              /*!< (@ 0x00000016) DCDC VPA Second Control Register                           */
  __IOM uint16_t  DCDC_RET_0_REG;               /*!< (@ 0x00000018) DCDC First Retention Mode Register                         */
  __IOM uint16_t  DCDC_RET_1_REG;               /*!< (@ 0x0000001A) DCDC Second Retention Mode Register                        */
  __IOM uint16_t  DCDC_TRIM_REG;                /*!< (@ 0x0000001C) DCDC Comparator Trim Register                              */
  __IOM uint16_t  DCDC_TEST_0_REG;              /*!< (@ 0x0000001E) DCDC Test Register                                         */
  __IOM uint16_t  DCDC_TEST_1_REG;              /*!< (@ 0x00000020) DCDC Test Register                                         */
  __IOM uint16_t  DCDC_STATUS_0_REG;            /*!< (@ 0x00000022) DCDC First Status Register                                 */
  __IOM uint16_t  DCDC_STATUS_1_REG;            /*!< (@ 0x00000024) DCDC Second Status Register                                */
  __IOM uint16_t  DCDC_STATUS_2_REG;            /*!< (@ 0x00000026) DCDC Third Status Register                                 */
  __IOM uint16_t  DCDC_STATUS_3_REG;            /*!< (@ 0x00000028) DCDC Fourth Status Register                                */
  __IOM uint16_t  DCDC_STATUS_4_REG;            /*!< (@ 0x0000002A) DCDC Fifth Status Register                                 */
  __IOM uint16_t  DCDC_TRIM_0_REG;              /*!< (@ 0x0000002C) DCDC V14 Comparator Trim Register                          */
  __IOM uint16_t  DCDC_TRIM_1_REG;              /*!< (@ 0x0000002E) DCDC V18 Comparator Trim Register                          */
  __IOM uint16_t  DCDC_TRIM_2_REG;              /*!< (@ 0x00000030) DCDC VDD Comparator Trim Register                          */
  __IOM uint16_t  DCDC_TRIM_3_REG;              /*!< (@ 0x00000032) DCDC VPA Comparator Trim Register                          */
  __IOM uint16_t  DCDC_IRQ_STATUS_REG;          /*!< (@ 0x00000034) DCDC Interrupt Status Register                             */
  __IOM uint16_t  DCDC_IRQ_CLEAR_REG;           /*!< (@ 0x00000036) DCDC Interrupt Clear Register                              */
  __IOM uint16_t  DCDC_IRQ_MASK_REG;            /*!< (@ 0x00000038) DCDC Interrupt Clear Register                              */
} DCDC_Type;                                    /*!< Size = 58 (0x3a)                                                          */



/* =========================================================================================================================== */
/* ================                                            DEM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DEM registers (DEM)
  */

typedef struct {                                /*!< (@ 0x50002E00) DEM Structure                                              */
  __IOM uint16_t  RF_DEM_CTRL_REG;              /*!< (@ 0x00000000) RF_DEM_CTRL_REG                                            */
  __IOM uint16_t  RF_AGC_LUT_01_REG;            /*!< (@ 0x00000002) RF_AGC_LUT_01_REG                                          */
  __IOM uint16_t  RF_AGC_LUT_23_REG;            /*!< (@ 0x00000004) RF_AGC_LUT_23_REG                                          */
  __IOM uint16_t  RF_AGC_LUT_45_REG;            /*!< (@ 0x00000006) RF_AGC_LUT_45_REG                                          */
  __IOM uint16_t  RF_AGC_LUT_67_REG;            /*!< (@ 0x00000008) RF_AGC_LUT_67_REG                                          */
  __IOM uint16_t  RF_AGC_LUT_89_REG;            /*!< (@ 0x0000000A) RF_AGC_LUT_89_REG                                          */
  __IOM uint16_t  RF_AGC_CTRL1_REG;             /*!< (@ 0x0000000C) RF_AGC_CTRL1_REG                                           */
  __IOM uint16_t  RF_AGC_CTRL2_REG;             /*!< (@ 0x0000000E) RF_AGC_CTRL2_REG                                           */
  __IOM uint16_t  RF_AFC_CTRL_REG;              /*!< (@ 0x00000010) RF_AFC_CTRL_REG                                            */
  __IOM uint16_t  RF_DC_OFFSET_CTRL1_REG;       /*!< (@ 0x00000012) RF_DC_OFFSET_CTRL1_REG                                     */
  __IOM uint16_t  RF_DC_OFFSET_CTRL2_REG;       /*!< (@ 0x00000014) RF_DC_OFFSET_CTRL2_REG                                     */
  __IOM uint16_t  RF_DC_OFFSET_CTRL3_REG;       /*!< (@ 0x00000016) RF_DC_OFFSET_CTRL3_REG                                     */
  __IOM uint16_t  RF_DC_OFFSET_CTRL4_REG;       /*!< (@ 0x00000018) RF_DC_OFFSET_CTRL4_REG                                     */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  RF_AGC_RESULT_REG;            /*!< (@ 0x0000001C) RF_AGC_RESULT_REG                                          */
  __IOM uint16_t  RF_RSSI_RESULT_REG;           /*!< (@ 0x0000001E) RF_RSSI_RESULT_REG                                         */
  __IOM uint16_t  RF_DC_OFFSET_RESULT_REG;      /*!< (@ 0x00000020) Must be Retained                                           */
  __IOM uint16_t  RF_RSSI_COMP_CTRL_REG;        /*!< (@ 0x00000022) RF_RSSI_COMP_CTRL_REG                                      */
  __IM  uint32_t  RESERVED1[3];
  __IOM uint16_t  RF_FTDF_CTRL1_REG;            /*!< (@ 0x00000030) RF_FTDF_CTRL1_REG                                          */
  __IOM uint16_t  RF_FTDF_CTRL2_REG;            /*!< (@ 0x00000032) RF_FTDF_CTRL2_REG                                          */
  __IOM uint16_t  RF_FTDF_CTRL3_REG;            /*!< (@ 0x00000034) RF_FTDF_CTRL3_REG                                          */
  __IOM uint16_t  RF_FTDF_CTRL4_REG;            /*!< (@ 0x00000036) RF_FTDF_CTRL4_REG                                          */
  __IOM uint16_t  RF_FTDF_LOOP_GAIN_PD_REG;     /*!< (@ 0x00000038) RF_FTDF_LOOP_GAIN_PD_REG                                   */
  __IOM uint16_t  RF_FTDF_LOOP_GAIN_DS_REG;     /*!< (@ 0x0000003A) RF_FTDF_LOOP_GAIN_DS_REG                                   */
  __IOM uint16_t  RF_FTDF_CTRL5_REG;            /*!< (@ 0x0000003C) RF_FTDF_CTRL5_REG                                          */
  __IOM uint16_t  RF_FTDF_COBI_LOW_REG;         /*!< (@ 0x0000003E) RF_FTDF_COBI_LOW_REG                                       */
  __IOM uint16_t  RF_FTDF_COBI_HIGH_REG;        /*!< (@ 0x00000040) RF_FTDF_COBI_HIGH_REG                                      */
  __IOM uint16_t  RF_DEM_TESTMODE_REG;          /*!< (@ 0x00000042) RF_DEM_TESTMODE_REG                                        */
  __IOM uint16_t  RF_DEM_IQCORRECT_REG;         /*!< (@ 0x00000044) RF_DEM_IQCORRECT_REG                                       */
  __IOM uint16_t  RF_PAD_CNT_CTRL_REG;          /*!< (@ 0x00000046) RF_PAD_CNT_CTRL_REG                                        */
  __IOM uint16_t  RF_PAD_CNT_RESULT_REG;        /*!< (@ 0x00000048) RF_PAD_CNT_RESULT_REG                                      */
  __IM  uint16_t  RESERVED2[3];
  __IOM uint16_t  RF_FSSS_I_RESULT_REG;         /*!< (@ 0x00000050) RF_FSSS_I_RESULT_REG                                       */
  __IOM uint16_t  RF_FSSS_Q_RESULT_REG;         /*!< (@ 0x00000052) RF_FSSS_Q_RESULT_REG                                       */
  __IOM uint16_t  RF_FSSS_MAG_RESULT_REG;       /*!< (@ 0x00000054) RF_FSSS_MAG_RESULT_REG                                     */
} DEM_Type;                                     /*!< Size = 86 (0x56)                                                          */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA registers (DMA)
  */

