S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50003500) DMA Structure                                              */
  __IOM uint16_t  DMA0_A_STARTL_REG;            /*!< (@ 0x00000000) Start address Low A of DMA channel 0                       */
  __IOM uint16_t  DMA0_A_STARTH_REG;            /*!< (@ 0x00000002) Start address High A of DMA channel 0                      */
  __IOM uint16_t  DMA0_B_STARTL_REG;            /*!< (@ 0x00000004) Start address Low B of DMA channel 0                       */
  __IOM uint16_t  DMA0_B_STARTH_REG;            /*!< (@ 0x00000006) Start address High B of DMA channel 0                      */
  __IOM uint16_t  DMA0_INT_REG;                 /*!< (@ 0x00000008) DMA receive interrupt register channel 0                   */
  __IOM uint16_t  DMA0_LEN_REG;                 /*!< (@ 0x0000000A) DMA receive length register channel 0                      */
  __IOM uint16_t  DMA0_CTRL_REG;                /*!< (@ 0x0000000C) Control register for the DMA channel 0                     */
  __IOM uint16_t  DMA0_IDX_REG;                 /*!< (@ 0x0000000E) Index value of DMA channel 0                               */
  __IOM uint16_t  DMA1_A_STARTL_REG;            /*!< (@ 0x00000010) Start address Low A of DMA channel 1                       */
  __IOM uint16_t  DMA1_A_STARTH_REG;            /*!< (@ 0x00000012) Start address High A of DMA channel 1                      */
  __IOM uint16_t  DMA1_B_STARTL_REG;            /*!< (@ 0x00000014) Start address Low B of DMA channel 1                       */
  __IOM uint16_t  DMA1_B_STARTH_REG;            /*!< (@ 0x00000016) Start address High B of DMA channel 1                      */
  __IOM uint16_t  DMA1_INT_REG;                 /*!< (@ 0x00000018) DMA receive interrupt register channel 1                   */
  __IOM uint16_t  DMA1_LEN_REG;                 /*!< (@ 0x0000001A) DMA receive length register channel 1                      */
  __IOM uint16_t  DMA1_CTRL_REG;                /*!< (@ 0x0000001C) Control register for the DMA channel 1                     */
  __IOM uint16_t  DMA1_IDX_REG;                 /*!< (@ 0x0000001E) Index value of DMA channel 1                               */
  __IOM uint16_t  DMA2_A_STARTL_REG;            /*!< (@ 0x00000020) Start address Low A of DMA channel 2                       */
  __IOM uint16_t  DMA2_A_STARTH_REG;            /*!< (@ 0x00000022) Start address High A of DMA channel 2                      */
  __IOM uint16_t  DMA2_B_STARTL_REG;            /*!< (@ 0x00000024) Start address Low B of DMA channel 2                       */
  __IOM uint16_t  DMA2_B_STARTH_REG;            /*!< (@ 0x00000026) Start address High B of DMA channel 2                      */
  __IOM uint16_t  DMA2_INT_REG;                 /*!< (@ 0x00000028) DMA receive interrupt register channel 2                   */
  __IOM uint16_t  DMA2_LEN_REG;                 /*!< (@ 0x0000002A) DMA receive length register channel 2                      */
  __IOM uint16_t  DMA2_CTRL_REG;                /*!< (@ 0x0000002C) Control register for the DMA channel 2                     */
  __IOM uint16_t  DMA2_IDX_REG;                 /*!< (@ 0x0000002E) Index value of DMA channel 2                               */
  __IOM uint16_t  DMA3_A_STARTL_REG;            /*!< (@ 0x00000030) Start address Low A of DMA channel 3                       */
  __IOM uint16_t  DMA3_A_STARTH_REG;            /*!< (@ 0x00000032) Start address High A of DMA channel 3                      */
  __IOM uint16_t  DMA3_B_STARTL_REG;            /*!< (@ 0x00000034) Start address Low B of DMA channel 3                       */
  __IOM uint16_t  DMA3_B_STARTH_REG;            /*!< (@ 0x00000036) Start address High B of DMA channel 3                      */
  __IOM uint16_t  DMA3_INT_REG;                 /*!< (@ 0x00000038) DMA receive interrupt register channel 3                   */
  __IOM uint16_t  DMA3_LEN_REG;                 /*!< (@ 0x0000003A) DMA receive length register channel 3                      */
  __IOM uint16_t  DMA3_CTRL_REG;                /*!< (@ 0x0000003C) Control register for the DMA channel 3                     */
  __IOM uint16_t  DMA3_IDX_REG;                 /*!< (@ 0x0000003E) Index value of DMA channel 3                               */
  __IOM uint16_t  DMA4_A_STARTL_REG;            /*!< (@ 0x00000040) Start address Low A of DMA channel 4                       */
  __IOM uint16_t  DMA4_A_STARTH_REG;            /*!< (@ 0x00000042) Start address High A of DMA channel 4                      */
  __IOM uint16_t  DMA4_B_STARTL_REG;            /*!< (@ 0x00000044) Start address Low B of DMA channel 4                       */
  __IOM uint16_t  DMA4_B_STARTH_REG;            /*!< (@ 0x00000046) Start address High B of DMA channel 4                      */
  __IOM uint16_t  DMA4_INT_REG;                 /*!< (@ 0x00000048) DMA receive interrupt register channel 4                   */
  __IOM uint16_t  DMA4_LEN_REG;                 /*!< (@ 0x0000004A) DMA receive length register channel 4                      */
  __IOM uint16_t  DMA4_CTRL_REG;                /*!< (@ 0x0000004C) Control register for the DMA channel 4                     */
  __IOM uint16_t  DMA4_IDX_REG;                 /*!< (@ 0x0000004E) Index value of DMA channel 4                               */
  __IOM uint16_t  DMA5_A_STARTL_REG;            /*!< (@ 0x00000050) Start address Low A of DMA channel 5                       */
  __IOM uint16_t  DMA5_A_STARTH_REG;            /*!< (@ 0x00000052) Start address High A of DMA channel 5                      */
  __IOM uint16_t  DMA5_B_STARTL_REG;            /*!< (@ 0x00000054) Start address Low B of DMA channel 5                       */
  __IOM uint16_t  DMA5_B_STARTH_REG;            /*!< (@ 0x00000056) Start address High B of DMA channel 5                      */
  __IOM uint16_t  DMA5_INT_REG;                 /*!< (@ 0x00000058) DMA receive interrupt register channel 5                   */
  __IOM uint16_t  DMA5_LEN_REG;                 /*!< (@ 0x0000005A) DMA receive length register channel 5                      */
  __IOM uint16_t  DMA5_CTRL_REG;                /*!< (@ 0x0000005C) Control register for the DMA channel 5                     */
  __IOM uint16_t  DMA5_IDX_REG;                 /*!< (@ 0x0000005E) Index value of DMA channel 5                               */
  __IOM uint16_t  DMA6_A_STARTL_REG;            /*!< (@ 0x00000060) Start address Low A of DMA channel 6                       */
  __IOM uint16_t  DMA6_A_STARTH_REG;            /*!< (@ 0x00000062) Start address High A of DMA channel 6                      */
  __IOM uint16_t  DMA6_B_STARTL_REG;            /*!< (@ 0x00000064) Start address Low B of DMA channel 6                       */
  __IOM uint16_t  DMA6_B_STARTH_REG;            /*!< (@ 0x00000066) Start address High B of DMA channel 6                      */
  __IOM uint16_t  DMA6_INT_REG;                 /*!< (@ 0x00000068) DMA receive interrupt register channel 6                   */
  __IOM uint16_t  DMA6_LEN_REG;                 /*!< (@ 0x0000006A) DMA receive length register channel 6                      */
  __IOM uint16_t  DMA6_CTRL_REG;                /*!< (@ 0x0000006C) Control register for the DMA channel 6                     */
  __IOM uint16_t  DMA6_IDX_REG;                 /*!< (@ 0x0000006E) Index value of DMA channel 6                               */
  __IOM uint16_t  DMA7_A_STARTL_REG;            /*!< (@ 0x00000070) Start address Low A of DMA channel 7                       */
  __IOM uint16_t  DMA7_A_STARTH_REG;            /*!< (@ 0x00000072) Start address High A of DMA channel 7                      */
  __IOM uint16_t  DMA7_B_STARTL_REG;            /*!< (@ 0x00000074) Start address Low B of DMA channel 7                       */
  __IOM uint16_t  DMA7_B_STARTH_REG;            /*!< (@ 0x00000076) Start address High B of DMA channel 7                      */
  __IOM uint16_t  DMA7_INT_REG;                 /*!< (@ 0x00000078) DMA receive interrupt register channel 7                   */
  __IOM uint16_t  DMA7_LEN_REG;                 /*!< (@ 0x0000007A) DMA receive length register channel 7                      */
  __IOM uint16_t  DMA7_CTRL_REG;                /*!< (@ 0x0000007C) Control register for the DMA channel 7                     */
  __IOM uint16_t  DMA7_IDX_REG;                 /*!< (@ 0x0000007E) Index value of DMA channel 7                               */
  __IOM uint16_t  DMA_REQ_MUX_REG;              /*!< (@ 0x00000080) DMA channel assignments                                    */
  __IOM uint16_t  DMA_INT_STATUS_REG;           /*!< (@ 0x00000082) DMA interrupt status register                              */
  __IOM uint16_t  DMA_CLEAR_INT_REG;            /*!< (@ 0x00000084) DMA clear interrupt register                               */
} DMA_Type;                                     /*!< Size = 134 (0x86)                                                         */



/* =========================================================================================================================== */
/* ================                                            ECC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ECC registers (ECC)
  */

typedef struct {                                /*!< (@ 0x50006000) ECC Structure                                              */
  __IOM uint32_t  ECC_CONFIG_REG;               /*!< (@ 0x00000000) Configuration register                                     */
  __IOM uint32_t  ECC_COMMAND_REG;              /*!< (@ 0x00000004) Command register                                           */
  __IOM uint32_t  ECC_CONTROL_REG;              /*!< (@ 0x00000008) Control register                                           */
  __IOM uint32_t  ECC_STATUS_REG;               /*!< (@ 0x0000000C) Status register                                            */
  __IOM uint32_t  ECC_VERSION_REG;              /*!< (@ 0x00000010) Version register                                           */
} ECC_Type;                                     /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           FTDF                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief FTDF registers (FTDF)
  */

