S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x40080000) FTDF Structure                                             */
  __IOM uint32_t  FTDF_TX_FIFO_0_0_REG;         /*!< (@ 0x00000000) Address transmit fifo 0                                    */
  __IM  uint32_t  RESERVED[31];
  __IOM uint32_t  FTDF_TX_FIFO_1_0_REG;         /*!< (@ 0x00000080) Address transmit fifo 1                                    */
  __IM  uint32_t  RESERVED1[31];
  __IOM uint32_t  FTDF_TX_FIFO_2_0_REG;         /*!< (@ 0x00000100) Address transmit fifo 2                                    */
  __IM  uint32_t  RESERVED2[31];
  __IOM uint32_t  FTDF_TX_FIFO_3_0_REG;         /*!< (@ 0x00000180) Address transmit fifo 3                                    */
  __IM  uint32_t  RESERVED3[31];
  __IOM uint32_t  FTDF_TX_META_DATA_0_0_REG;    /*!< (@ 0x00000200) Transmit metadata register 0                               */
  __IOM uint32_t  FTDF_TX_META_DATA_1_0_REG;    /*!< (@ 0x00000204) Transmit metadata register 0                               */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  FTDF_TX_META_DATA_0_1_REG;    /*!< (@ 0x00000210) Transmit metadata register 1                               */
  __IOM uint32_t  FTDF_TX_META_DATA_1_1_REG;    /*!< (@ 0x00000214) Transmit metadata register 1                               */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  FTDF_TX_META_DATA_0_2_REG;    /*!< (@ 0x00000220) Transmit metadata register 2                               */
  __IOM uint32_t  FTDF_TX_META_DATA_1_2_REG;    /*!< (@ 0x00000224) Transmit metadata register 2                               */
  __IM  uint32_t  RESERVED6[2];
  __IOM uint32_t  FTDF_TX_META_DATA_0_3_REG;    /*!< (@ 0x00000230) Transmit metadata register 3                               */
  __IOM uint32_t  FTDF_TX_META_DATA_1_3_REG;    /*!< (@ 0x00000234) Transmit metadata register 3                               */
  __IM  uint32_t  RESERVED7[2];
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_0_0_REG;/*!< (@ 0x00000240) Transmit status register 0                                 */
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_1_0_REG;/*!< (@ 0x00000244) Transmit status register 0                                 */
  __IM  uint32_t  RESERVED8[2];
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_0_1_REG;/*!< (@ 0x00000250) Transmit status register 1                                 */
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_1_1_REG;/*!< (@ 0x00000254) Transmit status register 1                                 */
  __IM  uint32_t  RESERVED9[2];
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_0_2_REG;/*!< (@ 0x00000260) Transmit status register 2                                 */
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_1_2_REG;/*!< (@ 0x00000264) Transmit status register 2                                 */
  __IM  uint32_t  RESERVED10[2];
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_0_3_REG;/*!< (@ 0x00000270) Transmit status register 3                                 */
  __IOM uint32_t  FTDF_TX_RETURN_STATUS_1_3_REG;/*!< (@ 0x00000274) Transmit status register 3                                 */
  __IM  uint32_t  RESERVED11[2];
  __IOM uint32_t  FTDF_RX_META_0_0_REG;         /*!< (@ 0x00000280) Receive metadata register 0                                */
  __IOM uint32_t  FTDF_RX_META_1_0_REG;         /*!< (@ 0x00000284) Receive metadata register 0                                */
  __IM  uint32_t  RESERVED12[2];
  __IOM uint32_t  FTDF_RX_META_0_1_REG;         /*!< (@ 0x00000290) Receive metadata register 1                                */
  __IOM uint32_t  FTDF_RX_META_1_1_REG;         /*!< (@ 0x00000294) Receive metadata register 1                                */
  __IM  uint32_t  RESERVED13[2];
  __IOM uint32_t  FTDF_RX_META_0_2_REG;         /*!< (@ 0x000002A0) Receive metadata register 2                                */
  __IOM uint32_t  FTDF_RX_META_1_2_REG;         /*!< (@ 0x000002A4) Receive metadata register 2                                */
  __IM  uint32_t  RESERVED14[2];
  __IOM uint32_t  FTDF_RX_META_0_3_REG;         /*!< (@ 0x000002B0) Receive metadata register 3                                */
  __IOM uint32_t  FTDF_RX_META_1_3_REG;         /*!< (@ 0x000002B4) Receive metadata register 3                                */
  __IM  uint32_t  RESERVED15[2];
  __IOM uint32_t  FTDF_RX_META_0_4_REG;         /*!< (@ 0x000002C0) Receive metadata register 4                                */
  __IOM uint32_t  FTDF_RX_META_1_4_REG;         /*!< (@ 0x000002C4) Receive metadata register 4                                */
  __IM  uint32_t  RESERVED16[2];
  __IOM uint32_t  FTDF_RX_META_0_5_REG;         /*!< (@ 0x000002D0) Receive metadata register 5                                */
  __IOM uint32_t  FTDF_RX_META_1_5_REG;         /*!< (@ 0x000002D4) Receive metadata register 5                                */
  __IM  uint32_t  RESERVED17[2];
  __IOM uint32_t  FTDF_RX_META_0_6_REG;         /*!< (@ 0x000002E0) Receive metadata register 6                                */
  __IOM uint32_t  FTDF_RX_META_1_6_REG;         /*!< (@ 0x000002E4) Receive metadata register 6                                */
  __IM  uint32_t  RESERVED18[2];
  __IOM uint32_t  FTDF_RX_META_0_7_REG;         /*!< (@ 0x000002F0) Receive metadata register 7                                */
  __IOM uint32_t  FTDF_RX_META_1_7_REG;         /*!< (@ 0x000002F4) Receive metadata register 7                                */
  __IM  uint32_t  RESERVED19[8002];
  __IOM uint32_t  FTDF_RX_FIFO_0_0_REG;         /*!< (@ 0x00008000) Address receive fifo 0                                     */
  __IM  uint32_t  RESERVED20[31];
  __IOM uint32_t  FTDF_RX_FIFO_1_0_REG;         /*!< (@ 0x00008080) Address transmit fifo 1                                    */
  __IM  uint32_t  RESERVED21[31];
  __IOM uint32_t  FTDF_RX_FIFO_2_0_REG;         /*!< (@ 0x00008100) Address transmit fifo 2                                    */
  __IM  uint32_t  RESERVED22[31];
  __IOM uint32_t  FTDF_RX_FIFO_3_0_REG;         /*!< (@ 0x00008180) Address transmit fifo 3                                    */
  __IM  uint32_t  RESERVED23[31];
  __IOM uint32_t  FTDF_RX_FIFO_4_0_REG;         /*!< (@ 0x00008200) Address transmit fifo 4                                    */
  __IM  uint32_t  RESERVED24[31];
  __IOM uint32_t  FTDF_RX_FIFO_5_0_REG;         /*!< (@ 0x00008280) Address transmit fifo 5                                    */
  __IM  uint32_t  RESERVED25[31];
  __IOM uint32_t  FTDF_RX_FIFO_6_0_REG;         /*!< (@ 0x00008300) Address transmit fifo 6                                    */
  __IM  uint32_t  RESERVED26[31];
  __IOM uint32_t  FTDF_RX_FIFO_7_0_REG;         /*!< (@ 0x00008380) Address transmit fifo 7                                    */
  __IM  uint32_t  RESERVED27[7967];
  __IOM uint32_t  FTDF_REL_NAME_0_REG;          /*!< (@ 0x00010000) Name of the release                                        */
  __IOM uint32_t  FTDF_REL_NAME_1_REG;          /*!< (@ 0x00010004) Name of the release                                        */
  __IOM uint32_t  FTDF_REL_NAME_2_REG;          /*!< (@ 0x00010008) Name of the release                                        */
  __IOM uint32_t  FTDF_REL_NAME_3_REG;          /*!< (@ 0x0001000C) Name of the release                                        */
  __IOM uint32_t  FTDF_BUILDTIME_0_REG;         /*!< (@ 0x00010010) Build time                                                 */
  __IOM uint32_t  FTDF_BUILDTIME_1_REG;         /*!< (@ 0x00010014) Build time                                                 */
  __IOM uint32_t  FTDF_BUILDTIME_2_REG;         /*!< (@ 0x00010018) Build time                                                 */
  __IOM uint32_t  FTDF_BUILDTIME_3_REG;         /*!< (@ 0x0001001C) Build time                                                 */
  __IOM uint32_t  FTDF_GLOB_CONTROL_0_REG;      /*!< (@ 0x00010020) Global control register                                    */
  __IOM uint32_t  FTDF_GLOB_CONTROL_1_REG;      /*!< (@ 0x00010024) Global control register                                    */
  __IOM uint32_t  FTDF_GLOB_CONTROL_2_REG;      /*!< (@ 0x00010028) Global control register                                    */
  __IOM uint32_t  FTDF_GLOB_CONTROL_3_REG;      /*!< (@ 0x0001002C) Global control register                                    */
  __IOM uint32_t  FTDF_LMAC_CONTROL_0_REG;      /*!< (@ 0x00010030) Lmac control register                                      */
  __IOM uint32_t  FTDF_TXPIPEPROPDELAY_REG;     /*!< (@ 0x00010034) Prop delay transmit register                               */
  __IOM uint32_t  FTDF_MACACKWAITDURATION_REG;  /*!< (@ 0x00010038) Maximum time to wait for a ACK                             */
  __IOM uint32_t  FTDF_MACENHACKWAITDURATION_REG;/*!< (@ 0x0001003C) Maximum time to wait for an enhanced ACK frame            */
  __IOM uint32_t  FTDF_LMAC_CONTROL_1_REG;      /*!< (@ 0x00010040) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_2_REG;      /*!< (@ 0x00010044) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_3_REG;      /*!< (@ 0x00010048) Lmac control register                                      */
  __IM  uint32_t  RESERVED28;
  __IOM uint32_t  FTDF_LMAC_CONTROL_OS_REG;     /*!< (@ 0x00010050) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_STATUS_REG; /*!< (@ 0x00010054) Lmac status register                                       */
  __IOM uint32_t  FTDF_EVENTCURRVAL_REG;        /*!< (@ 0x00010058) Value of event generator                                   */
  __IOM uint32_t  FTDF_TIMESTAMPCURRVAL_REG;    /*!< (@ 0x0001005C) Value of timestamp generator                               */
  __IOM uint32_t  FTDF_LMAC_CONTROL_4_REG;      /*!< (@ 0x00010060) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_5_REG;      /*!< (@ 0x00010064) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_6_REG;      /*!< (@ 0x00010068) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_11_REG;     /*!< (@ 0x0001006C) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_DELTA_REG;  /*!< (@ 0x00010070) Lmac delta control register                                */
  __IOM uint32_t  FTDF_TIMESTAMPCURRPHASEVAL_REG;/*!< (@ 0x00010074) Value of timestamp generator phase within a symbol        */
  __IOM uint32_t  FTDF_MACTSTXACKDELAYVAL_REG;  /*!< (@ 0x00010078) Time left until next ACK is sent (us)                      */
  __IM  uint32_t  RESERVED29;
  __IOM uint32_t  FTDF_LMAC_CONTROL_MASK_REG;   /*!< (@ 0x00010080) Lmac mask control register                                 */
  __IM  uint32_t  RESERVED30[3];
  __IOM uint32_t  FTDF_LMAC_EVENT_REG;          /*!< (@ 0x00010090) Lmac event regsiter                                        */
  __IOM uint32_t  FTDF_LMAC_MASK_REG;           /*!< (@ 0x00010094) Lmac mask register                                         */
  __IM  uint32_t  RESERVED31[2];
  __IOM uint32_t  FTDF_LMAC_MANUAL_1_REG;       /*!< (@ 0x000100A0) Lmax manual PHY register                                   */
  __IOM uint32_t  FTDF_LMAC_MANUAL_OS_REG;      /*!< (@ 0x000100A4) One shot register triggers transmission in manual
                                                                    mode                                                       */
  __IOM uint32_t  FTDF_LMAC_MANUAL_STATUS_REG;  /*!< (@ 0x000100A8) Lmac status register in manual mode                        */
  __IM  uint32_t  RESERVED32[21];
  __IOM uint32_t  FTDF_LMAC_CONTROL_7_REG;      /*!< (@ 0x00010100) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_8_REG;      /*!< (@ 0x00010104) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_9_REG;      /*!< (@ 0x00010108) Lmac control register                                      */
  __IOM uint32_t  FTDF_LMAC_CONTROL_10_REG;     /*!< (@ 0x0001010C) Lmac control register                                      */
  __IOM uint32_t  FTDF_SECURITY_0_REG;          /*!< (@ 0x00010110) Security register                                          */
  __IOM uint32_t  FTDF_SECURITY_1_REG;          /*!< (@ 0x00010114) Security register                                          */
  __IOM uint32_t  FTDF_SECKEY_0_REG;            /*!< (@ 0x00010118) Seckey register                                            */
  __IOM uint32_t  FTDF_SECKEY_1_REG;            /*!< (@ 0x0001011C) Seckey register                                            */
  __IOM uint32_t  FTDF_SECKEY_2_REG;            /*!< (@ 0x00010120) SecKey register                                            */
  __IOM uint32_t  FTDF_SECKEY_3_REG;            /*!< (@ 0x00010124) Seckey register                                            */
  __IOM uint32_t  FTDF_SECNONCE_0_REG;          /*!< (@ 0x00010128) Nonce register used for encryption/decryption              */
  __IOM uint32_t  FTDF_SECNONCE_1_REG;          /*!< (@ 0x0001012C) Nonce register used for encryption/decryption              */
  __IOM uint32_t  FTDF_SECNONCE_2_REG;          /*!< (@ 0x00010130) Nonce register used for encryption/decryption              */
  __IOM uint32_t  FTDF_SECNONCE_3_REG;          /*!< (@ 0x00010134) Nonce register used for encryption/decryption              */
  __IOM uint32_t  FTDF_SECURITY_OS_REG;         /*!< (@ 0x00010138) One shot register to start encryption/decryption           */
  __IM  uint32_t  RESERVED33;
  __IOM uint32_t  FTDF_SECURITY_STATUS_REG;     /*!< (@ 0x00010140) Security status register                                   */
  __IM  uint32_t  RESERVED34[3];
  __IOM uint32_t  FTDF_SECURITY_EVENT_REG;      /*!< (@ 0x00010150) security event register                                    */
  __IOM uint32_t  FTDF_SECURITY_EVENTMASK_REG;  /*!< (@ 0x00010154) security event mask register                               */
  __IM  uint32_t  RESERVED35[2];
  __IOM uint32_t  FTDF_TSCH_CONTROL_0_REG;      /*!< (@ 0x00010160) Lmac tsch control register                                 */
  __IOM uint32_t  FTDF_TSCH_CONTROL_1_REG;      /*!< (@ 0x00010164) Lmac tsch control register                                 */
  __IOM uint32_t  FTDF_TSCH_CONTROL_2_REG;      /*!< (@ 0x00010168) Lmac tsch control register                                 */
  __IM  uint32_t  RESERVED36[5];
  __IOM uint32_t  FTDF_PHY_PARAMETERS_0_REG;    /*!< (@ 0x00010180) Lmac PHY parameter register                                */
  __IOM uint32_t  FTDF_PHY_PARAMETERS_1_REG;    /*!< (@ 0x00010184) Lmac PHY parameter register                                */
  __IOM uint32_t  FTDF_PHY_PARAMETERS_2_REG;    /*!< (@ 0x00010188) Lmac PHY parameter register                                */
  __IOM uint32_t  FTDF_PHY_PARAMETERS_3_REG;    /*!< (@ 0x0001018C) Lmac PHY parameter register                                */
  __IM  uint32_t  RESERVED37[28];
  __IOM uint32_t  FTDF_RX_CONTROL_0_REG;        /*!< (@ 0x00010200) Receive control register                                   */
  __IOM uint32_t  FTDF_RX_EVENT_REG;            /*!< (@ 0x00010204) Receive event register                                     */
  __IOM uint32_t  FTDF_RX_MASK_REG;             /*!< (@ 0x00010208) Receive event mask register                                */
  __IOM uint32_t  FTDF_RX_STATUS_REG;           /*!< (@ 0x0001020C) Receive status register                                    */
  __IOM uint32_t  FTDF_SYMBOLTIMESNAPSHOTVAL_REG;/*!< (@ 0x00010210) Value timestamp generator                                 */
  __IM  uint32_t  RESERVED38[3];
  __IOM uint32_t  FTDF_RX_STATUS_DELTA_REG;     /*!< (@ 0x00010220) Receive status delta register                              */
  __IOM uint32_t  FTDF_RX_STATUS_MASK_REG;      /*!< (@ 0x00010224) Receive status delta mask register                         */
  __IM  uint32_t  RESERVED39[6];
  __IOM uint32_t  FTDF_TX_CONTROL_0_REG;        /*!< (@ 0x00010240) Transmit control register                                  */
  __IM  uint32_t  RESERVED40[3];
  __IOM uint32_t  FTDF_FTDF_CE_REG;             /*!< (@ 0x00010250) Selection register events                                  */
  __IOM uint32_t  FTDF_FTDF_CM_REG;             /*!< (@ 0x00010254) Mask selection register events                             */
  __IM  uint32_t  RESERVED41[43];
  __IOM uint32_t  FTDF_SYNCTIMESTAMPTHR_REG;    /*!< (@ 0x00010304) Threshold timestamp generator                              */
  __IOM uint32_t  FTDF_SYNCTIMESTAMPVAL_REG;    /*!< (@ 0x00010308) Value timestamp generator                                  */
  __IOM uint32_t  FTDF_TIMER_CONTROL_1_REG;     /*!< (@ 0x0001030C) Timer control register                                     */
  __IOM uint32_t  FTDF_MACTXSTDACKFRMCNT_REG;   /*!< (@ 0x00010310) Transmitted acknowledgment frames                          */
  __IOM uint32_t  FTDF_MACRXSTDACKFRMOKCNT_REG; /*!< (@ 0x00010314) Received acknowledgment frames                             */
  __IOM uint32_t  FTDF_MACRXADDRFAILFRMCNT_REG; /*!< (@ 0x00010318) Discarded frames register                                  */
  __IOM uint32_t  FTDF_MACRXUNSUPFRMCNT_REG;    /*!< (@ 0x0001031C) Unsupported frames register                                */
  __IOM uint32_t  FTDF_SYNCTIMESTAMPPHASEVAL_REG;/*!< (@ 0x00010320) Timestamp phase value regsiter                            */
  __IM  uint32_t  RESERVED42[7];
  __IOM uint32_t  FTDF_MACFCSERRORCOUNT_REG;    /*!< (@ 0x00010340) Lmac FCS error register                                    */
  __IM  uint32_t  RESERVED43[7];
  __IOM uint32_t  FTDF_LMACRESET_REG;           /*!< (@ 0x00010360) Lmax reset register                                        */
  __IM  uint32_t  RESERVED44[7];
  __IOM uint32_t  FTDF_SYMBOLTIMETHR_REG;       /*!< (@ 0x00010380) Symboltime threshold register 1                            */
  __IOM uint32_t  FTDF_SYMBOLTIME2THR_REG;      /*!< (@ 0x00010384) Symboltime threshold register 2                            */
  __IM  uint32_t  RESERVED45[2];
  __IOM uint32_t  FTDF_DEBUGCONTROL_REG;        /*!< (@ 0x00010390) Debug control register                                     */
  __IOM uint32_t  FTDF_TXBYTE_E_REG;            /*!< (@ 0x00010394) Transmit first byte register                               */
  __IOM uint32_t  FTDF_TXBYTE_M_REG;            /*!< (@ 0x00010398) Transmit first byte mask register                          */
  __IM  uint32_t  RESERVED46[25];
  __IOM uint32_t  FTDF_TX_FLAG_S_0_REG;         /*!< (@ 0x00010400) Transmit packet ready for transmission register
                                                                    0                                                          */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_E_0_REG;   /*!< (@ 0x00010404) Clear flag register 0                                      */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_M_0_REG;   /*!< (@ 0x00010408) Mask flag register 0                                       */
  __IM  uint32_t  RESERVED47;
  __IOM uint32_t  FTDF_TX_PRIORITY_0_REG;       /*!< (@ 0x00010410) Transmit priority register 0                               */
  __IM  uint32_t  RESERVED48[3];
  __IOM uint32_t  FTDF_TX_FLAG_S_1_REG;         /*!< (@ 0x00010420) Transmit packet ready for transmission register
                                                                    1                                                          */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_E_1_REG;   /*!< (@ 0x00010424) Clear flag register 1                                      */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_M_1_REG;   /*!< (@ 0x00010428) Mask flag register 1                                       */
  __IM  uint32_t  RESERVED49;
  __IOM uint32_t  FTDF_TX_PRIORITY_1_REG;       /*!< (@ 0x00010430) Transmit priority register 1                               */
  __IM  uint32_t  RESERVED50[3];
  __IOM uint32_t  FTDF_TX_FLAG_S_2_REG;         /*!< (@ 0x00010440) Transmit packet ready for transmission register
                                                                    2                                                          */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_E_2_REG;   /*!< (@ 0x00010444) Clear flag register 2                                      */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_M_2_REG;   /*!< (@ 0x00010448) Clear flag register 2                                      */
  __IM  uint32_t  RESERVED51;
  __IOM uint32_t  FTDF_TX_PRIORITY_2_REG;       /*!< (@ 0x00010450) Transmit priority register 2                               */
  __IM  uint32_t  RESERVED52[3];
  __IOM uint32_t  FTDF_TX_FLAG_S_3_REG;         /*!< (@ 0x00010460) Transmit packet ready for transmission register
                                                                    3                                                          */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_E_3_REG;   /*!< (@ 0x00010464) Clear flag register 3                                      */
  __IOM uint32_t  FTDF_TX_FLAG_CLEAR_M_3_REG;   /*!< (@ 0x00010468) Clear flag register 3                                      */
  __IM  uint32_t  RESERVED53;
  __IOM uint32_t  FTDF_TX_PRIORITY_3_REG;       /*!< (@ 0x00010470) Transmit priority register 3                               */
  __IM  uint32_t  RESERVED54[3];
  __IOM uint32_t  FTDF_TX_SET_OS_REG;           /*!< (@ 0x00010480) One shot register to set flag                              */
  __IOM uint32_t  FTDF_TX_CLEAR_OS_REG;         /*!< (@ 0x00010484) One shot register to clear flag                            */
  __IM  uint32_t  RESERVED55[734];
  __IOM uint32_t  FTDF_WAKEUPINTTHR_REG;        /*!< (@ 0x00011000) Treshold value Wakeup timer                                */
  __IOM uint32_t  FTDF_WAKEUP_CONTROL_REG;      /*!< (@ 0x00011004) Wakeup timer vcontrol register                             */
} FTDF_Type;                                    /*!< Size = 69640 (0x11008)                                                    */



/* =========================================================================================================================== */
/* ================                                         GP_TIMERS                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief GP_TIMERS registers (GP_TIMERS)
  */

