S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50003400) GP_TIMERS Structure                                        */
  __IOM uint16_t  TIMER0_CTRL_REG;              /*!< (@ 0x00000000) Timer0 control register                                    */
  __IOM uint16_t  TIMER0_ON_REG;                /*!< (@ 0x00000002) Timer0 on control register                                 */
  __IOM uint16_t  TIMER0_RELOAD_M_REG;          /*!< (@ 0x00000004) 16 bits reload value for Timer0                            */
  __IOM uint16_t  TIMER0_RELOAD_N_REG;          /*!< (@ 0x00000006) 16 bits reload value for Timer0                            */
  __IOM uint16_t  PWM2_START_CYCLE;             /*!< (@ 0x00000008) Defines start Cycle for PWM2                               */
  __IOM uint16_t  PWM3_START_CYCLE;             /*!< (@ 0x0000000A) Defines start Cycle for PWM3                               */
  __IOM uint16_t  PWM4_START_CYCLE;             /*!< (@ 0x0000000C) Defines start Cycle for PWM4                               */
  __IOM uint16_t  PWM2_END_CYCLE;               /*!< (@ 0x0000000E) Defines end Cycle for PWM2                                 */
  __IOM uint16_t  PWM3_END_CYCLE;               /*!< (@ 0x00000010) Defines end Cycle for PWM3                                 */
  __IOM uint16_t  PWM4_END_CYCLE;               /*!< (@ 0x00000012) Defines end Cycle for PWM4                                 */
  __IOM uint16_t  TRIPLE_PWM_FREQUENCY;         /*!< (@ 0x00000014) Defines the PMW2,3,4 frequency                             */
  __IOM uint16_t  TRIPLE_PWM_CTRL_REG;          /*!< (@ 0x00000016) PWM 2 3 4 Control register                                 */
  __IOM uint16_t  BREATH_CFG_REG;               /*!< (@ 0x00000018) Breath configuration register                              */
  __IOM uint16_t  BREATH_DUTY_MAX_REG;          /*!< (@ 0x0000001A) Breath max duty cycle register                             */
  __IOM uint16_t  BREATH_DUTY_MIN_REG;          /*!< (@ 0x0000001C) Breath min duty cycle register                             */
  __IOM uint16_t  BREATH_CTRL_REG;              /*!< (@ 0x0000001E) Breath control register                                    */
} GP_TIMERS_Type;                               /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPADC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief GPADC registers (GPADC)
  */

typedef struct {                                /*!< (@ 0x50001900) GPADC Structure                                            */
  __IOM uint16_t  GP_ADC_CTRL_REG;              /*!< (@ 0x00000000) General Purpose ADC Control Register                       */
  __IOM uint16_t  GP_ADC_CTRL2_REG;             /*!< (@ 0x00000002) General Purpose ADC Second Control Register                */
  __IOM uint16_t  GP_ADC_CTRL3_REG;             /*!< (@ 0x00000004) General Purpose ADC Third Control Register                 */
  __IOM uint16_t  GP_ADC_OFFP_REG;              /*!< (@ 0x00000006) General Purpose ADC Positive Offset Register               */
  __IOM uint16_t  GP_ADC_OFFN_REG;              /*!< (@ 0x00000008) General Purpose ADC Negative Offset Register               */
  __IOM uint16_t  GP_ADC_CLEAR_INT_REG;         /*!< (@ 0x0000000A) General Purpose ADC Clear Interrupt Register               */
  __IOM uint16_t  GP_ADC_RESULT_REG;            /*!< (@ 0x0000000C) General Purpose ADC Result Register                        */
} GPADC_Type;                                   /*!< Size = 14 (0xe)                                                           */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO registers (GPIO)
  */

typedef struct {                                /*!< (@ 0x50003000) GPIO Structure                                             */
  __IOM uint16_t  P0_DATA_REG;                  /*!< (@ 0x00000000) P0 Data input / output Register                            */
  __IOM uint16_t  P1_DATA_REG;                  /*!< (@ 0x00000002) P1 Data input / output Register                            */
  __IOM uint16_t  P2_DATA_REG;                  /*!< (@ 0x00000004) P2 Data input / output Register                            */
  __IOM uint16_t  P3_DATA_REG;                  /*!< (@ 0x00000006) P3 Data input / output Register                            */
  __IOM uint16_t  P4_DATA_REG;                  /*!< (@ 0x00000008) P4 Data input / output Register                            */
  __IOM uint16_t  P0_SET_DATA_REG;              /*!< (@ 0x0000000A) P0 Set port pins Register                                  */
  __IOM uint16_t  P1_SET_DATA_REG;              /*!< (@ 0x0000000C) P1 Set port pins Register                                  */
  __IOM uint16_t  P2_SET_DATA_REG;              /*!< (@ 0x0000000E) P2 Set port pins Register                                  */
  __IOM uint16_t  P3_SET_DATA_REG;              /*!< (@ 0x00000010) P3 Set port pins Register                                  */
  __IOM uint16_t  P4_SET_DATA_REG;              /*!< (@ 0x00000012) P4 Set port pins Register                                  */
  __IOM uint16_t  P0_RESET_DATA_REG;            /*!< (@ 0x00000014) P0 Reset port pins Register                                */
  __IOM uint16_t  P1_RESET_DATA_REG;            /*!< (@ 0x00000016) P1 Reset port pins Register                                */
  __IOM uint16_t  P2_RESET_DATA_REG;            /*!< (@ 0x00000018) P2 Reset port pins Register                                */
  __IOM uint16_t  P3_RESET_DATA_REG;            /*!< (@ 0x0000001A) P3 Reset port pins Register                                */
  __IOM uint16_t  P4_RESET_DATA_REG;            /*!< (@ 0x0000001C) P4 Reset port pins Register                                */
  __IOM uint16_t  P00_MODE_REG;                 /*!< (@ 0x0000001E) P00 Mode Register                                          */
  __IOM uint16_t  P01_MODE_REG;                 /*!< (@ 0x00000020) P01 Mode Register                                          */
  __IOM uint16_t  P02_MODE_REG;                 /*!< (@ 0x00000022) P02 Mode Register                                          */
  __IOM uint16_t  P03_MODE_REG;                 /*!< (@ 0x00000024) P03 Mode Register                                          */
  __IOM uint16_t  P04_MODE_REG;                 /*!< (@ 0x00000026) P04 Mode Register                                          */
  __IOM uint16_t  P05_MODE_REG;                 /*!< (@ 0x00000028) P05 Mode Register                                          */
  __IOM uint16_t  P06_MODE_REG;                 /*!< (@ 0x0000002A) P06 Mode Register                                          */
  __IOM uint16_t  P07_MODE_REG;                 /*!< (@ 0x0000002C) P07 Mode Register                                          */
  __IOM uint16_t  P10_MODE_REG;                 /*!< (@ 0x0000002E) P10 Mode Register                                          */
  __IOM uint16_t  P11_MODE_REG;                 /*!< (@ 0x00000030) P11 Mode Register                                          */
  __IOM uint16_t  P12_MODE_REG;                 /*!< (@ 0x00000032) P12 Mode Register                                          */
  __IOM uint16_t  P13_MODE_REG;                 /*!< (@ 0x00000034) P13 Mode Register                                          */
  __IOM uint16_t  P14_MODE_REG;                 /*!< (@ 0x00000036) P14 Mode Register                                          */
  __IOM uint16_t  P15_MODE_REG;                 /*!< (@ 0x00000038) P15 Mode Register                                          */
  __IOM uint16_t  P16_MODE_REG;                 /*!< (@ 0x0000003A) P24 Mode Register                                          */
  __IOM uint16_t  P17_MODE_REG;                 /*!< (@ 0x0000003C) P25 Mode Register                                          */
  __IOM uint16_t  P20_MODE_REG;                 /*!< (@ 0x0000003E) P20 Mode Register                                          */
  __IOM uint16_t  P21_MODE_REG;                 /*!< (@ 0x00000040) P21 Mode Register                                          */
  __IOM uint16_t  P22_MODE_REG;                 /*!< (@ 0x00000042) P22 Mode Register                                          */
  __IOM uint16_t  P23_MODE_REG;                 /*!< (@ 0x00000044) P23 Mode Register                                          */
  __IOM uint16_t  P24_MODE_REG;                 /*!< (@ 0x00000046) P24 Mode Register                                          */
  __IM  uint16_t  RESERVED[3];
  __IOM uint16_t  P30_MODE_REG;                 /*!< (@ 0x0000004E) P30 Mode Register                                          */
  __IOM uint16_t  P31_MODE_REG;                 /*!< (@ 0x00000050) P31 Mode Register                                          */
  __IOM uint16_t  P32_MODE_REG;                 /*!< (@ 0x00000052) P32 Mode Register                                          */
  __IOM uint16_t  P33_MODE_REG;                 /*!< (@ 0x00000054) P33 Mode Register                                          */
  __IOM uint16_t  P34_MODE_REG;                 /*!< (@ 0x00000056) P34 Mode Register                                          */
  __IOM uint16_t  P35_MODE_REG;                 /*!< (@ 0x00000058) P35 Mode Register                                          */
  __IOM uint16_t  P36_MODE_REG;                 /*!< (@ 0x0000005A) P36 Mode Register                                          */
  __IOM uint16_t  P37_MODE_REG;                 /*!< (@ 0x0000005C) P37 Mode Register                                          */
  __IOM uint16_t  P40_MODE_REG;                 /*!< (@ 0x0000005E) P40 Mode Register                                          */
  __IOM uint16_t  P41_MODE_REG;                 /*!< (@ 0x00000060) P41 Mode Register                                          */
  __IOM uint16_t  P42_MODE_REG;                 /*!< (@ 0x00000062) P42 Mode Register                                          */
  __IOM uint16_t  P43_MODE_REG;                 /*!< (@ 0x00000064) P43 Mode Register                                          */
  __IOM uint16_t  P44_MODE_REG;                 /*!< (@ 0x00000066) P44 Mode Register                                          */
  __IOM uint16_t  P45_MODE_REG;                 /*!< (@ 0x00000068) P45 Mode Register                                          */
  __IOM uint16_t  P46_MODE_REG;                 /*!< (@ 0x0000006A) P46 Mode Register                                          */
  __IOM uint16_t  P47_MODE_REG;                 /*!< (@ 0x0000006C) P47 Mode Register                                          */
  __IM  uint16_t  RESERVED1[41];
  __IOM uint16_t  P0_PADPWR_CTRL_REG;           /*!< (@ 0x000000C0) P0 Output Power Control Register                           */
  __IOM uint16_t  P1_PADPWR_CTRL_REG;           /*!< (@ 0x000000C2) P1 Output Power Control Register                           */
  __IOM uint16_t  P2_PADPWR_CTRL_REG;           /*!< (@ 0x000000C4) P2 Output Power Control Register                           */
  __IOM uint16_t  P3_PADPWR_CTRL_REG;           /*!< (@ 0x000000C6) P3 Output Power Control Register                           */
  __IOM uint16_t  P4_PADPWR_CTRL_REG;           /*!< (@ 0x000000C8) P4 Output Power Control Register                           */
  __IM  uint16_t  RESERVED2[3];
  __IOM uint16_t  GPIO_CLK_SEL;                 /*!< (@ 0x000000D0) Select which clock to map on port in PPA                   */
  __IM  uint16_t  RESERVED3[7];
  __IOM uint16_t  BIST_CTRL_REG;                /*!< (@ 0x000000E0) BIST_CTRL_REG                                              */
  __IOM uint16_t  RAMBIST_STATUS1_REG;          /*!< (@ 0x000000E2) RAMBIST_STATUS1_REG                                        */
  __IOM uint16_t  RAMBIST_STATUS2_REG;          /*!< (@ 0x000000E4) RAMBIST_STATUS2_REG                                        */
  __IOM uint16_t  ROMBIST_RESULTL_REG;          /*!< (@ 0x000000E6) ROMBIST_RESULTL_REG                                        */
  __IOM uint16_t  ROMBIST_RESULTH_REG;          /*!< (@ 0x000000E8) ROMBIST_RESULTH_REG                                        */
  __IM  uint16_t  RESERVED4[3];
  __IOM uint16_t  TEST_CTRL_REG;                /*!< (@ 0x000000F0) TEST_CTRL_REG                                              */
  __IOM uint16_t  TEST_CTRL2_REG;               /*!< (@ 0x000000F2) TEST_CTRL2_REG                                             */
  __IOM uint16_t  TEST_CTRL3_REG;               /*!< (@ 0x000000F4) TEST_CTRL3_REG                                             */
  __IOM uint16_t  TEST_CTRL4_REG;               /*!< (@ 0x000000F6) TEST_CTRL4_REG                                             */
  __IOM uint16_t  TEST_CTRL5_REG;               /*!< (@ 0x000000F8) TEST_CTRL5_REG                                             */
} GPIO_Type;                                    /*!< Size = 250 (0xfa)                                                         */



/* =========================================================================================================================== */
/* ================                                           GPREG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief GPREG registers (GPREG)
  */

typedef struct {                                /*!< (@ 0x50003300) GPREG Structure                                            */
  __IOM uint16_t  SET_FREEZE_REG;               /*!< (@ 0x00000000) Controls freezing of various timers/counters
                                                                    (incl. DMA and USB).                                       */
  __IOM uint16_t  RESET_FREEZE_REG;             /*!< (@ 0x00000002) Controls unfreezing of various timers/counters
                                                                    (incl. DMA and USB).                                       */
  __IOM uint16_t  DEBUG_REG;                    /*!< (@ 0x00000004) Various debug information register.                        */
  __IOM uint16_t  GP_STATUS_REG;                /*!< (@ 0x00000006) General purpose system status register.                    */
  __IOM uint16_t  GP_CONTROL_REG;               /*!< (@ 0x00000008) General purpose system control register.                   */
  __IOM uint16_t  ECC_BASE_ADDR_REG;            /*!< (@ 0x0000000A) Base address of the ECC Crypto memory register.            */
  __IOM uint16_t  LED_CONTROL_REG;              /*!< (@ 0x0000000C) Controls muxing and enabling of the LEDs.                  */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  PLL_SYS_CTRL1_REG;            /*!< (@ 0x00000010) System PLL control register 1.                             */
  __IOM uint16_t  PLL_SYS_CTRL2_REG;            /*!< (@ 0x00000012) System PLL control register 2.                             */
  __IOM uint16_t  PLL_SYS_CTRL3_REG;            /*!< (@ 0x00000014) System PLL control register 3.                             */
  __IOM uint16_t  PLL_SYS_STATUS_REG;           /*!< (@ 0x00000016) System PLL status register.                                */
  __IOM uint16_t  PLL_SYS_TEST_REG;             /*!< (@ 0x00000018) System PLL test register.                                  */
} GPREG_Type;                                   /*!< Size = 26 (0x1a)                                                          */



/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C registers (I2C)
  */

