S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50001400) I2C Structure                                              */
  __IOM uint16_t  I2C_CON_REG;                  /*!< (@ 0x00000000) I2C Control Register                                       */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  I2C_TAR_REG;                  /*!< (@ 0x00000004) I2C Target Address Register                                */
  __IM  uint16_t  RESERVED1;
  __IOM uint16_t  I2C_SAR_REG;                  /*!< (@ 0x00000008) I2C Slave Address Register                                 */
  __IM  uint16_t  RESERVED2;
  __IOM uint16_t  I2C_HS_MADDR_REG;             /*!< (@ 0x0000000C) I2C High Speed Master Mode Code Address Register           */
  __IM  uint16_t  RESERVED3;
  __IOM uint16_t  I2C_DATA_CMD_REG;             /*!< (@ 0x00000010) I2C Rx/Tx Data Buffer and Command Register                 */
  __IM  uint16_t  RESERVED4;
  __IOM uint16_t  I2C_SS_SCL_HCNT_REG;          /*!< (@ 0x00000014) Standard Speed I2C Clock SCL High Count Register           */
  __IM  uint16_t  RESERVED5;
  __IOM uint16_t  I2C_SS_SCL_LCNT_REG;          /*!< (@ 0x00000018) Standard Speed I2C Clock SCL Low Count Register            */
  __IM  uint16_t  RESERVED6;
  __IOM uint16_t  I2C_FS_SCL_HCNT_REG;          /*!< (@ 0x0000001C) Fast Speed I2C Clock SCL High Count Register               */
  __IM  uint16_t  RESERVED7;
  __IOM uint16_t  I2C_FS_SCL_LCNT_REG;          /*!< (@ 0x00000020) Fast Speed I2C Clock SCL Low Count Register                */
  __IM  uint16_t  RESERVED8[5];
  __IOM uint16_t  I2C_INTR_STAT_REG;            /*!< (@ 0x0000002C) I2C Interrupt Status Register                              */
  __IM  uint16_t  RESERVED9;
  __IOM uint16_t  I2C_INTR_MASK_REG;            /*!< (@ 0x00000030) I2C Interrupt Mask Register                                */
  __IM  uint16_t  RESERVED10;
  __IOM uint16_t  I2C_RAW_INTR_STAT_REG;        /*!< (@ 0x00000034) I2C Raw Interrupt Status Register                          */
  __IM  uint16_t  RESERVED11;
  __IOM uint16_t  I2C_RX_TL_REG;                /*!< (@ 0x00000038) I2C Receive FIFO Threshold Register                        */
  __IM  uint16_t  RESERVED12;
  __IOM uint16_t  I2C_TX_TL_REG;                /*!< (@ 0x0000003C) I2C Transmit FIFO Threshold Register                       */
  __IM  uint16_t  RESERVED13;
  __IOM uint16_t  I2C_CLR_INTR_REG;             /*!< (@ 0x00000040) Clear Combined and Individual Interrupt Register           */
  __IM  uint16_t  RESERVED14;
  __IOM uint16_t  I2C_CLR_RX_UNDER_REG;         /*!< (@ 0x00000044) Clear RX_UNDER Interrupt Register                          */
  __IM  uint16_t  RESERVED15;
  __IOM uint16_t  I2C_CLR_RX_OVER_REG;          /*!< (@ 0x00000048) Clear RX_OVER Interrupt Register                           */
  __IM  uint16_t  RESERVED16;
  __IOM uint16_t  I2C_CLR_TX_OVER_REG;          /*!< (@ 0x0000004C) Clear TX_OVER Interrupt Register                           */
  __IM  uint16_t  RESERVED17;
  __IOM uint16_t  I2C_CLR_RD_REQ_REG;           /*!< (@ 0x00000050) Clear RD_REQ Interrupt Register                            */
  __IM  uint16_t  RESERVED18;
  __IOM uint16_t  I2C_CLR_TX_ABRT_REG;          /*!< (@ 0x00000054) Clear TX_ABRT Interrupt Register                           */
  __IM  uint16_t  RESERVED19;
  __IOM uint16_t  I2C_CLR_RX_DONE_REG;          /*!< (@ 0x00000058) Clear RX_DONE Interrupt Register                           */
  __IM  uint16_t  RESERVED20;
  __IOM uint16_t  I2C_CLR_ACTIVITY_REG;         /*!< (@ 0x0000005C) Clear ACTIVITY Interrupt Register                          */
  __IM  uint16_t  RESERVED21;
  __IOM uint16_t  I2C_CLR_STOP_DET_REG;         /*!< (@ 0x00000060) Clear STOP_DET Interrupt Register                          */
  __IM  uint16_t  RESERVED22;
  __IOM uint16_t  I2C_CLR_START_DET_REG;        /*!< (@ 0x00000064) Clear START_DET Interrupt Register                         */
  __IM  uint16_t  RESERVED23;
  __IOM uint16_t  I2C_CLR_GEN_CALL_REG;         /*!< (@ 0x00000068) Clear GEN_CALL Interrupt Register                          */
  __IM  uint16_t  RESERVED24;
  __IOM uint16_t  I2C_ENABLE_REG;               /*!< (@ 0x0000006C) I2C Enable Register                                        */
  __IM  uint16_t  RESERVED25;
  __IOM uint16_t  I2C_STATUS_REG;               /*!< (@ 0x00000070) I2C Status Register                                        */
  __IM  uint16_t  RESERVED26;
  __IOM uint16_t  I2C_TXFLR_REG;                /*!< (@ 0x00000074) I2C Transmit FIFO Level Register                           */
  __IM  uint16_t  RESERVED27;
  __IOM uint16_t  I2C_RXFLR_REG;                /*!< (@ 0x00000078) I2C Receive FIFO Level Register                            */
  __IM  uint16_t  RESERVED28;
  __IOM uint16_t  I2C_SDA_HOLD_REG;             /*!< (@ 0x0000007C) I2C SDA Hold Time Length Register                          */
  __IM  uint16_t  RESERVED29;
  __IOM uint16_t  I2C_TX_ABRT_SOURCE_REG;       /*!< (@ 0x00000080) I2C Transmit Abort Source Register                         */
  __IM  uint16_t  RESERVED30[3];
  __IOM uint16_t  I2C_DMA_CR_REG;               /*!< (@ 0x00000088) DMA Control Register                                       */
  __IM  uint16_t  RESERVED31;
  __IOM uint16_t  I2C_DMA_TDLR_REG;             /*!< (@ 0x0000008C) DMA Transmit Data Level Register                           */
  __IM  uint16_t  RESERVED32;
  __IOM uint16_t  I2C_DMA_RDLR_REG;             /*!< (@ 0x00000090) I2C Receive Data Level Register                            */
  __IM  uint16_t  RESERVED33;
  __IOM uint16_t  I2C_SDA_SETUP_REG;            /*!< (@ 0x00000094) I2C SDA Setup Register                                     */
  __IM  uint16_t  RESERVED34;
  __IOM uint16_t  I2C_ACK_GENERAL_CALL_REG;     /*!< (@ 0x00000098) I2C ACK General Call Register                              */
  __IM  uint16_t  RESERVED35;
  __IOM uint16_t  I2C_ENABLE_STATUS_REG;        /*!< (@ 0x0000009C) I2C Enable Status Register                                 */
  __IM  uint16_t  RESERVED36;
  __IOM uint16_t  I2C_IC_FS_SPKLEN_REG;         /*!< (@ 0x000000A0) I2C SS and FS spike suppression limit Size                 */
  __IM  uint16_t  RESERVED37[41];
  __IOM uint16_t  I2C_COMP_PARAM1_REG;          /*!< (@ 0x000000F4) Component Parameter Register                               */
  __IOM uint16_t  I2C_COMP_PARAM2_REG;          /*!< (@ 0x000000F6) Component Parameter Register 2                             */
  __IOM uint16_t  I2C_COMP_VERSION_REG;         /*!< (@ 0x000000F8) I2C Component Version Register                             */
  __IOM uint16_t  I2C_COMP2_VERSION;            /*!< (@ 0x000000FA) I2C Component2 Version Register                            */
  __IOM uint16_t  I2C_COMP_TYPE_REG;            /*!< (@ 0x000000FC) I2C Component Type Register                                */
  __IOM uint16_t  I2C_COMP_TYPE2_REG;           /*!< (@ 0x000000FE) I2C Component2 Type Register                               */
} I2C_Type;                                     /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                           I2C2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C2 registers (I2C2)
  */

typedef struct {                                /*!< (@ 0x50001500) I2C2 Structure                                             */
  __IOM uint16_t  I2C2_CON_REG;                 /*!< (@ 0x00000000) I2C Control Register                                       */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  I2C2_TAR_REG;                 /*!< (@ 0x00000004) I2C Target Address Register                                */
  __IM  uint16_t  RESERVED1;
  __IOM uint16_t  I2C2_SAR_REG;                 /*!< (@ 0x00000008) I2C Slave Address Register                                 */
  __IM  uint16_t  RESERVED2;
  __IOM uint16_t  I2C2_HS_MADDR_REG;            /*!< (@ 0x0000000C) I2C High Speed Master Mode Code Address Register           */
  __IM  uint16_t  RESERVED3;
  __IOM uint16_t  I2C2_DATA_CMD_REG;            /*!< (@ 0x00000010) I2C Rx/Tx Data Buffer and Command Register                 */
  __IM  uint16_t  RESERVED4;
  __IOM uint16_t  I2C2_SS_SCL_HCNT_REG;         /*!< (@ 0x00000014) Standard Speed I2C Clock SCL High Count Register           */
  __IM  uint16_t  RESERVED5;
  __IOM uint16_t  I2C2_SS_SCL_LCNT_REG;         /*!< (@ 0x00000018) Standard Speed I2C Clock SCL Low Count Register            */
  __IM  uint16_t  RESERVED6;
  __IOM uint16_t  I2C2_FS_SCL_HCNT_REG;         /*!< (@ 0x0000001C) Fast Speed I2C Clock SCL High Count Register               */
  __IM  uint16_t  RESERVED7;
  __IOM uint16_t  I2C2_FS_SCL_LCNT_REG;         /*!< (@ 0x00000020) Fast Speed I2C Clock SCL Low Count Register                */
  __IM  uint16_t  RESERVED8[5];
  __IOM uint16_t  I2C2_INTR_STAT_REG;           /*!< (@ 0x0000002C) I2C Interrupt Status Register                              */
  __IM  uint16_t  RESERVED9;
  __IOM uint16_t  I2C2_INTR_MASK_REG;           /*!< (@ 0x00000030) I2C Interrupt Mask Register                                */
  __IM  uint16_t  RESERVED10;
  __IOM uint16_t  I2C2_RAW_INTR_STAT_REG;       /*!< (@ 0x00000034) I2C Raw Interrupt Status Register                          */
  __IM  uint16_t  RESERVED11;
  __IOM uint16_t  I2C2_RX_TL_REG;               /*!< (@ 0x00000038) I2C Receive FIFO Threshold Register                        */
  __IM  uint16_t  RESERVED12;
  __IOM uint16_t  I2C2_TX_TL_REG;               /*!< (@ 0x0000003C) I2C Transmit FIFO Threshold Register                       */
  __IM  uint16_t  RESERVED13;
  __IOM uint16_t  I2C2_CLR_INTR_REG;            /*!< (@ 0x00000040) Clear Combined and Individual Interrupt Register           */
  __IM  uint16_t  RESERVED14;
  __IOM uint16_t  I2C2_CLR_RX_UNDER_REG;        /*!< (@ 0x00000044) Clear RX_UNDER Interrupt Register                          */
  __IM  uint16_t  RESERVED15;
  __IOM uint16_t  I2C2_CLR_RX_OVER_REG;         /*!< (@ 0x00000048) Clear RX_OVER Interrupt Register                           */
  __IM  uint16_t  RESERVED16;
  __IOM uint16_t  I2C2_CLR_TX_OVER_REG;         /*!< (@ 0x0000004C) Clear TX_OVER Interrupt Register                           */
  __IM  uint16_t  RESERVED17;
  __IOM uint16_t  I2C2_CLR_RD_REQ_REG;          /*!< (@ 0x00000050) Clear RD_REQ Interrupt Register                            */
  __IM  uint16_t  RESERVED18;
  __IOM uint16_t  I2C2_CLR_TX_ABRT_REG;         /*!< (@ 0x00000054) Clear TX_ABRT Interrupt Register                           */
  __IM  uint16_t  RESERVED19;
  __IOM uint16_t  I2C2_CLR_RX_DONE_REG;         /*!< (@ 0x00000058) Clear RX_DONE Interrupt Register                           */
  __IM  uint16_t  RESERVED20;
  __IOM uint16_t  I2C2_CLR_ACTIVITY_REG;        /*!< (@ 0x0000005C) Clear ACTIVITY Interrupt Register                          */
  __IM  uint16_t  RESERVED21;
  __IOM uint16_t  I2C2_CLR_STOP_DET_REG;        /*!< (@ 0x00000060) Clear STOP_DET Interrupt Register                          */
  __IM  uint16_t  RESERVED22;
  __IOM uint16_t  I2C2_CLR_START_DET_REG;       /*!< (@ 0x00000064) Clear START_DET Interrupt Register                         */
  __IM  uint16_t  RESERVED23;
  __IOM uint16_t  I2C2_CLR_GEN_CALL_REG;        /*!< (@ 0x00000068) Clear GEN_CALL Interrupt Register                          */
  __IM  uint16_t  RESERVED24;
  __IOM uint16_t  I2C2_ENABLE_REG;              /*!< (@ 0x0000006C) I2C Enable Register                                        */
  __IM  uint16_t  RESERVED25;
  __IOM uint16_t  I2C2_STATUS_REG;              /*!< (@ 0x00000070) I2C Status Register                                        */
  __IM  uint16_t  RESERVED26;
  __IOM uint16_t  I2C2_TXFLR_REG;               /*!< (@ 0x00000074) I2C Transmit FIFO Level Register                           */
  __IM  uint16_t  RESERVED27;
  __IOM uint16_t  I2C2_RXFLR_REG;               /*!< (@ 0x00000078) I2C Receive FIFO Level Register                            */
  __IM  uint16_t  RESERVED28;
  __IOM uint16_t  I2C2_SDA_HOLD_REG;            /*!< (@ 0x0000007C) I2C SDA Hold Time Length Register                          */
  __IM  uint16_t  RESERVED29;
  __IOM uint16_t  I2C2_TX_ABRT_SOURCE_REG;      /*!< (@ 0x00000080) I2C Transmit Abort Source Register                         */
  __IM  uint16_t  RESERVED30[3];
  __IOM uint16_t  I2C2_DMA_CR_REG;              /*!< (@ 0x00000088) DMA Control Register                                       */
  __IM  uint16_t  RESERVED31;
  __IOM uint16_t  I2C2_DMA_TDLR_REG;            /*!< (@ 0x0000008C) DMA Transmit Data Level Register                           */
  __IM  uint16_t  RESERVED32;
  __IOM uint16_t  I2C2_DMA_RDLR_REG;            /*!< (@ 0x00000090) I2C Receive Data Level Register                            */
  __IM  uint16_t  RESERVED33;
  __IOM uint16_t  I2C2_SDA_SETUP_REG;           /*!< (@ 0x00000094) I2C SDA Setup Register                                     */
  __IM  uint16_t  RESERVED34;
  __IOM uint16_t  I2C2_ACK_GENERAL_CALL_REG;    /*!< (@ 0x00000098) I2C ACK General Call Register                              */
  __IM  uint16_t  RESERVED35;
  __IOM uint16_t  I2C2_ENABLE_STATUS_REG;       /*!< (@ 0x0000009C) I2C Enable Status Register                                 */
  __IM  uint16_t  RESERVED36;
  __IOM uint16_t  I2C2_IC_FS_SPKLEN_REG;        /*!< (@ 0x000000A0) I2C SS and FS spike suppression limit Size                 */
  __IM  uint16_t  RESERVED37[41];
  __IOM uint16_t  I2C2_COMP_PARAM1_REG;         /*!< (@ 0x000000F4) Component Parameter Register                               */
  __IOM uint16_t  I2C2_COMP_PARAM2_REG;         /*!< (@ 0x000000F6) Component Parameter Register 2                             */
  __IOM uint16_t  I2C2_COMP_VERSION_REG;        /*!< (@ 0x000000F8) I2C Component Version Register                             */
  __IOM uint16_t  I2C2_COMP2_VERSION;           /*!< (@ 0x000000FA) I2C Component2 Version Register                            */
  __IOM uint16_t  I2C2_COMP_TYPE_REG;           /*!< (@ 0x000000FC) I2C Component Type Register                                */
  __IOM uint16_t  I2C2_COMP_TYPE2_REG;          /*!< (@ 0x000000FE) I2C Component2 Type Register                               */
} I2C2_Type;                                    /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                            IR                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief IR registers (IR)
  */

typedef struct {                                /*!< (@ 0x50001700) IR Structure                                               */
  __IOM uint16_t  IR_FREQ_CARRIER_ON_REG;       /*!< (@ 0x00000000) Defines the carrier signal high duration                   */
  __IOM uint16_t  IR_FREQ_CARRIER_OFF_REG;      /*!< (@ 0x00000002) Defnes the carrier signal low duration                     */
  __IOM uint16_t  IR_LOGIC_ONE_TIME_REG;        /*!< (@ 0x00000004) Defines the logic one waveform                             */
  __IOM uint16_t  IR_LOGIC_ZERO_TIME_REG;       /*!< (@ 0x00000006) Defines the logic zero wavefrom                            */
  __IOM uint16_t  IR_CTRL_REG;                  /*!< (@ 0x00000008) IR control register                                        */
  __IOM uint16_t  IR_STATUS_REG;                /*!< (@ 0x0000000A) IR status register                                         */
  __IOM uint16_t  IR_REPEAT_TIME_REG;           /*!< (@ 0x0000000C) Defines the repeat time                                    */
  __IOM uint16_t  IR_MAIN_FIFO_REG;             /*!< (@ 0x0000000E) Main fifo write register                                   */
  __IOM uint16_t  IR_REPEAT_FIFO_REG;           /*!< (@ 0x00000010) Repeat fifo write register                                 */
  __IOM uint16_t  IR_IRQ_STATUS_REG;            /*!< (@ 0x00000012) IR interrupt status register                               */
} IR_Type;                                      /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                          KBSCAN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief KBSCAN registers (KBSCAN)
  */

