S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50001600) KBSCAN Structure                                           */
  __IOM uint16_t  KBSCN_CTRL_REG;               /*!< (@ 0x00000000) Keyboard scanner control register                          */
  __IOM uint16_t  KBSCN_CTRL2_REG;              /*!< (@ 0x00000002) Keyboard scanner control 2 register                        */
  __IOM uint16_t  KBSCN_MATRIX_SIZE_REG;        /*!< (@ 0x00000004) Defines the number of rows and columns of the
                                                                    matrix                                                     */
  __IOM uint16_t  KBSCN_DEBOUNCE_REG;           /*!< (@ 0x00000006) Defines the debounce time for key press and release        */
  __IOM uint16_t  KBSCN_STATUS_REG;             /*!< (@ 0x00000008) keyboard scanner Interrupt status register                 */
  __IOM uint16_t  KBSCN_MESSAGE_KEY_REG;        /*!< (@ 0x0000000A) Returns a key message from the message queue               */
  __IOM uint16_t  KBSCN_P00_MODE_REG;           /*!< (@ 0x0000000C) Defines the keyboard mode for P00                          */
  __IOM uint16_t  KBSCN_P01_MODE_REG;           /*!< (@ 0x0000000E) Defines the keyboard mode for P01                          */
  __IOM uint16_t  KBSCN_P02_MODE_REG;           /*!< (@ 0x00000010) Defines the keyboard mode for P02                          */
  __IOM uint16_t  KBSCN_P03_MODE_REG;           /*!< (@ 0x00000012) Defines the keyboard mode for P03                          */
  __IOM uint16_t  KBSCN_P04_MODE_REG;           /*!< (@ 0x00000014) Defines the keyboard mode for P04                          */
  __IOM uint16_t  KBSCN_P05_MODE_REG;           /*!< (@ 0x00000016) Defines the keyboard mode for P05                          */
  __IOM uint16_t  KBSCN_P06_MODE_REG;           /*!< (@ 0x00000018) Defines the keyboard mode for P06                          */
  __IOM uint16_t  KBSCN_P07_MODE_REG;           /*!< (@ 0x0000001A) Defines the keyboard mode for P07                          */
  __IOM uint16_t  KBSCN_P10_MODE_REG;           /*!< (@ 0x0000001C) Defines the keyboard mode for P10                          */
  __IOM uint16_t  KBSCN_P11_MODE_REG;           /*!< (@ 0x0000001E) Defines the keyboard mode for P11                          */
  __IOM uint16_t  KBSCN_P12_MODE_REG;           /*!< (@ 0x00000020) Defines the keyboard mode for P12                          */
  __IOM uint16_t  KBSCN_P13_MODE_REG;           /*!< (@ 0x00000022) Defines the keyboard mode for P13                          */
  __IOM uint16_t  KBSCN_P14_MODE_REG;           /*!< (@ 0x00000024) Defines the keyboard mode for P14                          */
  __IOM uint16_t  KBSCN_P15_MODE_REG;           /*!< (@ 0x00000026) Defines the keyboard mode for P15                          */
  __IOM uint16_t  KBSCN_P16_MODE_REG;           /*!< (@ 0x00000028) Defines the keyboard mode for P16                          */
  __IOM uint16_t  KBSCN_P17_MODE_REG;           /*!< (@ 0x0000002A) Defines the keyboard mode for P17                          */
  __IOM uint16_t  KBSCN_P20_MODE_REG;           /*!< (@ 0x0000002C) Defines the keyboard mode for P20                          */
  __IOM uint16_t  KBSCN_P21_MODE_REG;           /*!< (@ 0x0000002E) Defines the keyboard mode for P21                          */
  __IOM uint16_t  KBSCN_P22_MODE_REG;           /*!< (@ 0x00000030) Defines the keyboard mode for P22                          */
  __IOM uint16_t  KBSCN_P23_MODE_REG;           /*!< (@ 0x00000032) Defines the keyboard mode for P23                          */
  __IOM uint16_t  KBSCN_P24_MODE_REG;           /*!< (@ 0x00000034) Defines the keyboard mode for P24                          */
  __IM  uint16_t  RESERVED[3];
  __IOM uint16_t  KBSCN_P30_MODE_REG;           /*!< (@ 0x0000003C) Defines the keyboard mode for P30                          */
  __IOM uint16_t  KBSCN_P31_MODE_REG;           /*!< (@ 0x0000003E) Defines the keyboard mode for P31                          */
  __IOM uint16_t  KBSCN_P32_MODE_REG;           /*!< (@ 0x00000040) Defines the keyboard mode for P32                          */
  __IOM uint16_t  KBSCN_P33_MODE_REG;           /*!< (@ 0x00000042) Defines the keyboard mode for P33                          */
  __IOM uint16_t  KBSCN_P34_MODE_REG;           /*!< (@ 0x00000044) Defines the keyboard mode for P34                          */
  __IOM uint16_t  KBSCN_P35_MODE_REG;           /*!< (@ 0x00000046) Defines the keyboard mode for P35                          */
  __IOM uint16_t  KBSCN_P36_MODE_REG;           /*!< (@ 0x00000048) Defines the keyboard mode for P36                          */
  __IOM uint16_t  KBSCN_P37_MODE_REG;           /*!< (@ 0x0000004A) Defines the keyboard mode for P37                          */
  __IOM uint16_t  KBSCN_P40_MODE_REG;           /*!< (@ 0x0000004C) Defines the keyboard mode for P40                          */
  __IOM uint16_t  KBSCN_P41_MODE_REG;           /*!< (@ 0x0000004E) Defines the keyboard mode for P41                          */
  __IOM uint16_t  KBSCN_P42_MODE_REG;           /*!< (@ 0x00000050) Defines the keyboard mode for P42                          */
  __IOM uint16_t  KBSCN_P43_MODE_REG;           /*!< (@ 0x00000052) Defines the keyboard mode for P43                          */
  __IOM uint16_t  KBSCN_P44_MODE_REG;           /*!< (@ 0x00000054) Defines the keyboard mode for P44                          */
  __IOM uint16_t  KBSCN_P45_MODE_REG;           /*!< (@ 0x00000056) Defines the keyboard mode for P45                          */
  __IOM uint16_t  KBSCN_P46_MODE_REG;           /*!< (@ 0x00000058) Defines the keyboard mode for P46                          */
  __IOM uint16_t  KBSCN_P47_MODE_REG;           /*!< (@ 0x0000005A) Defines the keyboard mode for P47                          */
} KBSCAN_Type;                                  /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                           OTPC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief OTPC registers (OTPC)
  */

typedef struct {                                /*!< (@ 0x07F40000) OTPC Structure                                             */
  __IOM uint32_t  OTPC_MODE_REG;                /*!< (@ 0x00000000) Mode register                                              */
  __IOM uint32_t  OTPC_PCTRL_REG;               /*!< (@ 0x00000004) Bit-programming control register                           */
  __IOM uint32_t  OTPC_STAT_REG;                /*!< (@ 0x00000008) Status register                                            */
  __IOM uint32_t  OTPC_AHBADR_REG;              /*!< (@ 0x0000000C) AHB master start address                                   */
  __IOM uint32_t  OTPC_CELADR_REG;              /*!< (@ 0x00000010) Macrocell start address                                    */
  __IOM uint32_t  OTPC_NWORDS_REG;              /*!< (@ 0x00000014) Number of words                                            */
  __IOM uint32_t  OTPC_FFPRT_REG;               /*!< (@ 0x00000018) Ports access to fifo logic                                 */
  __IOM uint32_t  OTPC_FFRD_REG;                /*!< (@ 0x0000001C) The data which have taken with the latest read
                                                                    from the OTPC_FFPRT_REG                                    */
  __IOM uint32_t  OTPC_PWORDL_REG;              /*!< (@ 0x00000020) The 32 lower bits of the 64-bit word that will
                                                                    be programmed, when the MPROG mode is used.                */
  __IOM uint32_t  OTPC_PWORDH_REG;              /*!< (@ 0x00000024) The 32 higher bits of the 64-bit word that will
                                                                    be programmed, when the MPROG mode is used.                */
  __IOM uint32_t  OTPC_TIM1_REG;                /*!< (@ 0x00000028) Various timing parameters of the OTP cell.                 */
  __IOM uint32_t  OTPC_TIM2_REG;                /*!< (@ 0x0000002C) Various timing parameters of the OTP cell.                 */
} OTPC_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           PATCH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief PATCH registers (PATCH)
  */

typedef struct {                                /*!< (@ 0x40050000) PATCH Structure                                            */
  __IOM uint32_t  PATCH_VALID_REG;              /*!< (@ 0x00000000) Validity Control Register                                  */
  __IOM uint32_t  PATCH_VALID_SET_REG;          /*!< (@ 0x00000004) Validity Set Control Register                              */
  __IOM uint32_t  PATCH_VALID_RESET_REG;        /*!< (@ 0x00000008) Validity Reset Control Register                            */
  __IM  uint32_t  RESERVED[5];
  __IOM uint32_t  PATCH_ADDR0_REG;              /*!< (@ 0x00000020) Patch Address field                                        */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  PATCH_ADDR1_REG;              /*!< (@ 0x00000028) Patch Address field                                        */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  PATCH_ADDR2_REG;              /*!< (@ 0x00000030) Patch Address field                                        */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  PATCH_ADDR3_REG;              /*!< (@ 0x00000038) Patch Address field                                        */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  PATCH_ADDR4_REG;              /*!< (@ 0x00000040) Patch Address field                                        */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  PATCH_ADDR5_REG;              /*!< (@ 0x00000048) Patch Address field                                        */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  PATCH_ADDR6_REG;              /*!< (@ 0x00000050) Patch Address field                                        */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  PATCH_ADDR7_REG;              /*!< (@ 0x00000058) Patch Address field                                        */
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  PATCH_ADDR8_REG;              /*!< (@ 0x00000060) Patch Address field                                        */
  __IM  uint32_t  RESERVED9;
  __IOM uint32_t  PATCH_ADDR9_REG;              /*!< (@ 0x00000068) Patch Address field                                        */
  __IM  uint32_t  RESERVED10;
  __IOM uint32_t  PATCH_ADDR10_REG;             /*!< (@ 0x00000070) Patch Address field                                        */
  __IM  uint32_t  RESERVED11;
  __IOM uint32_t  PATCH_ADDR11_REG;             /*!< (@ 0x00000078) Patch Address field                                        */
  __IM  uint32_t  RESERVED12;
  __IOM uint32_t  PATCH_ADDR12_REG;             /*!< (@ 0x00000080) Patch Address field                                        */
  __IM  uint32_t  RESERVED13;
  __IOM uint32_t  PATCH_ADDR13_REG;             /*!< (@ 0x00000088) Patch Address field                                        */
  __IM  uint32_t  RESERVED14;
  __IOM uint32_t  PATCH_ADDR14_REG;             /*!< (@ 0x00000090) Patch Address field                                        */
  __IM  uint32_t  RESERVED15;
  __IOM uint32_t  PATCH_ADDR15_REG;             /*!< (@ 0x00000098) Patch Address field                                        */
  __IM  uint32_t  RESERVED16;
  __IOM uint32_t  PATCH_ADDR16_REG;             /*!< (@ 0x000000A0) Patch Address field                                        */
  __IM  uint32_t  RESERVED17;
  __IOM uint32_t  PATCH_ADDR17_REG;             /*!< (@ 0x000000A8) Patch Address field                                        */
  __IM  uint32_t  RESERVED18;
  __IOM uint32_t  PATCH_ADDR18_REG;             /*!< (@ 0x000000B0) Patch Address field                                        */
  __IM  uint32_t  RESERVED19;
  __IOM uint32_t  PATCH_ADDR19_REG;             /*!< (@ 0x000000B8) Patch Address field                                        */
  __IM  uint32_t  RESERVED20;
  __IOM uint32_t  PATCH_ADDR20_REG;             /*!< (@ 0x000000C0) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA20_REG;             /*!< (@ 0x000000C4) Patch Data field                                           */
  __IOM uint32_t  PATCH_ADDR21_REG;             /*!< (@ 0x000000C8) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA21_REG;             /*!< (@ 0x000000CC) Patch Data field                                           */
  __IOM uint32_t  PATCH_ADDR22_REG;             /*!< (@ 0x000000D0) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA22_REG;             /*!< (@ 0x000000D4) Patch Data field                                           */
  __IOM uint32_t  PATCH_ADDR23_REG;             /*!< (@ 0x000000D8) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA23_REG;             /*!< (@ 0x000000DC) Patch Data field                                           */
  __IOM uint32_t  PATCH_ADDR24_REG;             /*!< (@ 0x000000E0) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA24_REG;             /*!< (@ 0x000000E4) Patch Data field                                           */
  __IOM uint32_t  PATCH_ADDR25_REG;             /*!< (@ 0x000000E8) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA25_REG;             /*!< (@ 0x000000EC) Patch Data field                                           */
  __IOM uint32_t  PATCH_ADDR26_REG;             /*!< (@ 0x000000F0) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA26_REG;             /*!< (@ 0x000000F4) Patch Data field                                           */
  __IOM uint32_t  PATCH_ADDR27_REG;             /*!< (@ 0x000000F8) Patch Address field                                        */
  __IOM uint32_t  PATCH_DATA27_REG;             /*!< (@ 0x000000FC) Patch Data field                                           */
} PATCH_Type;                                   /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          PLLDIG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief PLLDIG registers (PLLDIG)
  */

typedef struct {                                /*!< (@ 0x50002D00) PLLDIG Structure                                           */
  __IOM uint16_t  RF_SYNTH_CTRL1_BLE_REG;       /*!< (@ 0x00000000) RF_SYNTH_CTRL1_BLE_REG                                     */
  __IOM uint16_t  RF_SYNTH_CTRL1_FTDF_REG;      /*!< (@ 0x00000002) RF_SYNTH_CTRL1_FTDF_REG                                    */
  __IOM uint16_t  RF_SYNTH_CTRL2_BLE_REG;       /*!< (@ 0x00000004) RF_SYNTH_CTRL2_BLE_REG                                     */
  __IOM uint16_t  RF_SYNTH_CTRL2_FTDF_REG;      /*!< (@ 0x00000006) RF_SYNTH_CTRL2_FTDF_REG                                    */
  __IOM uint16_t  RF_SYNTH_CTRL3_REG;           /*!< (@ 0x00000008) RF_SYNTH_CTRL3_REG                                         */
  __IOM uint16_t  RF_VCOCAL_CTRL_REG;           /*!< (@ 0x0000000A) RF_VCOCAL_CTRL_REG                                         */
  __IOM uint16_t  RF_MGAIN_CTRL_BLE_REG;        /*!< (@ 0x0000000C) RF_MGAIN_CTRL_BLE_REG                                      */
  __IOM uint16_t  RF_MGAIN_CTRL_FTDF_REG;       /*!< (@ 0x0000000E) RF_MGAIN_CTRL_FTDF_REG                                     */
  __IOM uint16_t  RF_MGAIN_CTRL2_REG;           /*!< (@ 0x00000010) RF_MGAIN_CTRL2_REG                                         */
  __IOM uint16_t  RF_VCO_CALCAP_BIT14_REG;      /*!< (@ 0x00000012) RF_VCO_CALCAP_BIT14_REG                                    */
  __IOM uint16_t  RF_VCO_CALCAP_BIT15_REG;      /*!< (@ 0x00000014) RF_VCO_CALCAP_BIT15_REG                                    */
  __IOM uint16_t  RF_BMCW_REG;                  /*!< (@ 0x00000016) RF_BMCW_REG                                                */
  __IOM uint16_t  RF_KMOD_ALPHA_REG;            /*!< (@ 0x00000018) RF_KMOD_ALPHA_REG                                          */
  __IM  uint16_t  RESERVED[2];
  __IOM uint16_t  RF_SYNTH_RESULT_BLE_REG;      /*!< (@ 0x0000001E) Must be Retained                                           */
  __IOM uint16_t  RF_SYNTH_RESULT_FTDF_REG;     /*!< (@ 0x00000020) Must be Retained                                           */
  __IOM uint16_t  RF_SYNTH_RESULT2_BLE_REG;     /*!< (@ 0x00000022) Must be Retained                                           */
  __IOM uint16_t  RF_SYNTH_RESULT2_FTDF_REG;    /*!< (@ 0x00000024) Must be Retained                                           */
  __IOM uint16_t  RF_SYNTH_RESULT3_FTDF_REG;    /*!< (@ 0x00000026) RF_SYNTH_RESULT3_FTDF_REG                                  */
  __IOM uint16_t  RF_CALCAP1_REG;               /*!< (@ 0x00000028) RF_CALCAP1_REG                                             */
  __IOM uint16_t  RF_CALCAP2_REG;               /*!< (@ 0x0000002A) RF_CALCAP2_REG                                             */
  __IM  uint16_t  RESERVED1[2];
  __IOM uint16_t  RF_FTDF_PHYATTR_REG;          /*!< (@ 0x00000030) RF_FTDF_PHYATTR_REG                                        */
  __IOM uint16_t  RF_CALTRIM_STEP1_REG;         /*!< (@ 0x00000032) RF_CALTRIM_STEP1_REG                                       */
  __IOM uint16_t  RF_CALTRIM_STEP2_REG;         /*!< (@ 0x00000034) RF_CALTRIM_STEP2_REG                                       */
  __IOM uint16_t  RF_CALTRIM_STEP3_REG;         /*!< (@ 0x00000036) RF_CALTRIM_STEP3_REG                                       */
  __IOM uint16_t  RF_CALTRIM_STEP4_REG;         /*!< (@ 0x00000038) RF_CALTRIM_STEP4_REG                                       */
  __IM  uint16_t  RESERVED2[3];
  __IOM uint16_t  RF_MSKMOD_CTRL1_REG;          /*!< (@ 0x00000040) MSK modulator control register                             */
  __IOM uint16_t  RF_MSKMOD_CTRL2_REG;          /*!< (@ 0x00000042) MSK modulator control register                             */
  __IOM uint16_t  RF_MSKMOD_CHIPL_REG;          /*!< (@ 0x00000044) MSK modulator CHIP control lower 16 bit                    */
  __IOM uint16_t  RF_MSKMOD_CHIPH_REG;          /*!< (@ 0x00000046) MSK modulator CHIP control upper 16 bit                    */
  __IM  uint16_t  RESERVED3[4];
  __IOM uint16_t  RF_MGAIN_COMP_VAL0_REG;       /*!< (@ 0x00000050) RF_MGAIN_COMP_VAL0_REG                                     */
  __IOM uint16_t  RF_MGAIN_COMP_VAL1_REG;       /*!< (@ 0x00000052) RF_MGAIN_COMP_VAL1_REG                                     */
  __IOM uint16_t  RF_MGAIN_COMP_VAL2_REG;       /*!< (@ 0x00000054) RF_MGAIN_COMP_VAL2_REG                                     */
  __IOM uint16_t  RF_MGAIN_COMP_VAL3_REG;       /*!< (@ 0x00000056) RF_MGAIN_COMP_VAL3_REG                                     */
  __IOM uint16_t  RF_MGAIN_COMP_VAL4_REG;       /*!< (@ 0x00000058) RF_MGAIN_COMP_VAL4_REG                                     */
  __IOM uint16_t  RF_MGAIN_COMP_VAL5_REG;       /*!< (@ 0x0000005A) RF_MGAIN_COMP_VAL5_REG                                     */
  __IOM uint16_t  RF_MGAIN_COMP_VAL6_REG;       /*!< (@ 0x0000005C) RF_MGAIN_COMP_VAL6_REG                                     */
} PLLDIG_Type;                                  /*!< Size = 94 (0x5e)                                                          */



/* =========================================================================================================================== */
/* ================                                           QSPIC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief QSPIC registers (QSPIC)
  */

