S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x0C000000) QSPIC Structure                                            */
  __IOM uint32_t  QSPIC_CTRLBUS_REG;            /*!< (@ 0x00000000) SPI Bus control register for the Manual mode               */
  __IOM uint32_t  QSPIC_CTRLMODE_REG;           /*!< (@ 0x00000004) Mode Control register                                      */
  __IOM uint32_t  QSPIC_RECVDATA_REG;           /*!< (@ 0x00000008) Received data for the Manual mode                          */
  __IOM uint32_t  QSPIC_BURSTCMDA_REG;          /*!< (@ 0x0000000C) The way of reading in Auto mode (command register
                                                                    A)                                                         */
  __IOM uint32_t  QSPIC_BURSTCMDB_REG;          /*!< (@ 0x00000010) The way of reading in Auto mode (command register
                                                                    B)                                                         */
  __IOM uint32_t  QSPIC_STATUS_REG;             /*!< (@ 0x00000014) The status register of the QSPI controller                 */
  __IOM uint32_t  QSPIC_WRITEDATA_REG;          /*!< (@ 0x00000018) Write data to SPI Bus for the Manual mode                  */
  __IOM uint32_t  QSPIC_READDATA_REG;           /*!< (@ 0x0000001C) Read data from SPI Bus for the Manual mode                 */
  __IOM uint32_t  QSPIC_DUMMYDATA_REG;          /*!< (@ 0x00000020) Send dummy clocks to SPI Bus for the Manual mode           */
  __IOM uint32_t  QSPIC_ERASECTRL_REG;          /*!< (@ 0x00000024) QSPI Erase control register                                */
  __IOM uint32_t  QSPIC_ERASECMDA_REG;          /*!< (@ 0x00000028) The way of erasing in Auto mode (command register
                                                                    A)                                                         */
  __IOM uint32_t  QSPIC_ERASECMDB_REG;          /*!< (@ 0x0000002C) The way of erasing in Auto mode (command register
                                                                    B)                                                         */
  __IOM uint32_t  QSPIC_BURSTBRK_REG;           /*!< (@ 0x00000030) Read break sequence in Auto mode                           */
  __IOM uint32_t  QSPIC_STATUSCMD_REG;          /*!< (@ 0x00000034) The way of reading the status of external device
                                                                    in Auto mode                                               */
  __IOM uint32_t  QSPIC_CHCKERASE_REG;          /*!< (@ 0x00000038) Check erase progress in Auto mode                          */
  __IOM uint32_t  QSPIC_GP_REG;                 /*!< (@ 0x0000003C) QSPI General Purpose control register                      */
  __IOM uint32_t  QSPIC_UCODE_START;            /*!< (@ 0x00000040) QSPIC uCode memory                                         */
} QSPIC_Type;                                   /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                           QUAD                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief QUAD registers (QUAD)
  */

typedef struct {                                /*!< (@ 0x50001A00) QUAD Structure                                             */
  __IOM uint16_t  QDEC_CTRL_REG;                /*!< (@ 0x00000000) Quad decoder control register                              */
  __IOM uint16_t  QDEC_XCNT_REG;                /*!< (@ 0x00000002) Counter value of the X Axis                                */
  __IOM uint16_t  QDEC_YCNT_REG;                /*!< (@ 0x00000004) Counter value of the Y Axis                                */
  __IOM uint16_t  QDEC_ZCNT_REG;                /*!< (@ 0x00000006) Counter value of the Z Axis                                */
  __IOM uint16_t  QDEC_CLOCKDIV_REG;            /*!< (@ 0x00000008) Quad decoder clock divider register                        */
} QUAD_Type;                                    /*!< Size = 10 (0xa)                                                           */



/* =========================================================================================================================== */
/* ================                                           RFCU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief RFCU registers (RFCU)
  */

typedef struct {                                /*!< (@ 0x50002000) RFCU Structure                                             */
  __IM  uint32_t  RESERVED[4];
  __IOM uint16_t  RF_OVERRULE_REG;              /*!< (@ 0x00000010) RF_OVERRULE_REG                                            */
  __IOM uint16_t  RF_DIAGIRQ01_REG;             /*!< (@ 0x00000012) BLE/RF Diagnostic IRQ Control Register                     */
  __IOM uint16_t  RF_DIAGIRQ23_REG;             /*!< (@ 0x00000014) BLE/RF Diagnostic IRQ Control Register                     */
  __IOM uint16_t  RF_DIAGIRQ_STAT_REG;          /*!< (@ 0x00000016) BLE/RF Diagnostic IRQ Status Register                      */
  __IM  uint32_t  RESERVED1[2];
  __IOM uint16_t  RF_CALSTATE_REG;              /*!< (@ 0x00000020) RF_CALSTATE_REG                                            */
  __IM  uint16_t  RESERVED2[15];
  __IOM uint16_t  RF_SCAN_FEEDBACK_REG;         /*!< (@ 0x00000040) RF_SCAN_FEEDBACK_REG                                       */
  __IOM uint16_t  RF_REF_OSC_BLE_REG;           /*!< (@ 0x00000042) RF_REF_OSC_BLE_REG                                         */
  __IOM uint16_t  RF_REF_OSC_FTDF_REG;          /*!< (@ 0x00000044) RF_REF_OSC_FTDF_REG                                        */
  __IM  uint16_t  RESERVED3[5];
  __IOM uint16_t  RF_CAL_CTRL_REG;              /*!< (@ 0x00000050) RF_CAL_CTRL_REG                                            */
  __IM  uint16_t  RESERVED4;
  __IOM uint16_t  RF_IRQ_CTRL_REG;              /*!< (@ 0x00000054) RF_IRQ_CTRL_REG                                            */
  __IM  uint16_t  RESERVED5;
  __IOM uint16_t  RF_ADCI_DC_OFFSET_REG;        /*!< (@ 0x00000058) Must be Retained                                           */
  __IOM uint16_t  RF_ADCQ_DC_OFFSET_REG;        /*!< (@ 0x0000005A) Must be Retained                                           */
  __IM  uint32_t  RESERVED6[9];
  __IOM uint16_t  RF_SPARE1_BLE_REG;            /*!< (@ 0x00000080) RF_SPARE1_BLE_REG                                          */
  __IOM uint16_t  RF_SPARE1_FTDF_REG;           /*!< (@ 0x00000082) RF_SPARE1_FTDF_REG                                         */
  __IOM uint16_t  RF_BIAS_CTRL1_BLE_REG;        /*!< (@ 0x00000084) RF_BIAS_CTRL1_BLE_REG                                      */
  __IOM uint16_t  RF_BIAS_CTRL1_FTDF_REG;       /*!< (@ 0x00000086) RF_BIAS_CTRL1_FTDF_REG                                     */
  __IOM uint16_t  RF_IFF_CTRL1_REG;             /*!< (@ 0x00000088) RF_IFF_CTRL1_REG                                           */
  __IOM uint16_t  RF_ADC_CTRL1_REG;             /*!< (@ 0x0000008A) RF_ADC_CTRL1_REG                                           */
  __IOM uint16_t  RF_ADC_CTRL2_REG;             /*!< (@ 0x0000008C) RF_ADC_CTRL2_REG                                           */
  __IOM uint16_t  RF_ADC_CTRL3_REG;             /*!< (@ 0x0000008E) RF_ADC_CTRL3_REG                                           */
  __IOM uint16_t  RF_PA_CTRL_REG;               /*!< (@ 0x00000090) Removed obsolete values of bits 10:7, pa_pw back
                                                                    to 4                                                       */
  __IOM uint16_t  RF_MGC_CTRL_REG;              /*!< (@ 0x00000092) RF_MGC_CTRL_REG                                            */
  __IOM uint16_t  RF_VCOVAR_CTRL_REG;           /*!< (@ 0x00000094) RF_VCOVAR_CTRL_REG                                         */
  __IOM uint16_t  RF_PFD_CTRL_REG;              /*!< (@ 0x00000096) RF_PFD_CTRL_REG                                            */
  __IOM uint16_t  RF_CP_CTRL_BLE_REG;           /*!< (@ 0x00000098) RF_CP_CTRL_BLE_REG                                         */
  __IOM uint16_t  RF_CP_CTRL_FTDF_REG;          /*!< (@ 0x0000009A) RF_CP_CTRL_FTDF_REG                                        */
  __IOM uint16_t  RF_LF_RES_CTRL_BLE_REG;       /*!< (@ 0x0000009C) LF resistor setting in BLE mode                            */
  __IOM uint16_t  RF_LF_RES_CTRL_FTDF_REG;      /*!< (@ 0x0000009E) LF resistor setting in FTDF mode                           */
  __IOM uint16_t  RF_MIXER_CTRL1_BLE_REG;       /*!< (@ 0x000000A0) RF_MIXER_CTRL1_BLE_REG                                     */
  __IOM uint16_t  RF_MIXER_CTRL1_FTDF_REG;      /*!< (@ 0x000000A2) RF_MIXER_CTRL1_FTDF_REG                                    */
  __IOM uint16_t  RF_MIXER_CTRL2_REG;           /*!< (@ 0x000000A4) RF_MIXER_CTRL2_REG                                         */
  __IOM uint16_t  RF_LF_CTRL_REG;               /*!< (@ 0x000000A6) RF_LF_CTRL_REG                                             */
  __IOM uint16_t  RF_TDC_CTRL_REG;              /*!< (@ 0x000000A8) TDC settings                                               */
  __IOM uint16_t  RF_IO_CTRL1_REG;              /*!< (@ 0x000000AA) RF_IO_CTRL1_REG                                            */
  __IOM uint16_t  RF_LNA_CTRL1_REG;             /*!< (@ 0x000000AC) RF_LNA_CTRL1_REG                                           */
  __IOM uint16_t  RF_LNA_CTRL2_REG;             /*!< (@ 0x000000AE) RF_LNA_CTRL2_REG                                           */
  __IOM uint16_t  RF_LNA_CTRL3_REG;             /*!< (@ 0x000000B0) RF_LNA_CTRL3_REG                                           */
  __IOM uint16_t  RF_VCO_CTRL_REG;              /*!< (@ 0x000000B2) RF_VCO_CTRL_REG                                            */
  __IM  uint32_t  RESERVED7[3];
  __IOM uint16_t  RF_TX_PWR_REG;                /*!< (@ 0x000000C0) TX Power setting                                           */
  __IOM uint16_t  RF_TX_PWR_LUT_1_REG;          /*!< (@ 0x000000C2) TX Power setting 1                                         */
  __IOM uint16_t  RF_TX_PWR_LUT_2_REG;          /*!< (@ 0x000000C4) TX Power setting 2                                         */
  __IOM uint16_t  RF_TX_PWR_LUT_3_REG;          /*!< (@ 0x000000C6) TX Power setting 3                                         */
  __IOM uint16_t  RF_TX_PWR_LUT_4_REG;          /*!< (@ 0x000000C8) TX Power setting 4                                         */
  __IOM uint16_t  RF_TX_PWR_LUT_5_REG;          /*!< (@ 0x000000CA) TX Power setting 5                                         */
  __IOM uint16_t  RF_TX_PWR_LUT_7_REG;          /*!< (@ 0x000000CC) TX Power setting 7                                         */
  __IOM uint16_t  RF_TX_PWR_LUT_6_REG;          /*!< (@ 0x000000CE) TX Power setting 6                                         */
  __IOM uint16_t  RF_TX_PWR_LUT_RD_REG;         /*!< (@ 0x000000D0) TX Power read back                                         */
  __IOM uint16_t  RF_DIV_IQ_RX_REG;             /*!< (@ 0x000000D2) Bias trimming of IQ divider                                */
  __IOM uint16_t  RF_DIV_IQ_TX_REG;             /*!< (@ 0x000000D4) Bias trimming of IQ divider                                */
  __IM  uint16_t  RESERVED8;
  __IOM uint16_t  RF_LO_IQ_TRIM_REG;            /*!< (@ 0x000000D8) Trim settings for IQ LO path                               */
  __IOM uint16_t  RF_TXDAC_CTRL_REG;            /*!< (@ 0x000000DA) Control settings for the TXDAC                             */
  __IM  uint32_t  RESERVED9;
  __IOM uint16_t  RF_IFF_RESULT_REG;            /*!< (@ 0x000000E0) Not retained                                               */
  __IOM uint16_t  RF_IFF_CC_BLE_SET1_REG;       /*!< (@ 0x000000E2) Must be retained                                           */
  __IOM uint16_t  RF_IFF_CC_BLE_SET2_REG;       /*!< (@ 0x000000E4) Must be retained                                           */
  __IOM uint16_t  RF_IFF_CC_FTDF_SET1_REG;      /*!< (@ 0x000000E6) Must be retained                                           */
  __IOM uint16_t  RF_IFF_CC_FTDF_SET2_REG;      /*!< (@ 0x000000E8) Must be retained                                           */
  __IOM uint16_t  RF_IFF_CAL_CAP_STAT_REG;      /*!< (@ 0x000000EA) Current CAL_CAP value applied to IF                        */
  __IOM uint16_t  RF_MIX_CAL_CAP_STAT_REG;      /*!< (@ 0x000000EC) Current CAL_CAP value applied to IF                        */
  __IOM uint16_t  RF_LF_CAL_CAP_STAT_REG;       /*!< (@ 0x000000EE) Current CAL_CAP value applied to IF                        */
} RFCU_Type;                                    /*!< Size = 240 (0xf0)                                                         */



/* =========================================================================================================================== */
/* ================                                        RFCU_POWER                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief RFCU_POWER registers (RFCU_POWER)
  */

