S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50002200) RFCU_POWER Structure                                       */
  __IOM uint16_t  RF_ENABLE_CONFIG0_BLE_REG;    /*!< (@ 0x00000000) RF_ENABLE_CONFIG0_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG1_BLE_REG;    /*!< (@ 0x00000002) RF_ENABLE_CONFIG1_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG2_BLE_REG;    /*!< (@ 0x00000004) RF_ENABLE_CONFIG2_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG3_BLE_REG;    /*!< (@ 0x00000006) RF_ENABLE_CONFIG3_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG4_BLE_REG;    /*!< (@ 0x00000008) RF_ENABLE_CONFIG4_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG5_BLE_REG;    /*!< (@ 0x0000000A) RF_ENABLE_CONFIG5_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG6_BLE_REG;    /*!< (@ 0x0000000C) RF_ENABLE_CONFIG6_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG7_BLE_REG;    /*!< (@ 0x0000000E) RF_ENABLE_CONFIG7_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG8_BLE_REG;    /*!< (@ 0x00000010) RF_ENABLE_CONFIG8_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG9_BLE_REG;    /*!< (@ 0x00000012) RF_ENABLE_CONFIG9_BLE_REG                                  */
  __IOM uint16_t  RF_ENABLE_CONFIG10_BLE_REG;   /*!< (@ 0x00000014) RF_ENABLE_CONFIG10_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG11_BLE_REG;   /*!< (@ 0x00000016) RF_ENABLE_CONFIG11_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG12_BLE_REG;   /*!< (@ 0x00000018) RF_ENABLE_CONFIG12_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG13_BLE_REG;   /*!< (@ 0x0000001A) RF_ENABLE_CONFIG13_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG14_BLE_REG;   /*!< (@ 0x0000001C) RF_ENABLE_CONFIG14_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG15_BLE_REG;   /*!< (@ 0x0000001E) RF_ENABLE_CONFIG15_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG16_BLE_REG;   /*!< (@ 0x00000020) RF_ENABLE_CONFIG16_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG17_BLE_REG;   /*!< (@ 0x00000022) RF_ENABLE_CONFIG17_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG18_BLE_REG;   /*!< (@ 0x00000024) RF_ENABLE_CONFIG18_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG19_BLE_REG;   /*!< (@ 0x00000026) RF_ENABLE_CONFIG19_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG20_BLE_REG;   /*!< (@ 0x00000028) RF_ENABLE_CONFIG20_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG21_BLE_REG;   /*!< (@ 0x0000002A) RF_ENABLE_CONFIG21_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG22_BLE_REG;   /*!< (@ 0x0000002C) RF_ENABLE_CONFIG22_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG23_BLE_REG;   /*!< (@ 0x0000002E) RF_ENABLE_CONFIG23_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG24_BLE_REG;   /*!< (@ 0x00000030) RF_ENABLE_CONFIG24_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG25_BLE_REG;   /*!< (@ 0x00000032) RF_ENABLE_CONFIG25_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG26_BLE_REG;   /*!< (@ 0x00000034) RF_ENABLE_CONFIG26_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG27_BLE_REG;   /*!< (@ 0x00000036) RF_ENABLE_CONFIG27_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG28_BLE_REG;   /*!< (@ 0x00000038) RF_ENABLE_CONFIG28_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG29_BLE_REG;   /*!< (@ 0x0000003A) RF_ENABLE_CONFIG29_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG30_BLE_REG;   /*!< (@ 0x0000003C) RF_ENABLE_CONFIG30_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG31_BLE_REG;   /*!< (@ 0x0000003E) RF_ENABLE_CONFIG31_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG32_BLE_REG;   /*!< (@ 0x00000040) RF_ENABLE_CONFIG32_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG33_BLE_REG;   /*!< (@ 0x00000042) RF_ENABLE_CONFIG33_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG34_BLE_REG;   /*!< (@ 0x00000044) RF_ENABLE_CONFIG34_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG35_BLE_REG;   /*!< (@ 0x00000046) RF_ENABLE_CONFIG35_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG36_BLE_REG;   /*!< (@ 0x00000048) RF_ENABLE_CONFIG36_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG37_BLE_REG;   /*!< (@ 0x0000004A) RF_ENABLE_CONFIG37_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG38_BLE_REG;   /*!< (@ 0x0000004C) RF_ENABLE_CONFIG38_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG39_BLE_REG;   /*!< (@ 0x0000004E) RF_ENABLE_CONFIG39_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG40_BLE_REG;   /*!< (@ 0x00000050) RF_ENABLE_CONFIG40_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG41_BLE_REG;   /*!< (@ 0x00000052) RF_ENABLE_CONFIG41_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG42_BLE_REG;   /*!< (@ 0x00000054) RF_ENABLE_CONFIG42_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG43_BLE_REG;   /*!< (@ 0x00000056) RF_ENABLE_CONFIG43_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG44_BLE_REG;   /*!< (@ 0x00000058) RF_ENABLE_CONFIG44_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG45_BLE_REG;   /*!< (@ 0x0000005A) RF_ENABLE_CONFIG45_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG46_BLE_REG;   /*!< (@ 0x0000005C) RF_ENABLE_CONFIG46_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG47_BLE_REG;   /*!< (@ 0x0000005E) RF_ENABLE_CONFIG47_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG48_BLE_REG;   /*!< (@ 0x00000060) RF_ENABLE_CONFIG48_BLE_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG49_BLE_REG;   /*!< (@ 0x00000062) RF_ENABLE_CONFIG49_BLE_REG                                 */
  __IM  uint32_t  RESERVED[7];
  __IOM uint16_t  RF_ENABLE_CONFIG0_FTDF_REG;   /*!< (@ 0x00000080) RF_ENABLE_CONFIG0_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG1_FTDF_REG;   /*!< (@ 0x00000082) RF_ENABLE_CONFIG1_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG2_FTDF_REG;   /*!< (@ 0x00000084) RF_ENABLE_CONFIG2_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG3_FTDF_REG;   /*!< (@ 0x00000086) RF_ENABLE_CONFIG3_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG4_FTDF_REG;   /*!< (@ 0x00000088) RF_ENABLE_CONFIG4_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG5_FTDF_REG;   /*!< (@ 0x0000008A) RF_ENABLE_CONFIG5_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG6_FTDF_REG;   /*!< (@ 0x0000008C) RF_ENABLE_CONFIG6_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG7_FTDF_REG;   /*!< (@ 0x0000008E) RF_ENABLE_CONFIG7_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG8_FTDF_REG;   /*!< (@ 0x00000090) RF_ENABLE_CONFIG8_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG9_FTDF_REG;   /*!< (@ 0x00000092) RF_ENABLE_CONFIG9_FTDF_REG                                 */
  __IOM uint16_t  RF_ENABLE_CONFIG10_FTDF_REG;  /*!< (@ 0x00000094) RF_ENABLE_CONFIG10_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG11_FTDF_REG;  /*!< (@ 0x00000096) RF_ENABLE_CONFIG11_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG12_FTDF_REG;  /*!< (@ 0x00000098) RF_ENABLE_CONFIG12_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG13_FTDF_REG;  /*!< (@ 0x0000009A) RF_ENABLE_CONFIG13_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG14_FTDF_REG;  /*!< (@ 0x0000009C) RF_ENABLE_CONFIG14_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG15_FTDF_REG;  /*!< (@ 0x0000009E) RF_ENABLE_CONFIG15_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG16_FTDF_REG;  /*!< (@ 0x000000A0) RF_ENABLE_CONFIG16_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG17_FTDF_REG;  /*!< (@ 0x000000A2) RF_ENABLE_CONFIG17_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG18_FTDF_REG;  /*!< (@ 0x000000A4) RF_ENABLE_CONFIG18_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG19_FTDF_REG;  /*!< (@ 0x000000A6) RF_ENABLE_CONFIG19_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG20_FTDF_REG;  /*!< (@ 0x000000A8) RF_ENABLE_CONFIG20_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG21_FTDF_REG;  /*!< (@ 0x000000AA) RF_ENABLE_CONFIG21_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG22_FTDF_REG;  /*!< (@ 0x000000AC) RF_ENABLE_CONFIG22_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG23_FTDF_REG;  /*!< (@ 0x000000AE) RF_ENABLE_CONFIG23_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG24_FTDF_REG;  /*!< (@ 0x000000B0) RF_ENABLE_CONFIG24_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG25_FTDF_REG;  /*!< (@ 0x000000B2) RF_ENABLE_CONFIG25_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG26_FTDF_REG;  /*!< (@ 0x000000B4) RF_ENABLE_CONFIG26_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG27_FTDF_REG;  /*!< (@ 0x000000B6) RF_ENABLE_CONFIG27_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG28_FTDF_REG;  /*!< (@ 0x000000B8) RF_ENABLE_CONFIG28_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG29_FTDF_REG;  /*!< (@ 0x000000BA) RF_ENABLE_CONFIG29_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG30_FTDF_REG;  /*!< (@ 0x000000BC) RF_ENABLE_CONFIG30_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG31_FTDF_REG;  /*!< (@ 0x000000BE) RF_ENABLE_CONFIG31_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG32_FTDF_REG;  /*!< (@ 0x000000C0) RF_ENABLE_CONFIG32_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG33_FTDF_REG;  /*!< (@ 0x000000C2) RF_ENABLE_CONFIG33_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG34_FTDF_REG;  /*!< (@ 0x000000C4) RF_ENABLE_CONFIG34_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG35_FTDF_REG;  /*!< (@ 0x000000C6) RF_ENABLE_CONFIG35_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG36_FTDF_REG;  /*!< (@ 0x000000C8) RF_ENABLE_CONFIG36_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG37_FTDF_REG;  /*!< (@ 0x000000CA) RF_ENABLE_CONFIG37_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG38_FTDF_REG;  /*!< (@ 0x000000CC) RF_ENABLE_CONFIG38_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG39_FTDF_REG;  /*!< (@ 0x000000CE) RF_ENABLE_CONFIG39_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG40_FTDF_REG;  /*!< (@ 0x000000D0) RF_ENABLE_CONFIG40_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG41_FTDF_REG;  /*!< (@ 0x000000D2) RF_ENABLE_CONFIG41_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG42_FTDF_REG;  /*!< (@ 0x000000D4) RF_ENABLE_CONFIG42_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG43_FTDF_REG;  /*!< (@ 0x000000D6) RF_ENABLE_CONFIG43_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG44_FTDF_REG;  /*!< (@ 0x000000D8) RF_ENABLE_CONFIG44_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG45_FTDF_REG;  /*!< (@ 0x000000DA) RF_ENABLE_CONFIG45_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG46_FTDF_REG;  /*!< (@ 0x000000DC) RF_ENABLE_CONFIG46_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG47_FTDF_REG;  /*!< (@ 0x000000DE) RF_ENABLE_CONFIG47_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG48_FTDF_REG;  /*!< (@ 0x000000E0) RF_ENABLE_CONFIG48_FTDF_REG                                */
  __IOM uint16_t  RF_ENABLE_CONFIG49_FTDF_REG;  /*!< (@ 0x000000E2) RF_ENABLE_CONFIG49_FTDF_REG                                */
  __IM  uint16_t  RESERVED1[15];
  __IOM uint16_t  RF_CNTRL_TIMER_1_REG;         /*!< (@ 0x00000102) RF_CNTRL_TIMER_1_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_2_REG;         /*!< (@ 0x00000104) RF_CNTRL_TIMER_2_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_3_REG;         /*!< (@ 0x00000106) RF_CNTRL_TIMER_3_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_4_REG;         /*!< (@ 0x00000108) RF_CNTRL_TIMER_4_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_5_REG;         /*!< (@ 0x0000010A) RF_CNTRL_TIMER_5_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_6_REG;         /*!< (@ 0x0000010C) RF_CNTRL_TIMER_6_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_7_REG;         /*!< (@ 0x0000010E) RF_CNTRL_TIMER_7_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_8_REG;         /*!< (@ 0x00000110) RF_CNTRL_TIMER_8_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_9_REG;         /*!< (@ 0x00000112) RF_CNTRL_TIMER_9_REG                                       */
  __IOM uint16_t  RF_CNTRL_TIMER_10_REG;        /*!< (@ 0x00000114) RF_CNTRL_TIMER_10_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_11_REG;        /*!< (@ 0x00000116) RF_CNTRL_TIMER_11_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_12_REG;        /*!< (@ 0x00000118) RF_CNTRL_TIMER_12_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_13_REG;        /*!< (@ 0x0000011A) RF_CNTRL_TIMER_13_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_14_REG;        /*!< (@ 0x0000011C) RF_CNTRL_TIMER_14_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_15_REG;        /*!< (@ 0x0000011E) RF_CNTRL_TIMER_15_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_16_REG;        /*!< (@ 0x00000120) RF_CNTRL_TIMER_16_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_17_REG;        /*!< (@ 0x00000122) RF_CNTRL_TIMER_17_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_18_REG;        /*!< (@ 0x00000124) RF_CNTRL_TIMER_18_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_19_REG;        /*!< (@ 0x00000126) RF_CNTRL_TIMER_19_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_20_REG;        /*!< (@ 0x00000128) RF_CNTRL_TIMER_20_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_21_REG;        /*!< (@ 0x0000012A) RF_CNTRL_TIMER_21_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_22_REG;        /*!< (@ 0x0000012C) RF_CNTRL_TIMER_22_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_23_REG;        /*!< (@ 0x0000012E) RF_CNTRL_TIMER_23_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_24_REG;        /*!< (@ 0x00000130) RF_CNTRL_TIMER_24_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_25_REG;        /*!< (@ 0x00000132) RF_CNTRL_TIMER_25_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_26_REG;        /*!< (@ 0x00000134) RF_CNTRL_TIMER_26_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_27_REG;        /*!< (@ 0x00000136) RF_CNTRL_TIMER_27_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_28_REG;        /*!< (@ 0x00000138) RF_CNTRL_TIMER_28_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_29_REG;        /*!< (@ 0x0000013A) RF_CNTRL_TIMER_29_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_30_REG;        /*!< (@ 0x0000013C) RF_CNTRL_TIMER_30_REG                                      */
  __IOM uint16_t  RF_CNTRL_TIMER_31_REG;        /*!< (@ 0x0000013E) RF_CNTRL_TIMER_31_REG                                      */
  __IM  uint32_t  RESERVED2[16];
  __IOM uint16_t  RF_ALWAYS_EN1_REG;            /*!< (@ 0x00000180) RF_ALWAYS_EN1_REG                                          */
  __IOM uint16_t  RF_ALWAYS_EN2_REG;            /*!< (@ 0x00000182) RF_ALWAYS_EN2_REG                                          */
  __IOM uint16_t  RF_ALWAYS_EN3_REG;            /*!< (@ 0x00000184) RF_ALWAYS_EN3_REG                                          */
  __IOM uint16_t  RF_ALWAYS_EN4_REG;            /*!< (@ 0x00000186) RF_ALWAYS_EN4_REG                                          */
  __IOM uint16_t  RF_PORT_EN_REG;               /*!< (@ 0x00000188) RF_PORT_EN_REG                                             */
  __IOM uint16_t  RF_PORT_POL_REG;              /*!< (@ 0x0000018A) RF_PORT_POL_REG                                            */
} RFCU_POWER_Type;                              /*!< Size = 396 (0x18c)                                                        */



/* =========================================================================================================================== */
/* ================                                           RFPT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief RFPT registers (RFPT)
  */

typedef struct {                                /*!< (@ 0x50003600) RFPT Structure                                             */
  __IOM uint16_t  RFPT_CTRL_REG;                /*!< (@ 0x00000000) Control register                                           */
  __IOM uint16_t  RFPT_ADDRL_REG;               /*!< (@ 0x00000002) AHB master start address (Low part)                        */
  __IOM uint16_t  RFPT_ADDRH_REG;               /*!< (@ 0x00000004) AHB master start address (High part)                       */
  __IOM uint16_t  RFPT_LEN_REG;                 /*!< (@ 0x00000006) Data length register                                       */
  __IOM uint16_t  RFPT_STAT_REG;                /*!< (@ 0x00000008) Status register                                            */
  __IOM uint16_t  RFPT_CRV_ADDRL_REG;           /*!< (@ 0x0000000A) AHB master current address (Low part)                      */
  __IOM uint16_t  RFPT_CRV_ADDRH_REG;           /*!< (@ 0x0000000C) AHB master current address (High part)                     */
  __IOM uint16_t  RFPT_CRV_LEN_REG;             /*!< (@ 0x0000000E) The remaining data to be transferred                       */
} RFPT_Type;                                    /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI registers (SPI)
  */

typedef struct {                                /*!< (@ 0x50001200) SPI Structure                                              */
  __IOM uint16_t  SPI_CTRL_REG;                 /*!< (@ 0x00000000) SPI control register 0                                     */
  __IOM uint16_t  SPI_RX_TX_REG0;               /*!< (@ 0x00000002) SPI RX/TX register0                                        */
  __IOM uint16_t  SPI_RX_TX_REG1;               /*!< (@ 0x00000004) SPI RX/TX register1                                        */
  __IOM uint16_t  SPI_CLEAR_INT_REG;            /*!< (@ 0x00000006) SPI clear interrupt register                               */
  __IOM uint16_t  SPI_CTRL_REG1;                /*!< (@ 0x00000008) SPI control register 1                                     */
} SPI_Type;                                     /*!< Size = 10 (0xa)                                                           */



/* =========================================================================================================================== */
/* ================                                           SPI2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI2 registers (SPI2)
  */

typedef struct {                                /*!< (@ 0x50001300) SPI2 Structure                                             */
  __IOM uint16_t  SPI2_CTRL_REG;                /*!< (@ 0x00000000) SPI control register 0                                     */
  __IOM uint16_t  SPI2_RX_TX_REG0;              /*!< (@ 0x00000002) SPI RX/TX register0                                        */
  __IOM uint16_t  SPI2_RX_TX_REG1;              /*!< (@ 0x00000004) SPI RX/TX register1                                        */
  __IOM uint16_t  SPI2_CLEAR_INT_REG;           /*!< (@ 0x00000006) SPI clear interrupt register                               */
  __IOM uint16_t  SPI2_CTRL_REG1;               /*!< (@ 0x00000008) SPI control register 1                                     */
} SPI2_Type;                                    /*!< Size = 10 (0xa)                                                           */



/* =========================================================================================================================== */
/* ================                                          TIMER1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER1 registers (TIMER1)
  */

