S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50000200) TIMER1 Structure                                           */
  __IOM uint16_t  CAPTIM_CTRL_REG;              /*!< (@ 0x00000000) Capture Timer control register                             */
  __IOM uint16_t  CAPTIM_TIMER_VAL_REG;         /*!< (@ 0x00000002) Capture Timer counter value                                */
  __IOM uint16_t  CAPTIM_STATUS_REG;            /*!< (@ 0x00000004) Capture Timer status register                              */
  __IOM uint16_t  CAPTIM_GPIO1_CONF_REG;        /*!< (@ 0x00000006) Capture Timer gpio1 selection                              */
  __IOM uint16_t  CAPTIM_GPIO2_CONF_REG;        /*!< (@ 0x00000008) Capture Timer gpio2 selection                              */
  __IOM uint16_t  CAPTIM_RELOAD_REG;            /*!< (@ 0x0000000A) Capture Timer reload value and Delay in shot
                                                                    mode                                                       */
  __IOM uint16_t  CAPTIM_SHOTWIDTH_REG;         /*!< (@ 0x0000000C) Capture Timer Shot duration in shot mode                   */
  __IOM uint16_t  CAPTIM_PRESCALER_REG;         /*!< (@ 0x0000000E) Capture Timer prescaler value                              */
  __IOM uint16_t  CAPTIM_CAPTURE_GPIO1_REG;     /*!< (@ 0x00000010) Capture Timer value for event on GPIO1                     */
  __IOM uint16_t  CAPTIM_CAPTURE_GPIO2_REG;     /*!< (@ 0x00000012) Capture Timer value for event on GPIO2                     */
  __IOM uint16_t  CAPTIM_PRESCALER_VAL_REG;     /*!< (@ 0x00000014) Capture Timer interrupt status register                    */
  __IOM uint16_t  CAPTIM_PWM_FREQ_REG;          /*!< (@ 0x00000016) Capture Timer pwm frequency register. PWM5 period
                                                                    is defined by the reference clock frequency
                                                                    multiplied by this value.                                  */
  __IOM uint16_t  CAPTIM_PWM_DC_REG;            /*!< (@ 0x00000018) Capture Timer pwm dc register                              */
} TIMER1_Type;                                  /*!< Size = 26 (0x1a)                                                          */



/* =========================================================================================================================== */
/* ================                                           TRNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief TRNG registers (TRNG)
  */

typedef struct {                                /*!< (@ 0x50005000) TRNG Structure                                             */
  __IOM uint32_t  TRNG_CTRL_REG;                /*!< (@ 0x00000000) TRNG control register                                      */
  __IOM uint32_t  TRNG_FIFOLVL_REG;             /*!< (@ 0x00000004) TRNG FIFO level register                                   */
  __IOM uint32_t  TRNG_VER_REG;                 /*!< (@ 0x00000008) TRNG Version register                                      */
} TRNG_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief UART registers (UART)
  */

typedef struct {                                /*!< (@ 0x50001000) UART Structure                                             */
  __IOM uint16_t  UART_RBR_THR_DLL_REG;         /*!< (@ 0x00000000) Receive Buffer Register                                    */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  UART_IER_DLH_REG;             /*!< (@ 0x00000004) Interrupt Enable Register                                  */
  __IM  uint16_t  RESERVED1;
  __IOM uint16_t  UART_IIR_FCR_REG;             /*!< (@ 0x00000008) Interrupt Identification Register                          */
  __IM  uint16_t  RESERVED2;
  __IOM uint16_t  UART_LCR_REG;                 /*!< (@ 0x0000000C) Line Control Register                                      */
  __IM  uint16_t  RESERVED3;
  __IOM uint16_t  UART_MCR_REG;                 /*!< (@ 0x00000010) Modem Control Register                                     */
  __IM  uint16_t  RESERVED4;
  __IOM uint16_t  UART_LSR_REG;                 /*!< (@ 0x00000014) Line Status Register                                       */
  __IM  uint16_t  RESERVED5[3];
  __IOM uint16_t  UART_SCR_REG;                 /*!< (@ 0x0000001C) Scratchpad Register                                        */
  __IM  uint16_t  RESERVED6[47];
  __IOM uint16_t  UART_USR_REG;                 /*!< (@ 0x0000007C) UART Status register.                                      */
  __IM  uint16_t  RESERVED7[5];
  __IOM uint16_t  UART_SRR_REG;                 /*!< (@ 0x00000088) Software Reset Register.                                   */
  __IM  uint16_t  RESERVED8[3];
  __IOM uint16_t  UART_SBCR_REG;                /*!< (@ 0x00000090) Shadow Break Control Register                              */
  __IM  uint16_t  RESERVED9[11];
  __IOM uint16_t  UART_DMASA_REG;               /*!< (@ 0x000000A8) DMA Software Acknowledge                                   */
  __IM  uint16_t  RESERVED10[11];
  __IOM uint16_t  UART_DLF_REG;                 /*!< (@ 0x000000C0) Divisor Latch Fraction Register                            */
  __IM  uint16_t  RESERVED11[25];
  __IOM uint16_t  UART_CPR_REG;                 /*!< (@ 0x000000F4) Component Parameter Register                               */
  __IM  uint16_t  RESERVED12;
  __IOM uint16_t  UART_UCV_REG;                 /*!< (@ 0x000000F8) Component Version                                          */
  __IM  uint16_t  RESERVED13;
  __IOM uint16_t  UART_CTR_REG;                 /*!< (@ 0x000000FC) Component Type Register                                    */
} UART_Type;                                    /*!< Size = 254 (0xfe)                                                         */



/* =========================================================================================================================== */
/* ================                                           UART2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART2 registers (UART2)
  */

