S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
typedef struct {                                /*!< (@ 0x50001100) UART2 Structure                                            */
  __IOM uint16_t  UART2_RBR_THR_DLL_REG;        /*!< (@ 0x00000000) Receive Buffer Register                                    */
  __IM  uint16_t  RESERVED;
  __IOM uint16_t  UART2_IER_DLH_REG;            /*!< (@ 0x00000004) Interrupt Enable Register                                  */
  __IM  uint16_t  RESERVED1;
  __IOM uint16_t  UART2_IIR_FCR_REG;            /*!< (@ 0x00000008) Interrupt Identification Register/FIFO Control
                                                                    Register                                                   */
  __IM  uint16_t  RESERVED2;
  __IOM uint16_t  UART2_LCR_REG;                /*!< (@ 0x0000000C) Line Control Register                                      */
  __IM  uint16_t  RESERVED3;
  __IOM uint16_t  UART2_MCR_REG;                /*!< (@ 0x00000010) Modem Control Register                                     */
  __IM  uint16_t  RESERVED4;
  __IOM uint16_t  UART2_LSR_REG;                /*!< (@ 0x00000014) Line Status Register                                       */
  __IM  uint16_t  RESERVED5;
  __IOM uint16_t  UART2_MSR_REG;                /*!< (@ 0x00000018) Modem Status Register                                      */
  __IM  uint16_t  RESERVED6;
  __IOM uint16_t  UART2_SCR_REG;                /*!< (@ 0x0000001C) Scratchpad Register                                        */
  __IM  uint16_t  RESERVED7[9];
  __IOM uint16_t  UART2_SRBR_STHR0_REG;         /*!< (@ 0x00000030) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED8;
  __IOM uint16_t  UART2_SRBR_STHR1_REG;         /*!< (@ 0x00000034) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED9;
  __IOM uint16_t  UART2_SRBR_STHR2_REG;         /*!< (@ 0x00000038) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED10;
  __IOM uint16_t  UART2_SRBR_STHR3_REG;         /*!< (@ 0x0000003C) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED11;
  __IOM uint16_t  UART2_SRBR_STHR4_REG;         /*!< (@ 0x00000040) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED12;
  __IOM uint16_t  UART2_SRBR_STHR5_REG;         /*!< (@ 0x00000044) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED13;
  __IOM uint16_t  UART2_SRBR_STHR6_REG;         /*!< (@ 0x00000048) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED14;
  __IOM uint16_t  UART2_SRBR_STHR7_REG;         /*!< (@ 0x0000004C) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED15;
  __IOM uint16_t  UART2_SRBR_STHR8_REG;         /*!< (@ 0x00000050) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED16;
  __IOM uint16_t  UART2_SRBR_STHR9_REG;         /*!< (@ 0x00000054) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED17;
  __IOM uint16_t  UART2_SRBR_STHR10_REG;        /*!< (@ 0x00000058) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED18;
  __IOM uint16_t  UART2_SRBR_STHR11_REG;        /*!< (@ 0x0000005C) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED19;
  __IOM uint16_t  UART2_SRBR_STHR12_REG;        /*!< (@ 0x00000060) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED20;
  __IOM uint16_t  UART2_SRBR_STHR13_REG;        /*!< (@ 0x00000064) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED21;
  __IOM uint16_t  UART2_SRBR_STHR14_REG;        /*!< (@ 0x00000068) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED22;
  __IOM uint16_t  UART2_SRBR_STHR15_REG;        /*!< (@ 0x0000006C) Shadow Receive/Transmit Buffer Register                    */
  __IM  uint16_t  RESERVED23;
  __IOM uint16_t  UART2_FAR_REG;                /*!< (@ 0x00000070) FIFO Access Register                                       */
  __IM  uint16_t  RESERVED24[5];
  __IOM uint16_t  UART2_USR_REG;                /*!< (@ 0x0000007C) UART Status register.                                      */
  __IM  uint16_t  RESERVED25;
  __IOM uint16_t  UART2_TFL_REG;                /*!< (@ 0x00000080) Transmit FIFO Level                                        */
  __IM  uint16_t  RESERVED26;
  __IOM uint16_t  UART2_RFL_REG;                /*!< (@ 0x00000084) Receive FIFO Level.                                        */
  __IM  uint16_t  RESERVED27;
  __IOM uint16_t  UART2_SRR_REG;                /*!< (@ 0x00000088) Software Reset Register.                                   */
  __IM  uint16_t  RESERVED28;
  __IOM uint16_t  UART2_SRTS_REG;               /*!< (@ 0x0000008C) Shadow Request to Send                                     */
  __IM  uint16_t  RESERVED29;
  __IOM uint16_t  UART2_SBCR_REG;               /*!< (@ 0x00000090) Shadow Break Control Register                              */
  __IM  uint16_t  RESERVED30;
  __IOM uint16_t  UART2_SDMAM_REG;              /*!< (@ 0x00000094) Shadow DMA Mode                                            */
  __IM  uint16_t  RESERVED31;
  __IOM uint16_t  UART2_SFE_REG;                /*!< (@ 0x00000098) Shadow FIFO Enable                                         */
  __IM  uint16_t  RESERVED32;
  __IOM uint16_t  UART2_SRT_REG;                /*!< (@ 0x0000009C) Shadow RCVR Trigger                                        */
  __IM  uint16_t  RESERVED33;
  __IOM uint16_t  UART2_STET_REG;               /*!< (@ 0x000000A0) Shadow TX Empty Trigger                                    */
  __IM  uint16_t  RESERVED34;
  __IOM uint16_t  UART2_HTX_REG;                /*!< (@ 0x000000A4) Halt TX                                                    */
  __IM  uint16_t  RESERVED35;
  __IOM uint16_t  UART2_DMASA_REG;              /*!< (@ 0x000000A8) DMA Software Acknowledge                                   */
  __IM  uint16_t  RESERVED36[11];
  __IOM uint16_t  UART2_DLF_REG;                /*!< (@ 0x000000C0) Divisor Latch Fraction Register                            */
  __IM  uint16_t  RESERVED37[25];
  __IOM uint16_t  UART2_CPR_REG;                /*!< (@ 0x000000F4) Component Parameter Register                               */
  __IM  uint16_t  RESERVED38;
  __IOM uint16_t  UART2_UCV_REG;                /*!< (@ 0x000000F8) Component Version                                          */
  __IM  uint16_t  RESERVED39;
  __IOM uint16_t  UART2_CTR_REG;                /*!< (@ 0x000000FC) Component Type Register                                    */
} UART2_Type;                                   /*!< Size = 254 (0xfe)                                                         */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief USB registers (USB)
  */

typedef struct {                                /*!< (@ 0x50001800) USB Structure                                              */
  __IOM uint16_t  USB_MCTRL_REG;                /*!< (@ 0x00000000) Main Control Register)                                     */
  __IOM uint16_t  USB_XCVDIAG_REG;              /*!< (@ 0x00000002) Transceiver diagnostic Register (for test purpose
                                                                    only)                                                      */
  __IOM uint16_t  USB_TCR_REG;                  /*!< (@ 0x00000004) Transceiver configuration Register                         */
  __IOM uint16_t  USB_UTR_REG;                  /*!< (@ 0x00000006) USB test Register (for test purpose only)                  */
  __IOM uint16_t  USB_FAR_REG;                  /*!< (@ 0x00000008) Function Address Register                                  */
  __IOM uint16_t  USB_NFSR_REG;                 /*!< (@ 0x0000000A) Node Functional State Register                             */
  __IOM uint16_t  USB_MAEV_REG;                 /*!< (@ 0x0000000C) Main Event Register                                        */
  __IOM uint16_t  USB_MAMSK_REG;                /*!< (@ 0x0000000E) Main Mask Register                                         */
  __IOM uint16_t  USB_ALTEV_REG;                /*!< (@ 0x00000010) Alternate Event Register                                   */
  __IOM uint16_t  USB_ALTMSK_REG;               /*!< (@ 0x00000012) Alternate Mask Register                                    */
  __IOM uint16_t  USB_TXEV_REG;                 /*!< (@ 0x00000014) Transmit Event Register                                    */
  __IOM uint16_t  USB_TXMSK_REG;                /*!< (@ 0x00000016) Transmit Mask Register                                     */
  __IOM uint16_t  USB_RXEV_REG;                 /*!< (@ 0x00000018) Receive Event Register                                     */
  __IOM uint16_t  USB_RXMSK_REG;                /*!< (@ 0x0000001A) Receive Mask Register                                      */
  __IOM uint16_t  USB_NAKEV_REG;                /*!< (@ 0x0000001C) NAK Event Register                                         */
  __IOM uint16_t  USB_NAKMSK_REG;               /*!< (@ 0x0000001E) NAK Mask Register                                          */
  __IOM uint16_t  USB_FWEV_REG;                 /*!< (@ 0x00000020) FIFO Warning Event Register                                */
  __IOM uint16_t  USB_FWMSK_REG;                /*!< (@ 0x00000022) FIFO Warning Mask Register                                 */
  __IOM uint16_t  USB_FNH_REG;                  /*!< (@ 0x00000024) Frame Number High Byte Register                            */
  __IOM uint16_t  USB_FNL_REG;                  /*!< (@ 0x00000026) Frame Number Low Byte Register                             */
  __IM  uint16_t  RESERVED[11];
  __IOM uint16_t  USB_UX20CDR_REG;              /*!< (@ 0x0000003E) Transceiver 2.0 Configuration and Diagnostics
                                                                    Register(for test purpose only)                            */
  __IOM uint16_t  USB_EPC0_REG;                 /*!< (@ 0x00000040) Endpoint Control 0 Register                                */
  __IOM uint16_t  USB_TXD0_REG;                 /*!< (@ 0x00000042) Transmit Data 0 Register                                   */
  __IOM uint16_t  USB_TXS0_REG;                 /*!< (@ 0x00000044) Transmit Status 0 Register                                 */
  __IOM uint16_t  USB_TXC0_REG;                 /*!< (@ 0x00000046) Transmit command 0 Register                                */
  __IOM uint16_t  USB_EP0_NAK_REG;              /*!< (@ 0x00000048) EP0 INNAK and OUTNAK Register                              */
  __IOM uint16_t  USB_RXD0_REG;                 /*!< (@ 0x0000004A) Receive Data 0 Register                                    */
  __IOM uint16_t  USB_RXS0_REG;                 /*!< (@ 0x0000004C) Receive Status 0 Register                                  */
  __IOM uint16_t  USB_RXC0_REG;                 /*!< (@ 0x0000004E) Receive Command 0 Register                                 */
  __IOM uint16_t  USB_EPC1_REG;                 /*!< (@ 0x00000050) Endpoint Control Register 1                                */
  __IOM uint16_t  USB_TXD1_REG;                 /*!< (@ 0x00000052) Transmit Data Register 1                                   */
  __IOM uint16_t  USB_TXS1_REG;                 /*!< (@ 0x00000054) Transmit Status Register 1                                 */
  __IOM uint16_t  USB_TXC1_REG;                 /*!< (@ 0x00000056) Transmit Command Register 1                                */
  __IOM uint16_t  USB_EPC2_REG;                 /*!< (@ 0x00000058) Endpoint Control Register 2                                */
  __IOM uint16_t  USB_RXD1_REG;                 /*!< (@ 0x0000005A) Receive Data Register,1                                    */
  __IOM uint16_t  USB_RXS1_REG;                 /*!< (@ 0x0000005C) Receive Status Register 1                                  */
  __IOM uint16_t  USB_RXC1_REG;                 /*!< (@ 0x0000005E) Receive Command Register 1                                 */
  __IOM uint16_t  USB_EPC3_REG;                 /*!< (@ 0x00000060) Endpoint Control Register 3                                */
  __IOM uint16_t  USB_TXD2_REG;                 /*!< (@ 0x00000062) Transmit Data Register 2                                   */
  __IOM uint16_t  USB_TXS2_REG;                 /*!< (@ 0x00000064) Transmit Status Register 2                                 */
  __IOM uint16_t  USB_TXC2_REG;                 /*!< (@ 0x00000066) Transmit Command Register 2                                */
  __IOM uint16_t  USB_EPC4_REG;                 /*!< (@ 0x00000068) Endpoint Control Register 4                                */
  __IOM uint16_t  USB_RXD2_REG;                 /*!< (@ 0x0000006A) Receive Data Register 2                                    */
  __IOM uint16_t  USB_RXS2_REG;                 /*!< (@ 0x0000006C) Receive Status Register 2                                  */
  __IOM uint16_t  USB_RXC2_REG;                 /*!< (@ 0x0000006E) Receive Command Register 2                                 */
  __IOM uint16_t  USB_EPC5_REG;                 /*!< (@ 0x00000070) Endpoint Control Register 5                                */
  __IOM uint16_t  USB_TXD3_REG;                 /*!< (@ 0x00000072) Transmit Data Register 3                                   */
  __IOM uint16_t  USB_TXS3_REG;                 /*!< (@ 0x00000074) Transmit Status Register 3                                 */
  __IOM uint16_t  USB_TXC3_REG;                 /*!< (@ 0x00000076) Transmit Command Register 3                                */
  __IOM uint16_t  USB_EPC6_REG;                 /*!< (@ 0x00000078) Endpoint Control Register 6                                */
  __IOM uint16_t  USB_RXD3_REG;                 /*!< (@ 0x0000007A) Receive Data Register 3                                    */
  __IOM uint16_t  USB_RXS3_REG;                 /*!< (@ 0x0000007C) Receive Status Register 3                                  */
  __IOM uint16_t  USB_RXC3_REG;                 /*!< (@ 0x0000007E) Receive Command Register 3                                 */
  __IM  uint32_t  RESERVED1[20];
  __IOM uint16_t  USB_DMA_CTRL_REG;             /*!< (@ 0x000000D0) USB DMA control register                                   */
  __IM  uint16_t  RESERVED2;
  __IOM uint16_t  USB_CHARGER_CTRL_REG;         /*!< (@ 0x000000D4) USB Charger Control Register                               */
  __IOM uint16_t  USB_CHARGER_STAT_REG;         /*!< (@ 0x000000D6) USB Charger Status Register                                */
} USB_Type;                                     /*!< Size = 216 (0xd8)                                                         */



/* =========================================================================================================================== */
/* ================                                          WAKEUP                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief WAKEUP registers (WAKEUP)
  */

typedef struct {                                /*!< (@ 0x50000100) WAKEUP Structure                                           */
  __IOM uint16_t  WKUP_CTRL_REG;                /*!< (@ 0x00000000) Control register for the wakeup counter                    */
  __IOM uint16_t  WKUP_COMPARE_REG;             /*!< (@ 0x00000002) Number of events before wakeup interrupt                   */
  __IOM uint16_t  WKUP_RESET_IRQ_REG;           /*!< (@ 0x00000004) Reset wakeup interrupt                                     */
  __IOM uint16_t  WKUP_COUNTER_REG;             /*!< (@ 0x00000006) Actual number of events of the wakeup counter              */
  __IOM uint16_t  WKUP_RESET_CNTR_REG;          /*!< (@ 0x00000008) Reset the event counter                                    */
  __IOM uint16_t  WKUP_SELECT_P0_REG;           /*!< (@ 0x0000000A) select which inputs from P0 port can trigger
                                                                    wkup counter                                               */
  __IOM uint16_t  WKUP_SELECT_P1_REG;           /*!< (@ 0x0000000C) select which inputs from P1 port can trigger
                                                                    wkup counter                                               */
  __IOM uint16_t  WKUP_SELECT_P2_REG;           /*!< (@ 0x0000000E) select which inputs from P2 port can trigger
                                                                    wkup counter                                               */
  __IOM uint16_t  WKUP_SELECT_P3_REG;           /*!< (@ 0x00000010) select which inputs from P3 port can trigger
                                                                    wkup counter                                               */
  __IOM uint16_t  WKUP_SELECT_P4_REG;           /*!< (@ 0x00000012) select which inputs from P3 port can trigger
                                                                    wkup counter                                               */
  __IOM uint16_t  WKUP_POL_P0_REG;              /*!< (@ 0x00000014) select the sesitivity polarity for each P0 input           */
  __IOM uint16_t  WKUP_POL_P1_REG;              /*!< (@ 0x00000016) select the sesitivity polarity for each P1 input           */
  __IOM uint16_t  WKUP_POL_P2_REG;              /*!< (@ 0x00000018) select the sesitivity polarity for each P2 input           */
  __IOM uint16_t  WKUP_POL_P3_REG;              /*!< (@ 0x0000001A) select the sesitivity polarity for each P3 input           */
  __IOM uint16_t  WKUP_POL_P4_REG;              /*!< (@ 0x0000001C) select the sesitivity polarity for each P3 input           */
} WAKEUP_Type;                                  /*!< Size = 30 (0x1e)                                                          */



/* =========================================================================================================================== */
/* ================                                           WDOG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief WDOG registers (WDOG)
  */

typedef struct {                                /*!< (@ 0x50003100) WDOG Structure                                             */
  __IOM uint16_t  WATCHDOG_REG;                 /*!< (@ 0x00000000) Watchdog timer register.                                   */
  __IOM uint16_t  WATCHDOG_CTRL_REG;            /*!< (@ 0x00000002) Watchdog control register.                                 */
} WDOG_Type;                                    /*!< Size = 4 (0x4)                                                            */


