S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#if 0
/* =========================================================================================================================== */
/* ================                                            SCB                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CPUID  ========================================================= */
#define SCB_CPUID_REVISION_Pos            (0UL)                     /*!< SCB CPUID: REVISION (Bit 0)                           */
#define SCB_CPUID_REVISION_Msk            (0xfUL)                   /*!< SCB CPUID: REVISION (Bitfield-Mask: 0x0f)             */
#define SCB_CPUID_PARTNO_Pos              (4UL)                     /*!< SCB CPUID: PARTNO (Bit 4)                             */
#define SCB_CPUID_PARTNO_Msk              (0xfff0UL)                /*!< SCB CPUID: PARTNO (Bitfield-Mask: 0xfff)              */
#define SCB_CPUID_CONSTANT_Pos            (16UL)                    /*!< SCB CPUID: CONSTANT (Bit 16)                          */
#define SCB_CPUID_CONSTANT_Msk            (0xf0000UL)               /*!< SCB CPUID: CONSTANT (Bitfield-Mask: 0x0f)             */
#define SCB_CPUID_VARIANT_Pos             (20UL)                    /*!< SCB CPUID: VARIANT (Bit 20)                           */
#define SCB_CPUID_VARIANT_Msk             (0xf00000UL)              /*!< SCB CPUID: VARIANT (Bitfield-Mask: 0x0f)              */
#define SCB_CPUID_IMPLEMENTER_Pos         (24UL)                    /*!< SCB CPUID: IMPLEMENTER (Bit 24)                       */
#define SCB_CPUID_IMPLEMENTER_Msk         (0xff000000UL)            /*!< SCB CPUID: IMPLEMENTER (Bitfield-Mask: 0xff)          */
/* =========================================================  ICSR  ========================================================== */
#define SCB_ICSR_VECTACTIVE_Pos           (0UL)                     /*!< SCB ICSR: VECTACTIVE (Bit 0)                          */
#define SCB_ICSR_VECTACTIVE_Msk           (0x3fUL)                  /*!< SCB ICSR: VECTACTIVE (Bitfield-Mask: 0x3f)            */
#define SCB_ICSR_VECTPENDING_Pos          (12UL)                    /*!< SCB ICSR: VECTPENDING (Bit 12)                        */
#define SCB_ICSR_VECTPENDING_Msk          (0x3f000UL)               /*!< SCB ICSR: VECTPENDING (Bitfield-Mask: 0x3f)           */
#define SCB_ICSR_ISRPENDING_Pos           (22UL)                    /*!< SCB ICSR: ISRPENDING (Bit 22)                         */
#define SCB_ICSR_ISRPENDING_Msk           (0x400000UL)              /*!< SCB ICSR: ISRPENDING (Bitfield-Mask: 0x01)            */
#define SCB_ICSR_PENDSTCLR_Pos            (25UL)                    /*!< SCB ICSR: PENDSTCLR (Bit 25)                          */
#define SCB_ICSR_PENDSTCLR_Msk            (0x2000000UL)             /*!< SCB ICSR: PENDSTCLR (Bitfield-Mask: 0x01)             */
#define SCB_ICSR_PENDSTSET_Pos            (26UL)                    /*!< SCB ICSR: PENDSTSET (Bit 26)                          */
#define SCB_ICSR_PENDSTSET_Msk            (0x4000000UL)             /*!< SCB ICSR: PENDSTSET (Bitfield-Mask: 0x01)             */
#define SCB_ICSR_PENDSVCLR_Pos            (27UL)                    /*!< SCB ICSR: PENDSVCLR (Bit 27)                          */
#define SCB_ICSR_PENDSVCLR_Msk            (0x8000000UL)             /*!< SCB ICSR: PENDSVCLR (Bitfield-Mask: 0x01)             */
#define SCB_ICSR_PENDSVSET_Pos            (28UL)                    /*!< SCB ICSR: PENDSVSET (Bit 28)                          */
#define SCB_ICSR_PENDSVSET_Msk            (0x10000000UL)            /*!< SCB ICSR: PENDSVSET (Bitfield-Mask: 0x01)             */
#define SCB_ICSR_NMIPENDSET_Pos           (31UL)                    /*!< SCB ICSR: NMIPENDSET (Bit 31)                         */
#define SCB_ICSR_NMIPENDSET_Msk           (0x80000000UL)            /*!< SCB ICSR: NMIPENDSET (Bitfield-Mask: 0x01)            */
/* =========================================================  AIRCR  ========================================================= */
#define SCB_AIRCR_VECTRESET_Pos           (0UL)                     /*!< SCB AIRCR: VECTRESET (Bit 0)                          */
#define SCB_AIRCR_VECTRESET_Msk           (0x1UL)                   /*!< SCB AIRCR: VECTRESET (Bitfield-Mask: 0x01)            */
#define SCB_AIRCR_VECTCLRACTIVE_Pos       (1UL)                     /*!< SCB AIRCR: VECTCLRACTIVE (Bit 1)                      */
#define SCB_AIRCR_VECTCLRACTIVE_Msk       (0x2UL)                   /*!< SCB AIRCR: VECTCLRACTIVE (Bitfield-Mask: 0x01)        */
#define SCB_AIRCR_SYSRESETREQ_Pos         (2UL)                     /*!< SCB AIRCR: SYSRESETREQ (Bit 2)                        */
#define SCB_AIRCR_SYSRESETREQ_Msk         (0x4UL)                   /*!< SCB AIRCR: SYSRESETREQ (Bitfield-Mask: 0x01)          */
#define SCB_AIRCR_ENDIANESS_Pos           (15UL)                    /*!< SCB AIRCR: ENDIANESS (Bit 15)                         */
#define SCB_AIRCR_ENDIANESS_Msk           (0x8000UL)                /*!< SCB AIRCR: ENDIANESS (Bitfield-Mask: 0x01)            */
#define SCB_AIRCR_VECTKEY_Pos             (16UL)                    /*!< SCB AIRCR: VECTKEY (Bit 16)                           */
#define SCB_AIRCR_VECTKEY_Msk             (0xffff0000UL)            /*!< SCB AIRCR: VECTKEY (Bitfield-Mask: 0xffff)            */
/* ==========================================================  SCR  ========================================================== */
#define SCB_SCR_SLEEPONEXIT_Pos           (1UL)                     /*!< SCB SCR: SLEEPONEXIT (Bit 1)                          */
#define SCB_SCR_SLEEPONEXIT_Msk           (0x2UL)                   /*!< SCB SCR: SLEEPONEXIT (Bitfield-Mask: 0x01)            */
#define SCB_SCR_SLEEPDEEP_Pos             (2UL)                     /*!< SCB SCR: SLEEPDEEP (Bit 2)                            */
#define SCB_SCR_SLEEPDEEP_Msk             (0x4UL)                   /*!< SCB SCR: SLEEPDEEP (Bitfield-Mask: 0x01)              */
#define SCB_SCR_SEVEONPEND_Pos            (4UL)                     /*!< SCB SCR: SEVEONPEND (Bit 4)                           */
#define SCB_SCR_SEVEONPEND_Msk            (0x10UL)                  /*!< SCB SCR: SEVEONPEND (Bitfield-Mask: 0x01)             */
/* ==========================================================  CCR  ========================================================== */
#define SCB_CCR_UNALIGN_TRP_Pos           (3UL)                     /*!< SCB CCR: UNALIGN_TRP (Bit 3)                          */
#define SCB_CCR_UNALIGN_TRP_Msk           (0x8UL)                   /*!< SCB CCR: UNALIGN_TRP (Bitfield-Mask: 0x01)            */
#define SCB_CCR_STKALIGN_Pos              (9UL)                     /*!< SCB CCR: STKALIGN (Bit 9)                             */
#define SCB_CCR_STKALIGN_Msk              (0x200UL)                 /*!< SCB CCR: STKALIGN (Bitfield-Mask: 0x01)               */
/* =========================================================  SHPR2  ========================================================= */
#define SCB_SHPR2_PRI_11_Pos              (24UL)                    /*!< SCB SHPR2: PRI_11 (Bit 24)                            */
#define SCB_SHPR2_PRI_11_Msk              (0xff000000UL)            /*!< SCB SHPR2: PRI_11 (Bitfield-Mask: 0xff)               */
/* =========================================================  SHPR3  ========================================================= */
#define SCB_SHPR3_PRI_14_Pos              (16UL)                    /*!< SCB SHPR3: PRI_14 (Bit 16)                            */
#define SCB_SHPR3_PRI_14_Msk              (0xff0000UL)              /*!< SCB SHPR3: PRI_14 (Bitfield-Mask: 0xff)               */
#define SCB_SHPR3_PRI_15_Pos              (24UL)                    /*!< SCB SHPR3: PRI_15 (Bit 24)                            */
#define SCB_SHPR3_PRI_15_Msk              (0xff000000UL)            /*!< SCB SHPR3: PRI_15 (Bitfield-Mask: 0xff)               */
#endif



