S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* =====================================================  ANA_TEST_REG  ====================================================== */
#define ANAMISC_ANA_TEST_REG_ACORE_TESTBUS_EN_Pos (4UL)             /*!< ANAMISC ANA_TEST_REG: ACORE_TESTBUS_EN (Bit 4)        */
#define ANAMISC_ANA_TEST_REG_ACORE_TESTBUS_EN_Msk (0x10UL)          /*!< ANAMISC ANA_TEST_REG: ACORE_TESTBUS_EN (Bitfield-Mask: 0x01) */
#define ANAMISC_ANA_TEST_REG_TEST_STRUCTURE_Pos (0UL)               /*!< ANAMISC ANA_TEST_REG: TEST_STRUCTURE (Bit 0)          */
#define ANAMISC_ANA_TEST_REG_TEST_STRUCTURE_Msk (0xfUL)             /*!< ANAMISC ANA_TEST_REG: TEST_STRUCTURE (Bitfield-Mask: 0x0f) */
/* ===================================================  CHARGER_CTRL1_REG  =================================================== */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_DISABLE_Pos (14UL)       /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_DISABLE (Bit 14)  */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_DISABLE_Msk (0x4000UL)   /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_DISABLE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_SET_Pos (12UL)           /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_SET (Bit 12)      */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_SET_Msk (0x3000UL)       /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_SET (Bitfield-Mask: 0x03) */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_CUR_Pos (8UL)              /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_CUR (Bit 8)         */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_CUR_Msk (0xf00UL)          /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_CUR (Bitfield-Mask: 0x0f) */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_LOW_DISABLE_Pos (7UL)         /*!< ANAMISC CHARGER_CTRL1_REG: NTC_LOW_DISABLE (Bit 7)    */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_LOW_DISABLE_Msk (0x80UL)      /*!< ANAMISC CHARGER_CTRL1_REG: NTC_LOW_DISABLE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_DISABLE_Pos (6UL)             /*!< ANAMISC CHARGER_CTRL1_REG: NTC_DISABLE (Bit 6)        */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_DISABLE_Msk (0x40UL)          /*!< ANAMISC CHARGER_CTRL1_REG: NTC_DISABLE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_ON_Pos (5UL)               /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_ON (Bit 5)          */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_ON_Msk (0x20UL)            /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_ON (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_LEVEL_Pos (0UL)            /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_LEVEL (Bit 0)       */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_LEVEL_Msk (0x1fUL)         /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_LEVEL (Bitfield-Mask: 0x1f) */
/* ===================================================  CHARGER_CTRL2_REG  =================================================== */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_TEST_Pos (13UL)           /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_TEST (Bit 13)      */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_TEST_Msk (0xe000UL)       /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_TEST (Bitfield-Mask: 0x07) */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_OFFSET_TRIM_Pos (8UL)     /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_OFFSET_TRIM (Bit 8) */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_OFFSET_TRIM_Msk (0x1f00UL) /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_OFFSET_TRIM (Bitfield-Mask: 0x1f) */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_VFLOAT_ADJ_Pos (4UL)      /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_VFLOAT_ADJ (Bit 4) */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_VFLOAT_ADJ_Msk (0xf0UL)   /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_VFLOAT_ADJ (Bitfield-Mask: 0x0f) */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_GAIN_TRIM_Pos (0UL)       /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_GAIN_TRIM (Bit 0)  */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_GAIN_TRIM_Msk (0xfUL)     /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_GAIN_TRIM (Bitfield-Mask: 0x0f) */
/* ==================================================  CHARGER_STATUS_REG  =================================================== */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_TMODE_PROT_Pos (6UL)     /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_TMODE_PROT (Bit 6) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_TMODE_PROT_Msk (0x40UL)  /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_TMODE_PROT (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_HIGH_Pos (5UL)   /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_HIGH (Bit 5) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_HIGH_Msk (0x20UL) /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_HIGH (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_OK_Pos (4UL)     /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_OK (Bit 4) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_OK_Msk (0x10UL)  /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_OK (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_LOW_Pos (3UL)    /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_LOW (Bit 3) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_BATTEMP_LOW_Msk (0x8UL)  /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_BATTEMP_LOW (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_END_OF_CHARGE_Pos (2UL)          /*!< ANAMISC CHARGER_STATUS_REG: END_OF_CHARGE (Bit 2)     */
#define ANAMISC_CHARGER_STATUS_REG_END_OF_CHARGE_Msk (0x4UL)        /*!< ANAMISC CHARGER_STATUS_REG: END_OF_CHARGE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CV_MODE_Pos (1UL)        /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CV_MODE (Bit 1)   */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CV_MODE_Msk (0x2UL)      /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CV_MODE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CC_MODE_Pos (0UL)        /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CC_MODE (Bit 0)   */
#define ANAMISC_CHARGER_STATUS_REG_CHARGER_CC_MODE_Msk (0x1UL)      /*!< ANAMISC CHARGER_STATUS_REG: CHARGER_CC_MODE (Bitfield-Mask: 0x01) */
/* ====================================================  CLK_REF_CNT_REG  ==================================================== */
#define ANAMISC_CLK_REF_CNT_REG_REF_CNT_VAL_Pos (0UL)               /*!< ANAMISC CLK_REF_CNT_REG: REF_CNT_VAL (Bit 0)          */
#define ANAMISC_CLK_REF_CNT_REG_REF_CNT_VAL_Msk (0xffffUL)          /*!< ANAMISC CLK_REF_CNT_REG: REF_CNT_VAL (Bitfield-Mask: 0xffff) */
/* ====================================================  CLK_REF_SEL_REG  ==================================================== */
#define ANAMISC_CLK_REF_SEL_REG_REF_CAL_START_Pos (2UL)             /*!< ANAMISC CLK_REF_SEL_REG: REF_CAL_START (Bit 2)        */
#define ANAMISC_CLK_REF_SEL_REG_REF_CAL_START_Msk (0x4UL)           /*!< ANAMISC CLK_REF_SEL_REG: REF_CAL_START (Bitfield-Mask: 0x01) */
#define ANAMISC_CLK_REF_SEL_REG_REF_CLK_SEL_Pos (0UL)               /*!< ANAMISC CLK_REF_SEL_REG: REF_CLK_SEL (Bit 0)          */
#define ANAMISC_CLK_REF_SEL_REG_REF_CLK_SEL_Msk (0x3UL)             /*!< ANAMISC CLK_REF_SEL_REG: REF_CLK_SEL (Bitfield-Mask: 0x03) */
/* ===================================================  CLK_REF_VAL_H_REG  =================================================== */
#define ANAMISC_CLK_REF_VAL_H_REG_XTAL_CNT_VAL_Pos (0UL)            /*!< ANAMISC CLK_REF_VAL_H_REG: XTAL_CNT_VAL (Bit 0)       */
#define ANAMISC_CLK_REF_VAL_H_REG_XTAL_CNT_VAL_Msk (0xffffUL)       /*!< ANAMISC CLK_REF_VAL_H_REG: XTAL_CNT_VAL (Bitfield-Mask: 0xffff) */
/* ===================================================  CLK_REF_VAL_L_REG  =================================================== */
#define ANAMISC_CLK_REF_VAL_L_REG_XTAL_CNT_VAL_Pos (0UL)            /*!< ANAMISC CLK_REF_VAL_L_REG: XTAL_CNT_VAL (Bit 0)       */
#define ANAMISC_CLK_REF_VAL_L_REG_XTAL_CNT_VAL_Msk (0xffffUL)       /*!< ANAMISC CLK_REF_VAL_L_REG: XTAL_CNT_VAL (Bitfield-Mask: 0xffff) */
/* ====================================================  SOC_ADD2CH_REG  ===================================================== */
#define ANAMISC_SOC_ADD2CH_REG_SOC_ADD2CH_Pos (0UL)                 /*!< ANAMISC SOC_ADD2CH_REG: SOC_ADD2CH (Bit 0)            */
#define ANAMISC_SOC_ADD2CH_REG_SOC_ADD2CH_Msk (0xffffUL)            /*!< ANAMISC SOC_ADD2CH_REG: SOC_ADD2CH (Bitfield-Mask: 0xffff) */
/* ==================================================  SOC_CHARGE_AVG_REG  =================================================== */
#define ANAMISC_SOC_CHARGE_AVG_REG_CHARGE_AVG_Pos (0UL)             /*!< ANAMISC SOC_CHARGE_AVG_REG: CHARGE_AVG (Bit 0)        */
#define ANAMISC_SOC_CHARGE_AVG_REG_CHARGE_AVG_Msk (0xffffUL)        /*!< ANAMISC SOC_CHARGE_AVG_REG: CHARGE_AVG (Bitfield-Mask: 0xffff) */
/* =================================================  SOC_CHARGE_CNTR1_REG  ================================================== */
#define ANAMISC_SOC_CHARGE_CNTR1_REG_CHARGE_CNT1_Pos (0UL)          /*!< ANAMISC SOC_CHARGE_CNTR1_REG: CHARGE_CNT1 (Bit 0)     */
#define ANAMISC_SOC_CHARGE_CNTR1_REG_CHARGE_CNT1_Msk (0xffffUL)     /*!< ANAMISC SOC_CHARGE_CNTR1_REG: CHARGE_CNT1 (Bitfield-Mask: 0xffff) */
/* =================================================  SOC_CHARGE_CNTR2_REG  ================================================== */
#define ANAMISC_SOC_CHARGE_CNTR2_REG_CHARGE_CNT2_Pos (0UL)          /*!< ANAMISC SOC_CHARGE_CNTR2_REG: CHARGE_CNT2 (Bit 0)     */
#define ANAMISC_SOC_CHARGE_CNTR2_REG_CHARGE_CNT2_Msk (0xffffUL)     /*!< ANAMISC SOC_CHARGE_CNTR2_REG: CHARGE_CNT2 (Bitfield-Mask: 0xffff) */
/* =================================================  SOC_CHARGE_CNTR3_REG  ================================================== */
#define ANAMISC_SOC_CHARGE_CNTR3_REG_CHARGE_CNT3_Pos (0UL)          /*!< ANAMISC SOC_CHARGE_CNTR3_REG: CHARGE_CNT3 (Bit 0)     */
#define ANAMISC_SOC_CHARGE_CNTR3_REG_CHARGE_CNT3_Msk (0xffUL)       /*!< ANAMISC SOC_CHARGE_CNTR3_REG: CHARGE_CNT3 (Bitfield-Mask: 0xff) */
/* =====================================================  SOC_CTRL1_REG  ===================================================== */
#define ANAMISC_SOC_CTRL1_REG_SOC_CINT_Pos (14UL)                   /*!< ANAMISC SOC_CTRL1_REG: SOC_CINT (Bit 14)              */
#define ANAMISC_SOC_CTRL1_REG_SOC_CINT_Msk (0xc000UL)               /*!< ANAMISC SOC_CTRL1_REG: SOC_CINT (Bitfield-Mask: 0x03) */
#define ANAMISC_SOC_CTRL1_REG_SOC_BIAS_Pos (12UL)                   /*!< ANAMISC SOC_CTRL1_REG: SOC_BIAS (Bit 12)              */
#define ANAMISC_SOC_CTRL1_REG_SOC_BIAS_Msk (0x3000UL)               /*!< ANAMISC SOC_CTRL1_REG: SOC_BIAS (Bitfield-Mask: 0x03) */
#define ANAMISC_SOC_CTRL1_REG_SOC_CLK_Pos (9UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_CLK (Bit 9)                */
#define ANAMISC_SOC_CTRL1_REG_SOC_CLK_Msk (0xe00UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_CLK (Bitfield-Mask: 0x07)  */
#define ANAMISC_SOC_CTRL1_REG_SOC_LPF_Pos (8UL)                     /*!< ANAMISC SOC_CTRL1_REG: SOC_LPF (Bit 8)                */
#define ANAMISC_SOC_CTRL1_REG_SOC_LPF_Msk (0x100UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_LPF (Bitfield-Mask: 0x01)  */
#define ANAMISC_SOC_CTRL1_REG_SOC_IDAC_Pos (6UL)                    /*!< ANAMISC SOC_CTRL1_REG: SOC_IDAC (Bit 6)               */
#define ANAMISC_SOC_CTRL1_REG_SOC_IDAC_Msk (0xc0UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_IDAC (Bitfield-Mask: 0x03) */
#define ANAMISC_SOC_CTRL1_REG_SOC_SIGN_Pos (5UL)                    /*!< ANAMISC SOC_CTRL1_REG: SOC_SIGN (Bit 5)               */
#define ANAMISC_SOC_CTRL1_REG_SOC_SIGN_Msk (0x20UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_SIGN (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL1_REG_SOC_GPIO_Pos (4UL)                    /*!< ANAMISC SOC_CTRL1_REG: SOC_GPIO (Bit 4)               */
#define ANAMISC_SOC_CTRL1_REG_SOC_GPIO_Msk (0x10UL)                 /*!< ANAMISC SOC_CTRL1_REG: SOC_GPIO (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL1_REG_SOC_MUTE_Pos (3UL)                    /*!< ANAMISC SOC_CTRL1_REG: SOC_MUTE (Bit 3)               */
#define ANAMISC_SOC_CTRL1_REG_SOC_MUTE_Msk (0x8UL)                  /*!< ANAMISC SOC_CTRL1_REG: SOC_MUTE (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_AVG_Pos (2UL)               /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_AVG (Bit 2)          */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_AVG_Msk (0x4UL)             /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_AVG (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_CHARGE_Pos (1UL)            /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_CHARGE (Bit 1)       */
#define ANAMISC_SOC_CTRL1_REG_SOC_RESET_CHARGE_Msk (0x2UL)          /*!< ANAMISC SOC_CTRL1_REG: SOC_RESET_CHARGE (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL1_REG_SOC_ENABLE_Pos (0UL)                  /*!< ANAMISC SOC_CTRL1_REG: SOC_ENABLE (Bit 0)             */
#define ANAMISC_SOC_CTRL1_REG_SOC_ENABLE_Msk (0x1UL)                /*!< ANAMISC SOC_CTRL1_REG: SOC_ENABLE (Bitfield-Mask: 0x01) */
/* =====================================================  SOC_CTRL2_REG  ===================================================== */
#define ANAMISC_SOC_CTRL2_REG_SOC_DYNAVG_Pos (15UL)                 /*!< ANAMISC SOC_CTRL2_REG: SOC_DYNAVG (Bit 15)            */
#define ANAMISC_SOC_CTRL2_REG_SOC_DYNAVG_Msk (0x8000UL)             /*!< ANAMISC SOC_CTRL2_REG: SOC_DYNAVG (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL2_REG_SOC_MAW_Pos (12UL)                    /*!< ANAMISC SOC_CTRL2_REG: SOC_MAW (Bit 12)               */
#define ANAMISC_SOC_CTRL2_REG_SOC_MAW_Msk (0x7000UL)                /*!< ANAMISC SOC_CTRL2_REG: SOC_MAW (Bitfield-Mask: 0x07)  */
#define ANAMISC_SOC_CTRL2_REG_SOC_CMIREG_ENABLE_Pos (11UL)          /*!< ANAMISC SOC_CTRL2_REG: SOC_CMIREG_ENABLE (Bit 11)     */
#define ANAMISC_SOC_CTRL2_REG_SOC_CMIREG_ENABLE_Msk (0x800UL)       /*!< ANAMISC SOC_CTRL2_REG: SOC_CMIREG_ENABLE (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL2_REG_SOC_CHOP_Pos (8UL)                    /*!< ANAMISC SOC_CTRL2_REG: SOC_CHOP (Bit 8)               */
#define ANAMISC_SOC_CTRL2_REG_SOC_CHOP_Msk (0x700UL)                /*!< ANAMISC SOC_CTRL2_REG: SOC_CHOP (Bitfield-Mask: 0x07) */
#define ANAMISC_SOC_CTRL2_REG_SOC_ICM_Pos (6UL)                     /*!< ANAMISC SOC_CTRL2_REG: SOC_ICM (Bit 6)                */
#define ANAMISC_SOC_CTRL2_REG_SOC_ICM_Msk (0xc0UL)                  /*!< ANAMISC SOC_CTRL2_REG: SOC_ICM (Bitfield-Mask: 0x03)  */
#define ANAMISC_SOC_CTRL2_REG_SOC_DCYCLE_Pos (5UL)                  /*!< ANAMISC SOC_CTRL2_REG: SOC_DCYCLE (Bit 5)             */
#define ANAMISC_SOC_CTRL2_REG_SOC_DCYCLE_Msk (0x20UL)               /*!< ANAMISC SOC_CTRL2_REG: SOC_DCYCLE (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL2_REG_SOC_SCYCLE_Pos (2UL)                  /*!< ANAMISC SOC_CTRL2_REG: SOC_SCYCLE (Bit 2)             */
#define ANAMISC_SOC_CTRL2_REG_SOC_SCYCLE_Msk (0x1cUL)               /*!< ANAMISC SOC_CTRL2_REG: SOC_SCYCLE (Bitfield-Mask: 0x07) */
#define ANAMISC_SOC_CTRL2_REG_SOC_RVI_Pos (0UL)                     /*!< ANAMISC SOC_CTRL2_REG: SOC_RVI (Bit 0)                */
#define ANAMISC_SOC_CTRL2_REG_SOC_RVI_Msk (0x3UL)                   /*!< ANAMISC SOC_CTRL2_REG: SOC_RVI (Bitfield-Mask: 0x03)  */
/* =====================================================  SOC_CTRL3_REG  ===================================================== */
#define ANAMISC_SOC_CTRL3_REG_SOC_VCMI_Pos (4UL)                    /*!< ANAMISC SOC_CTRL3_REG: SOC_VCMI (Bit 4)               */
#define ANAMISC_SOC_CTRL3_REG_SOC_VCMI_Msk (0x30UL)                 /*!< ANAMISC SOC_CTRL3_REG: SOC_VCMI (Bitfield-Mask: 0x03) */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNHYS_Pos (3UL)                  /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNHYS (Bit 3)             */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNHYS_Msk (0x8UL)                /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNHYS (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNTARG_Pos (2UL)                 /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNTARG (Bit 2)            */
#define ANAMISC_SOC_CTRL3_REG_SOC_DYNTARG_Msk (0x4UL)               /*!< ANAMISC SOC_CTRL3_REG: SOC_DYNTARG (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_CTRL3_REG_SOC_VSAT_Pos (0UL)                    /*!< ANAMISC SOC_CTRL3_REG: SOC_VSAT (Bit 0)               */
#define ANAMISC_SOC_CTRL3_REG_SOC_VSAT_Msk (0x3UL)                  /*!< ANAMISC SOC_CTRL3_REG: SOC_VSAT (Bitfield-Mask: 0x03) */
/* ====================================================  SOC_EXT_IN_REG  ===================================================== */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_IDAC_EN_Pos (15UL)           /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_IDAC_EN (Bit 15)      */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_IDAC_EN_Msk (0x8000UL)       /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_IDAC_EN (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_SCYCLE_EN_Pos (14UL)         /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_SCYCLE_EN (Bit 14)    */
#define ANAMISC_SOC_EXT_IN_REG_SOC_EXT_SCYCLE_EN_Msk (0x4000UL)     /*!< ANAMISC SOC_EXT_IN_REG: SOC_EXT_SCYCLE_EN (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_NR_SCYCLE_Pos (11UL)             /*!< ANAMISC SOC_EXT_IN_REG: SOC_NR_SCYCLE (Bit 11)        */
#define ANAMISC_SOC_EXT_IN_REG_SOC_NR_SCYCLE_Msk (0x3800UL)         /*!< ANAMISC SOC_EXT_IN_REG: SOC_NR_SCYCLE (Bitfield-Mask: 0x07) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_RDAC_DIS_Pos (10UL)              /*!< ANAMISC SOC_EXT_IN_REG: SOC_RDAC_DIS (Bit 10)         */
#define ANAMISC_SOC_EXT_IN_REG_SOC_RDAC_DIS_Msk (0x400UL)           /*!< ANAMISC SOC_EXT_IN_REG: SOC_RDAC_DIS (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_SIGN_Pos (9UL)              /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_SIGN (Bit 9)         */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_SIGN_Msk (0x200UL)          /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_SIGN (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_VAL_Pos (0UL)               /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_VAL (Bit 0)          */
#define ANAMISC_SOC_EXT_IN_REG_SOC_IDAC_VAL_Msk (0x1ffUL)           /*!< ANAMISC SOC_EXT_IN_REG: SOC_IDAC_VAL (Bitfield-Mask: 0x1ff) */
/* ====================================================  SOC_EXT_OUT_REG  ==================================================== */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_CTRL_EVENT_Pos (8UL)            /*!< ANAMISC SOC_EXT_OUT_REG: SOC_CTRL_EVENT (Bit 8)       */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_CTRL_EVENT_Msk (0x100UL)        /*!< ANAMISC SOC_EXT_OUT_REG: SOC_CTRL_EVENT (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_STATE_Pos (4UL)                 /*!< ANAMISC SOC_EXT_OUT_REG: SOC_STATE (Bit 4)            */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_STATE_Msk (0xf0UL)              /*!< ANAMISC SOC_EXT_OUT_REG: SOC_STATE (Bitfield-Mask: 0x0f) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_RISING_COMP_Pos (3UL)           /*!< ANAMISC SOC_EXT_OUT_REG: SOC_RISING_COMP (Bit 3)      */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_RISING_COMP_Msk (0x8UL)         /*!< ANAMISC SOC_EXT_OUT_REG: SOC_RISING_COMP (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_POS_COMP_Pos (2UL)              /*!< ANAMISC SOC_EXT_OUT_REG: SOC_POS_COMP (Bit 2)         */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_POS_COMP_Msk (0x4UL)            /*!< ANAMISC SOC_EXT_OUT_REG: SOC_POS_COMP (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_LOWLIM_COMP_Pos (1UL)           /*!< ANAMISC SOC_EXT_OUT_REG: SOC_LOWLIM_COMP (Bit 1)      */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_LOWLIM_COMP_Msk (0x2UL)         /*!< ANAMISC SOC_EXT_OUT_REG: SOC_LOWLIM_COMP (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_HIGH_LIM_Pos (0UL)              /*!< ANAMISC SOC_EXT_OUT_REG: SOC_HIGH_LIM (Bit 0)         */
#define ANAMISC_SOC_EXT_OUT_REG_SOC_HIGH_LIM_Msk (0x1UL)            /*!< ANAMISC SOC_EXT_OUT_REG: SOC_HIGH_LIM (Bitfield-Mask: 0x01) */
/* ====================================================  SOC_STATUS_REG  ===================================================== */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_LOCKED_Pos (1UL)             /*!< ANAMISC SOC_STATUS_REG: SOC_INT_LOCKED (Bit 1)        */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_LOCKED_Msk (0x2UL)           /*!< ANAMISC SOC_STATUS_REG: SOC_INT_LOCKED (Bitfield-Mask: 0x01) */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_OVERLOAD_Pos (0UL)           /*!< ANAMISC SOC_STATUS_REG: SOC_INT_OVERLOAD (Bit 0)      */
#define ANAMISC_SOC_STATUS_REG_SOC_INT_OVERLOAD_Msk (0x1UL)         /*!< ANAMISC SOC_STATUS_REG: SOC_INT_OVERLOAD (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                            APU                                            ================ */
/* =========================================================================================================================== */

