S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ======================================================  APU_MUX_REG  ====================================================== */
#define APU_APU_MUX_REG_PDM1_MUX_IN_Pos   (6UL)                     /*!< APU APU_MUX_REG: PDM1_MUX_IN (Bit 6)                  */
#define APU_APU_MUX_REG_PDM1_MUX_IN_Msk   (0x40UL)                  /*!< APU APU_MUX_REG: PDM1_MUX_IN (Bitfield-Mask: 0x01)    */
#define APU_APU_MUX_REG_PCM1_MUX_IN_Pos   (3UL)                     /*!< APU APU_MUX_REG: PCM1_MUX_IN (Bit 3)                  */
#define APU_APU_MUX_REG_PCM1_MUX_IN_Msk   (0x38UL)                  /*!< APU APU_MUX_REG: PCM1_MUX_IN (Bitfield-Mask: 0x07)    */
#define APU_APU_MUX_REG_SRC1_MUX_IN_Pos   (0UL)                     /*!< APU APU_MUX_REG: SRC1_MUX_IN (Bit 0)                  */
#define APU_APU_MUX_REG_SRC1_MUX_IN_Msk   (0x7UL)                   /*!< APU APU_MUX_REG: SRC1_MUX_IN (Bitfield-Mask: 0x07)    */
/* ====================================================  COEF0A_SET1_REG  ==================================================== */
#define APU_COEF0A_SET1_REG_SRC_COEF10_Pos (0UL)                    /*!< APU COEF0A_SET1_REG: SRC_COEF10 (Bit 0)               */
#define APU_COEF0A_SET1_REG_SRC_COEF10_Msk (0xffffUL)               /*!< APU COEF0A_SET1_REG: SRC_COEF10 (Bitfield-Mask: 0xffff) */
/* ====================================================  COEF10_SET1_REG  ==================================================== */
#define APU_COEF10_SET1_REG_SRC_COEF1_Pos (16UL)                    /*!< APU COEF10_SET1_REG: SRC_COEF1 (Bit 16)               */
#define APU_COEF10_SET1_REG_SRC_COEF1_Msk (0xffff0000UL)            /*!< APU COEF10_SET1_REG: SRC_COEF1 (Bitfield-Mask: 0xffff) */
#define APU_COEF10_SET1_REG_SRC_COEF0_Pos (0UL)                     /*!< APU COEF10_SET1_REG: SRC_COEF0 (Bit 0)                */
#define APU_COEF10_SET1_REG_SRC_COEF0_Msk (0xffffUL)                /*!< APU COEF10_SET1_REG: SRC_COEF0 (Bitfield-Mask: 0xffff) */
/* ====================================================  COEF32_SET1_REG  ==================================================== */
#define APU_COEF32_SET1_REG_SRC_COEF3_Pos (16UL)                    /*!< APU COEF32_SET1_REG: SRC_COEF3 (Bit 16)               */
#define APU_COEF32_SET1_REG_SRC_COEF3_Msk (0xffff0000UL)            /*!< APU COEF32_SET1_REG: SRC_COEF3 (Bitfield-Mask: 0xffff) */
#define APU_COEF32_SET1_REG_SRC_COEF2_Pos (0UL)                     /*!< APU COEF32_SET1_REG: SRC_COEF2 (Bit 0)                */
#define APU_COEF32_SET1_REG_SRC_COEF2_Msk (0xffffUL)                /*!< APU COEF32_SET1_REG: SRC_COEF2 (Bitfield-Mask: 0xffff) */
/* ====================================================  COEF54_SET1_REG  ==================================================== */
#define APU_COEF54_SET1_REG_SRC_COEF5_Pos (16UL)                    /*!< APU COEF54_SET1_REG: SRC_COEF5 (Bit 16)               */
#define APU_COEF54_SET1_REG_SRC_COEF5_Msk (0xffff0000UL)            /*!< APU COEF54_SET1_REG: SRC_COEF5 (Bitfield-Mask: 0xffff) */
#define APU_COEF54_SET1_REG_SRC_COEF4_Pos (0UL)                     /*!< APU COEF54_SET1_REG: SRC_COEF4 (Bit 0)                */
#define APU_COEF54_SET1_REG_SRC_COEF4_Msk (0xffffUL)                /*!< APU COEF54_SET1_REG: SRC_COEF4 (Bitfield-Mask: 0xffff) */
/* ====================================================  COEF76_SET1_REG  ==================================================== */
#define APU_COEF76_SET1_REG_SRC_COEF7_Pos (16UL)                    /*!< APU COEF76_SET1_REG: SRC_COEF7 (Bit 16)               */
#define APU_COEF76_SET1_REG_SRC_COEF7_Msk (0xffff0000UL)            /*!< APU COEF76_SET1_REG: SRC_COEF7 (Bitfield-Mask: 0xffff) */
#define APU_COEF76_SET1_REG_SRC_COEF6_Pos (0UL)                     /*!< APU COEF76_SET1_REG: SRC_COEF6 (Bit 0)                */
#define APU_COEF76_SET1_REG_SRC_COEF6_Msk (0xffffUL)                /*!< APU COEF76_SET1_REG: SRC_COEF6 (Bitfield-Mask: 0xffff) */
/* ====================================================  COEF98_SET1_REG  ==================================================== */
#define APU_COEF98_SET1_REG_SRC_COEF9_Pos (16UL)                    /*!< APU COEF98_SET1_REG: SRC_COEF9 (Bit 16)               */
#define APU_COEF98_SET1_REG_SRC_COEF9_Msk (0xffff0000UL)            /*!< APU COEF98_SET1_REG: SRC_COEF9 (Bitfield-Mask: 0xffff) */
#define APU_COEF98_SET1_REG_SRC_COEF8_Pos (0UL)                     /*!< APU COEF98_SET1_REG: SRC_COEF8 (Bit 0)                */
#define APU_COEF98_SET1_REG_SRC_COEF8_Msk (0xffffUL)                /*!< APU COEF98_SET1_REG: SRC_COEF8 (Bitfield-Mask: 0xffff) */
/* =====================================================  PCM1_CTRL_REG  ===================================================== */
#define APU_PCM1_CTRL_REG_PCM_FSC_DIV_Pos (20UL)                    /*!< APU PCM1_CTRL_REG: PCM_FSC_DIV (Bit 20)               */
#define APU_PCM1_CTRL_REG_PCM_FSC_DIV_Msk (0xfff00000UL)            /*!< APU PCM1_CTRL_REG: PCM_FSC_DIV (Bitfield-Mask: 0xfff) */
#define APU_PCM1_CTRL_REG_PCM_FSC_EDGE_Pos (16UL)                   /*!< APU PCM1_CTRL_REG: PCM_FSC_EDGE (Bit 16)              */
#define APU_PCM1_CTRL_REG_PCM_FSC_EDGE_Msk (0x10000UL)              /*!< APU PCM1_CTRL_REG: PCM_FSC_EDGE (Bitfield-Mask: 0x01) */
#define APU_PCM1_CTRL_REG_PCM_CH_DEL_Pos  (11UL)                    /*!< APU PCM1_CTRL_REG: PCM_CH_DEL (Bit 11)                */
#define APU_PCM1_CTRL_REG_PCM_CH_DEL_Msk  (0xf800UL)                /*!< APU PCM1_CTRL_REG: PCM_CH_DEL (Bitfield-Mask: 0x1f)   */
#define APU_PCM1_CTRL_REG_PCM_CLK_BIT_Pos (10UL)                    /*!< APU PCM1_CTRL_REG: PCM_CLK_BIT (Bit 10)               */
#define APU_PCM1_CTRL_REG_PCM_CLK_BIT_Msk (0x400UL)                 /*!< APU PCM1_CTRL_REG: PCM_CLK_BIT (Bitfield-Mask: 0x01)  */
#define APU_PCM1_CTRL_REG_PCM_FSCINV_Pos  (9UL)                     /*!< APU PCM1_CTRL_REG: PCM_FSCINV (Bit 9)                 */
#define APU_PCM1_CTRL_REG_PCM_FSCINV_Msk  (0x200UL)                 /*!< APU PCM1_CTRL_REG: PCM_FSCINV (Bitfield-Mask: 0x01)   */
#define APU_PCM1_CTRL_REG_PCM_CLKINV_Pos  (8UL)                     /*!< APU PCM1_CTRL_REG: PCM_CLKINV (Bit 8)                 */
#define APU_PCM1_CTRL_REG_PCM_CLKINV_Msk  (0x100UL)                 /*!< APU PCM1_CTRL_REG: PCM_CLKINV (Bitfield-Mask: 0x01)   */
#define APU_PCM1_CTRL_REG_PCM_PPOD_Pos    (7UL)                     /*!< APU PCM1_CTRL_REG: PCM_PPOD (Bit 7)                   */
#define APU_PCM1_CTRL_REG_PCM_PPOD_Msk    (0x80UL)                  /*!< APU PCM1_CTRL_REG: PCM_PPOD (Bitfield-Mask: 0x01)     */
#define APU_PCM1_CTRL_REG_PCM_FSCDEL_Pos  (6UL)                     /*!< APU PCM1_CTRL_REG: PCM_FSCDEL (Bit 6)                 */
#define APU_PCM1_CTRL_REG_PCM_FSCDEL_Msk  (0x40UL)                  /*!< APU PCM1_CTRL_REG: PCM_FSCDEL (Bitfield-Mask: 0x01)   */
#define APU_PCM1_CTRL_REG_PCM_FSCLEN_Pos  (2UL)                     /*!< APU PCM1_CTRL_REG: PCM_FSCLEN (Bit 2)                 */
#define APU_PCM1_CTRL_REG_PCM_FSCLEN_Msk  (0x3cUL)                  /*!< APU PCM1_CTRL_REG: PCM_FSCLEN (Bitfield-Mask: 0x0f)   */
#define APU_PCM1_CTRL_REG_PCM_MASTER_Pos  (1UL)                     /*!< APU PCM1_CTRL_REG: PCM_MASTER (Bit 1)                 */
#define APU_PCM1_CTRL_REG_PCM_MASTER_Msk  (0x2UL)                   /*!< APU PCM1_CTRL_REG: PCM_MASTER (Bitfield-Mask: 0x01)   */
#define APU_PCM1_CTRL_REG_PCM_EN_Pos      (0UL)                     /*!< APU PCM1_CTRL_REG: PCM_EN (Bit 0)                     */
#define APU_PCM1_CTRL_REG_PCM_EN_Msk      (0x1UL)                   /*!< APU PCM1_CTRL_REG: PCM_EN (Bitfield-Mask: 0x01)       */
/* =====================================================  PCM1_IN1_REG  ====================================================== */
#define APU_PCM1_IN1_REG_PCM_IN_Pos       (0UL)                     /*!< APU PCM1_IN1_REG: PCM_IN (Bit 0)                      */
#define APU_PCM1_IN1_REG_PCM_IN_Msk       (0xffffffffUL)            /*!< APU PCM1_IN1_REG: PCM_IN (Bitfield-Mask: 0xffffffff)  */
/* =====================================================  PCM1_IN2_REG  ====================================================== */
#define APU_PCM1_IN2_REG_PCM_IN_Pos       (0UL)                     /*!< APU PCM1_IN2_REG: PCM_IN (Bit 0)                      */
#define APU_PCM1_IN2_REG_PCM_IN_Msk       (0xffffffffUL)            /*!< APU PCM1_IN2_REG: PCM_IN (Bitfield-Mask: 0xffffffff)  */
/* =====================================================  PCM1_OUT1_REG  ===================================================== */
#define APU_PCM1_OUT1_REG_PCM_OUT_Pos     (0UL)                     /*!< APU PCM1_OUT1_REG: PCM_OUT (Bit 0)                    */
#define APU_PCM1_OUT1_REG_PCM_OUT_Msk     (0xffffffffUL)            /*!< APU PCM1_OUT1_REG: PCM_OUT (Bitfield-Mask: 0xffffffff) */
/* =====================================================  PCM1_OUT2_REG  ===================================================== */
#define APU_PCM1_OUT2_REG_PCM_OUT_Pos     (0UL)                     /*!< APU PCM1_OUT2_REG: PCM_OUT (Bit 0)                    */
#define APU_PCM1_OUT2_REG_PCM_OUT_Msk     (0xffffffffUL)            /*!< APU PCM1_OUT2_REG: PCM_OUT (Bitfield-Mask: 0xffffffff) */
/* =====================================================  SRC1_CTRL_REG  ===================================================== */
#define APU_SRC1_CTRL_REG_SRC_PDM_MODE_Pos (28UL)                   /*!< APU SRC1_CTRL_REG: SRC_PDM_MODE (Bit 28)              */
#define APU_SRC1_CTRL_REG_SRC_PDM_MODE_Msk (0x30000000UL)           /*!< APU SRC1_CTRL_REG: SRC_PDM_MODE (Bitfield-Mask: 0x03) */
#define APU_SRC1_CTRL_REG_SRC_OUT_FLOWCLR_Pos (25UL)                /*!< APU SRC1_CTRL_REG: SRC_OUT_FLOWCLR (Bit 25)           */
#define APU_SRC1_CTRL_REG_SRC_OUT_FLOWCLR_Msk (0x2000000UL)         /*!< APU SRC1_CTRL_REG: SRC_OUT_FLOWCLR (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_IN_FLOWCLR_Pos (24UL)                 /*!< APU SRC1_CTRL_REG: SRC_IN_FLOWCLR (Bit 24)            */
#define APU_SRC1_CTRL_REG_SRC_IN_FLOWCLR_Msk (0x1000000UL)          /*!< APU SRC1_CTRL_REG: SRC_IN_FLOWCLR (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_OUT_UNFLOW_Pos (23UL)                 /*!< APU SRC1_CTRL_REG: SRC_OUT_UNFLOW (Bit 23)            */
#define APU_SRC1_CTRL_REG_SRC_OUT_UNFLOW_Msk (0x800000UL)           /*!< APU SRC1_CTRL_REG: SRC_OUT_UNFLOW (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_OUT_OVFLOW_Pos (22UL)                 /*!< APU SRC1_CTRL_REG: SRC_OUT_OVFLOW (Bit 22)            */
#define APU_SRC1_CTRL_REG_SRC_OUT_OVFLOW_Msk (0x400000UL)           /*!< APU SRC1_CTRL_REG: SRC_OUT_OVFLOW (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_IN_UNFLOW_Pos (21UL)                  /*!< APU SRC1_CTRL_REG: SRC_IN_UNFLOW (Bit 21)             */
#define APU_SRC1_CTRL_REG_SRC_IN_UNFLOW_Msk (0x200000UL)            /*!< APU SRC1_CTRL_REG: SRC_IN_UNFLOW (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_IN_OVFLOW_Pos (20UL)                  /*!< APU SRC1_CTRL_REG: SRC_IN_OVFLOW (Bit 20)             */
#define APU_SRC1_CTRL_REG_SRC_IN_OVFLOW_Msk (0x100000UL)            /*!< APU SRC1_CTRL_REG: SRC_IN_OVFLOW (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_OUT_OK_Pos  (18UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_OK (Bit 18)                */
#define APU_SRC1_CTRL_REG_SRC_OUT_OK_Msk  (0x40000UL)               /*!< APU SRC1_CTRL_REG: SRC_OUT_OK (Bitfield-Mask: 0x01)   */
#define APU_SRC1_CTRL_REG_SRC_OUT_US_Pos  (16UL)                    /*!< APU SRC1_CTRL_REG: SRC_OUT_US (Bit 16)                */
#define APU_SRC1_CTRL_REG_SRC_OUT_US_Msk  (0x30000UL)               /*!< APU SRC1_CTRL_REG: SRC_OUT_US (Bitfield-Mask: 0x03)   */
#define APU_SRC1_CTRL_REG_SRC_OUT_CAL_BYPASS_Pos (14UL)             /*!< APU SRC1_CTRL_REG: SRC_OUT_CAL_BYPASS (Bit 14)        */
#define APU_SRC1_CTRL_REG_SRC_OUT_CAL_BYPASS_Msk (0x4000UL)         /*!< APU SRC1_CTRL_REG: SRC_OUT_CAL_BYPASS (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_OUT_AMODE_Pos (13UL)                  /*!< APU SRC1_CTRL_REG: SRC_OUT_AMODE (Bit 13)             */
#define APU_SRC1_CTRL_REG_SRC_OUT_AMODE_Msk (0x2000UL)              /*!< APU SRC1_CTRL_REG: SRC_OUT_AMODE (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_DITHER_DISABLE_Pos (7UL)              /*!< APU SRC1_CTRL_REG: SRC_DITHER_DISABLE (Bit 7)         */
#define APU_SRC1_CTRL_REG_SRC_DITHER_DISABLE_Msk (0x80UL)           /*!< APU SRC1_CTRL_REG: SRC_DITHER_DISABLE (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_IN_OK_Pos   (6UL)                     /*!< APU SRC1_CTRL_REG: SRC_IN_OK (Bit 6)                  */
#define APU_SRC1_CTRL_REG_SRC_IN_OK_Msk   (0x40UL)                  /*!< APU SRC1_CTRL_REG: SRC_IN_OK (Bitfield-Mask: 0x01)    */
#define APU_SRC1_CTRL_REG_SRC_IN_DS_Pos   (4UL)                     /*!< APU SRC1_CTRL_REG: SRC_IN_DS (Bit 4)                  */
#define APU_SRC1_CTRL_REG_SRC_IN_DS_Msk   (0x30UL)                  /*!< APU SRC1_CTRL_REG: SRC_IN_DS (Bitfield-Mask: 0x03)    */
#define APU_SRC1_CTRL_REG_SRC_IN_CAL_BYPASS_Pos (2UL)               /*!< APU SRC1_CTRL_REG: SRC_IN_CAL_BYPASS (Bit 2)          */
#define APU_SRC1_CTRL_REG_SRC_IN_CAL_BYPASS_Msk (0x4UL)             /*!< APU SRC1_CTRL_REG: SRC_IN_CAL_BYPASS (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_IN_AMODE_Pos (1UL)                    /*!< APU SRC1_CTRL_REG: SRC_IN_AMODE (Bit 1)               */
#define APU_SRC1_CTRL_REG_SRC_IN_AMODE_Msk (0x2UL)                  /*!< APU SRC1_CTRL_REG: SRC_IN_AMODE (Bitfield-Mask: 0x01) */
#define APU_SRC1_CTRL_REG_SRC_EN_Pos      (0UL)                     /*!< APU SRC1_CTRL_REG: SRC_EN (Bit 0)                     */
#define APU_SRC1_CTRL_REG_SRC_EN_Msk      (0x1UL)                   /*!< APU SRC1_CTRL_REG: SRC_EN (Bitfield-Mask: 0x01)       */
/* =====================================================  SRC1_IN1_REG  ====================================================== */
#define APU_SRC1_IN1_REG_SRC_IN_Pos       (8UL)                     /*!< APU SRC1_IN1_REG: SRC_IN (Bit 8)                      */
#define APU_SRC1_IN1_REG_SRC_IN_Msk       (0xffffff00UL)            /*!< APU SRC1_IN1_REG: SRC_IN (Bitfield-Mask: 0xffffff)    */
/* =====================================================  SRC1_IN2_REG  ====================================================== */
#define APU_SRC1_IN2_REG_SRC_IN_Pos       (8UL)                     /*!< APU SRC1_IN2_REG: SRC_IN (Bit 8)                      */
#define APU_SRC1_IN2_REG_SRC_IN_Msk       (0xffffff00UL)            /*!< APU SRC1_IN2_REG: SRC_IN (Bitfield-Mask: 0xffffff)    */
/* ====================================================  SRC1_IN_FS_REG  ===================================================== */
#define APU_SRC1_IN_FS_REG_SRC_IN_FS_Pos  (0UL)                     /*!< APU SRC1_IN_FS_REG: SRC_IN_FS (Bit 0)                 */
#define APU_SRC1_IN_FS_REG_SRC_IN_FS_Msk  (0xffffffUL)              /*!< APU SRC1_IN_FS_REG: SRC_IN_FS (Bitfield-Mask: 0xffffff) */
/* =====================================================  SRC1_OUT1_REG  ===================================================== */
#define APU_SRC1_OUT1_REG_SRC_OUT_Pos     (8UL)                     /*!< APU SRC1_OUT1_REG: SRC_OUT (Bit 8)                    */
#define APU_SRC1_OUT1_REG_SRC_OUT_Msk     (0xffffff00UL)            /*!< APU SRC1_OUT1_REG: SRC_OUT (Bitfield-Mask: 0xffffff)  */
/* =====================================================  SRC1_OUT2_REG  ===================================================== */
#define APU_SRC1_OUT2_REG_SRC_OUT_Pos     (8UL)                     /*!< APU SRC1_OUT2_REG: SRC_OUT (Bit 8)                    */
#define APU_SRC1_OUT2_REG_SRC_OUT_Msk     (0xffffff00UL)            /*!< APU SRC1_OUT2_REG: SRC_OUT (Bitfield-Mask: 0xffffff)  */
/* ====================================================  SRC1_OUT_FS_REG  ==================================================== */
#define APU_SRC1_OUT_FS_REG_SRC_OUT_FS_Pos (0UL)                    /*!< APU SRC1_OUT_FS_REG: SRC_OUT_FS (Bit 0)               */
#define APU_SRC1_OUT_FS_REG_SRC_OUT_FS_Msk (0xffffffUL)             /*!< APU SRC1_OUT_FS_REG: SRC_OUT_FS (Bitfield-Mask: 0xffffff) */


/* =========================================================================================================================== */
/* ================                                            BLE                                            ================ */
/* =========================================================================================================================== */

