S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ==================================================  BLE_ACTSCANSTAT_REG  ================================================== */
#define BLE_BLE_ACTSCANSTAT_REG_BACKOFF_Pos (16UL)                  /*!< BLE BLE_ACTSCANSTAT_REG: BACKOFF (Bit 16)             */
#define BLE_BLE_ACTSCANSTAT_REG_BACKOFF_Msk (0x1ff0000UL)           /*!< BLE BLE_ACTSCANSTAT_REG: BACKOFF (Bitfield-Mask: 0x1ff) */
#define BLE_BLE_ACTSCANSTAT_REG_UPPERLIMIT_Pos (0UL)                /*!< BLE BLE_ACTSCANSTAT_REG: UPPERLIMIT (Bit 0)           */
#define BLE_BLE_ACTSCANSTAT_REG_UPPERLIMIT_Msk (0x1ffUL)            /*!< BLE BLE_ACTSCANSTAT_REG: UPPERLIMIT (Bitfield-Mask: 0x1ff) */
/* ===================================================  BLE_ADVCHMAP_REG  ==================================================== */
#define BLE_BLE_ADVCHMAP_REG_ADVCHMAP_Pos (0UL)                     /*!< BLE BLE_ADVCHMAP_REG: ADVCHMAP (Bit 0)                */
#define BLE_BLE_ADVCHMAP_REG_ADVCHMAP_Msk (0x7UL)                   /*!< BLE BLE_ADVCHMAP_REG: ADVCHMAP (Bitfield-Mask: 0x07)  */
/* ====================================================  BLE_ADVTIM_REG  ===================================================== */
#define BLE_BLE_ADVTIM_REG_ADVINT_Pos     (0UL)                     /*!< BLE BLE_ADVTIM_REG: ADVINT (Bit 0)                    */
#define BLE_BLE_ADVTIM_REG_ADVINT_Msk     (0x3fffUL)                /*!< BLE BLE_ADVTIM_REG: ADVINT (Bitfield-Mask: 0x3fff)    */
/* ====================================================  BLE_AESCNTL_REG  ==================================================== */
#define BLE_BLE_AESCNTL_REG_AES_MODE_Pos  (1UL)                     /*!< BLE BLE_AESCNTL_REG: AES_MODE (Bit 1)                 */
#define BLE_BLE_AESCNTL_REG_AES_MODE_Msk  (0x2UL)                   /*!< BLE BLE_AESCNTL_REG: AES_MODE (Bitfield-Mask: 0x01)   */
#define BLE_BLE_AESCNTL_REG_AES_START_Pos (0UL)                     /*!< BLE BLE_AESCNTL_REG: AES_START (Bit 0)                */
#define BLE_BLE_AESCNTL_REG_AES_START_Msk (0x1UL)                   /*!< BLE BLE_AESCNTL_REG: AES_START (Bitfield-Mask: 0x01)  */
/* =================================================  BLE_AESKEY127_96_REG  ================================================== */
#define BLE_BLE_AESKEY127_96_REG_AESKEY127_96_Pos (0UL)             /*!< BLE BLE_AESKEY127_96_REG: AESKEY127_96 (Bit 0)        */
#define BLE_BLE_AESKEY127_96_REG_AESKEY127_96_Msk (0xffffffffUL)    /*!< BLE BLE_AESKEY127_96_REG: AESKEY127_96 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  BLE_AESKEY31_0_REG  =================================================== */
#define BLE_BLE_AESKEY31_0_REG_AESKEY31_0_Pos (0UL)                 /*!< BLE BLE_AESKEY31_0_REG: AESKEY31_0 (Bit 0)            */
#define BLE_BLE_AESKEY31_0_REG_AESKEY31_0_Msk (0xffffffffUL)        /*!< BLE BLE_AESKEY31_0_REG: AESKEY31_0 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  BLE_AESKEY63_32_REG  ================================================== */
#define BLE_BLE_AESKEY63_32_REG_AESKEY63_32_Pos (0UL)               /*!< BLE BLE_AESKEY63_32_REG: AESKEY63_32 (Bit 0)          */
#define BLE_BLE_AESKEY63_32_REG_AESKEY63_32_Msk (0xffffffffUL)      /*!< BLE BLE_AESKEY63_32_REG: AESKEY63_32 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  BLE_AESKEY95_64_REG  ================================================== */
#define BLE_BLE_AESKEY95_64_REG_AESKEY95_64_Pos (0UL)               /*!< BLE BLE_AESKEY95_64_REG: AESKEY95_64 (Bit 0)          */
#define BLE_BLE_AESKEY95_64_REG_AESKEY95_64_Msk (0xffffffffUL)      /*!< BLE BLE_AESKEY95_64_REG: AESKEY95_64 (Bitfield-Mask: 0xffffffff) */
/* ====================================================  BLE_AESPTR_REG  ===================================================== */
#define BLE_BLE_AESPTR_REG_AESPTR_Pos     (0UL)                     /*!< BLE BLE_AESPTR_REG: AESPTR (Bit 0)                    */
#define BLE_BLE_AESPTR_REG_AESPTR_Msk     (0xffffUL)                /*!< BLE BLE_AESPTR_REG: AESPTR (Bitfield-Mask: 0xffff)    */
/* ================================================  BLE_BASETIMECNTCORR_REG  ================================================ */
#define BLE_BLE_BASETIMECNTCORR_REG_BASETIMECNTCORR_Pos (0UL)       /*!< BLE BLE_BASETIMECNTCORR_REG: BASETIMECNTCORR (Bit 0)  */
#define BLE_BLE_BASETIMECNTCORR_REG_BASETIMECNTCORR_Msk (0x7ffffffUL) /*!< BLE BLE_BASETIMECNTCORR_REG: BASETIMECNTCORR (Bitfield-Mask: 0x7ffffff) */
/* ==================================================  BLE_BASETIMECNT_REG  ================================================== */
#define BLE_BLE_BASETIMECNT_REG_BASETIMECNT_Pos (0UL)               /*!< BLE BLE_BASETIMECNT_REG: BASETIMECNT (Bit 0)          */
#define BLE_BLE_BASETIMECNT_REG_BASETIMECNT_Msk (0x7ffffffUL)       /*!< BLE BLE_BASETIMECNT_REG: BASETIMECNT (Bitfield-Mask: 0x7ffffff) */
/* ====================================================  BLE_BDADDRL_REG  ==================================================== */
#define BLE_BLE_BDADDRL_REG_BDADDRL_Pos   (0UL)                     /*!< BLE BLE_BDADDRL_REG: BDADDRL (Bit 0)                  */
#define BLE_BLE_BDADDRL_REG_BDADDRL_Msk   (0xffffffffUL)            /*!< BLE BLE_BDADDRL_REG: BDADDRL (Bitfield-Mask: 0xffffffff) */
/* ====================================================  BLE_BDADDRU_REG  ==================================================== */
#define BLE_BLE_BDADDRU_REG_PRIV_NPUB_Pos (16UL)                    /*!< BLE BLE_BDADDRU_REG: PRIV_NPUB (Bit 16)               */
#define BLE_BLE_BDADDRU_REG_PRIV_NPUB_Msk (0x10000UL)               /*!< BLE BLE_BDADDRU_REG: PRIV_NPUB (Bitfield-Mask: 0x01)  */
#define BLE_BLE_BDADDRU_REG_BDADDRU_Pos   (0UL)                     /*!< BLE BLE_BDADDRU_REG: BDADDRU (Bit 0)                  */
#define BLE_BLE_BDADDRU_REG_BDADDRU_Msk   (0xffffUL)                /*!< BLE BLE_BDADDRU_REG: BDADDRU (Bitfield-Mask: 0xffff)  */
/* ===================================================  BLE_BLEMPRIO0_REG  =================================================== */
#define BLE_BLE_BLEMPRIO0_REG_BLEM7_Pos   (28UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM7 (Bit 28)                 */
#define BLE_BLE_BLEMPRIO0_REG_BLEM7_Msk   (0xf0000000UL)            /*!< BLE BLE_BLEMPRIO0_REG: BLEM7 (Bitfield-Mask: 0x0f)    */
#define BLE_BLE_BLEMPRIO0_REG_BLEM6_Pos   (24UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM6 (Bit 24)                 */
#define BLE_BLE_BLEMPRIO0_REG_BLEM6_Msk   (0xf000000UL)             /*!< BLE BLE_BLEMPRIO0_REG: BLEM6 (Bitfield-Mask: 0x0f)    */
#define BLE_BLE_BLEMPRIO0_REG_BLEM5_Pos   (20UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM5 (Bit 20)                 */
#define BLE_BLE_BLEMPRIO0_REG_BLEM5_Msk   (0xf00000UL)              /*!< BLE BLE_BLEMPRIO0_REG: BLEM5 (Bitfield-Mask: 0x0f)    */
#define BLE_BLE_BLEMPRIO0_REG_BLEM4_Pos   (16UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM4 (Bit 16)                 */
#define BLE_BLE_BLEMPRIO0_REG_BLEM4_Msk   (0xf0000UL)               /*!< BLE BLE_BLEMPRIO0_REG: BLEM4 (Bitfield-Mask: 0x0f)    */
#define BLE_BLE_BLEMPRIO0_REG_BLEM3_Pos   (12UL)                    /*!< BLE BLE_BLEMPRIO0_REG: BLEM3 (Bit 12)                 */
#define BLE_BLE_BLEMPRIO0_REG_BLEM3_Msk   (0xf000UL)                /*!< BLE BLE_BLEMPRIO0_REG: BLEM3 (Bitfield-Mask: 0x0f)    */
#define BLE_BLE_BLEMPRIO0_REG_BLEM2_Pos   (8UL)                     /*!< BLE BLE_BLEMPRIO0_REG: BLEM2 (Bit 8)                  */
#define BLE_BLE_BLEMPRIO0_REG_BLEM2_Msk   (0xf00UL)                 /*!< BLE BLE_BLEMPRIO0_REG: BLEM2 (Bitfield-Mask: 0x0f)    */
#define BLE_BLE_BLEMPRIO0_REG_BLEM1_Pos   (4UL)                     /*!< BLE BLE_BLEMPRIO0_REG: BLEM1 (Bit 4)                  */
#define BLE_BLE_BLEMPRIO0_REG_BLEM1_Msk   (0xf0UL)                  /*!< BLE BLE_BLEMPRIO0_REG: BLEM1 (Bitfield-Mask: 0x0f)    */
#define BLE_BLE_BLEMPRIO0_REG_BLEM0_Pos   (0UL)                     /*!< BLE BLE_BLEMPRIO0_REG: BLEM0 (Bit 0)                  */
#define BLE_BLE_BLEMPRIO0_REG_BLEM0_Msk   (0xfUL)                   /*!< BLE BLE_BLEMPRIO0_REG: BLEM0 (Bitfield-Mask: 0x0f)    */
/* ===================================================  BLE_BLEMPRIO1_REG  =================================================== */
#define BLE_BLE_BLEMPRIO1_REG_BLEMDEFAULT_Pos (28UL)                /*!< BLE BLE_BLEMPRIO1_REG: BLEMDEFAULT (Bit 28)           */
#define BLE_BLE_BLEMPRIO1_REG_BLEMDEFAULT_Msk (0xf0000000UL)        /*!< BLE BLE_BLEMPRIO1_REG: BLEMDEFAULT (Bitfield-Mask: 0x0f) */
/* =================================================  BLE_BLEPRIOSCHARB_REG  ================================================= */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEPRIOMODE_Pos (15UL)            /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEPRIOMODE (Bit 15)       */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEPRIOMODE_Msk (0x8000UL)        /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEPRIOMODE (Bitfield-Mask: 0x01) */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEMARGIN_Pos (0UL)               /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEMARGIN (Bit 0)          */
#define BLE_BLE_BLEPRIOSCHARB_REG_BLEMARGIN_Msk (0xffUL)            /*!< BLE BLE_BLEPRIOSCHARB_REG: BLEMARGIN (Bitfield-Mask: 0xff) */
/* =====================================================  BLE_CNTL2_REG  ===================================================== */
#define BLE_BLE_CNTL2_REG_BLE_RSSI_SEL_Pos (21UL)                   /*!< BLE BLE_CNTL2_REG: BLE_RSSI_SEL (Bit 21)              */
#define BLE_BLE_CNTL2_REG_BLE_RSSI_SEL_Msk (0x200000UL)             /*!< BLE BLE_CNTL2_REG: BLE_RSSI_SEL (Bitfield-Mask: 0x01) */
#define BLE_BLE_CNTL2_REG_WAKEUPLPSTAT_Pos (20UL)                   /*!< BLE BLE_CNTL2_REG: WAKEUPLPSTAT (Bit 20)              */
#define BLE_BLE_CNTL2_REG_WAKEUPLPSTAT_Msk (0x100000UL)             /*!< BLE BLE_CNTL2_REG: WAKEUPLPSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_CNTL2_REG_SW_RPL_SPI_Pos  (19UL)                    /*!< BLE BLE_CNTL2_REG: SW_RPL_SPI (Bit 19)                */
#define BLE_BLE_CNTL2_REG_SW_RPL_SPI_Msk  (0x80000UL)               /*!< BLE BLE_CNTL2_REG: SW_RPL_SPI (Bitfield-Mask: 0x01)   */
#define BLE_BLE_CNTL2_REG_BLE_CLK_SEL_Pos (9UL)                     /*!< BLE BLE_CNTL2_REG: BLE_CLK_SEL (Bit 9)                */
#define BLE_BLE_CNTL2_REG_BLE_CLK_SEL_Msk (0x7e00UL)                /*!< BLE BLE_CNTL2_REG: BLE_CLK_SEL (Bitfield-Mask: 0x3f)  */
#define BLE_BLE_CNTL2_REG_RADIO_PWRDN_ALLOW_Pos (8UL)               /*!< BLE BLE_CNTL2_REG: RADIO_PWRDN_ALLOW (Bit 8)          */
#define BLE_BLE_CNTL2_REG_RADIO_PWRDN_ALLOW_Msk (0x100UL)           /*!< BLE BLE_CNTL2_REG: RADIO_PWRDN_ALLOW (Bitfield-Mask: 0x01) */
#define BLE_BLE_CNTL2_REG_MON_LP_CLK_Pos  (7UL)                     /*!< BLE BLE_CNTL2_REG: MON_LP_CLK (Bit 7)                 */
#define BLE_BLE_CNTL2_REG_MON_LP_CLK_Msk  (0x80UL)                  /*!< BLE BLE_CNTL2_REG: MON_LP_CLK (Bitfield-Mask: 0x01)   */
#define BLE_BLE_CNTL2_REG_BLE_CLK_STAT_Pos (6UL)                    /*!< BLE BLE_CNTL2_REG: BLE_CLK_STAT (Bit 6)               */
#define BLE_BLE_CNTL2_REG_BLE_CLK_STAT_Msk (0x40UL)                 /*!< BLE BLE_CNTL2_REG: BLE_CLK_STAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_CNTL2_REG_EMACCERRMSK_Pos (2UL)                     /*!< BLE BLE_CNTL2_REG: EMACCERRMSK (Bit 2)                */
#define BLE_BLE_CNTL2_REG_EMACCERRMSK_Msk (0x4UL)                   /*!< BLE BLE_CNTL2_REG: EMACCERRMSK (Bitfield-Mask: 0x01)  */
#define BLE_BLE_CNTL2_REG_EMACCERRACK_Pos (1UL)                     /*!< BLE BLE_CNTL2_REG: EMACCERRACK (Bit 1)                */
#define BLE_BLE_CNTL2_REG_EMACCERRACK_Msk (0x2UL)                   /*!< BLE BLE_CNTL2_REG: EMACCERRACK (Bitfield-Mask: 0x01)  */
#define BLE_BLE_CNTL2_REG_EMACCERRSTAT_Pos (0UL)                    /*!< BLE BLE_CNTL2_REG: EMACCERRSTAT (Bit 0)               */
#define BLE_BLE_CNTL2_REG_EMACCERRSTAT_Msk (0x1UL)                  /*!< BLE BLE_CNTL2_REG: EMACCERRSTAT (Bitfield-Mask: 0x01) */
/* ==================================================  BLE_COEXIFCNTL0_REG  ================================================== */
#define BLE_BLE_COEXIFCNTL0_REG_WLCRXPRIOMODE_Pos (20UL)            /*!< BLE BLE_COEXIFCNTL0_REG: WLCRXPRIOMODE (Bit 20)       */
#define BLE_BLE_COEXIFCNTL0_REG_WLCRXPRIOMODE_Msk (0x300000UL)      /*!< BLE BLE_COEXIFCNTL0_REG: WLCRXPRIOMODE (Bitfield-Mask: 0x03) */
#define BLE_BLE_COEXIFCNTL0_REG_WLCTXPRIOMODE_Pos (16UL)            /*!< BLE BLE_COEXIFCNTL0_REG: WLCTXPRIOMODE (Bit 16)       */
#define BLE_BLE_COEXIFCNTL0_REG_WLCTXPRIOMODE_Msk (0x30000UL)       /*!< BLE BLE_COEXIFCNTL0_REG: WLCTXPRIOMODE (Bitfield-Mask: 0x03) */
#define BLE_BLE_COEXIFCNTL0_REG_WLANTXMSK_Pos (6UL)                 /*!< BLE BLE_COEXIFCNTL0_REG: WLANTXMSK (Bit 6)            */
#define BLE_BLE_COEXIFCNTL0_REG_WLANTXMSK_Msk (0xc0UL)              /*!< BLE BLE_COEXIFCNTL0_REG: WLANTXMSK (Bitfield-Mask: 0x03) */
#define BLE_BLE_COEXIFCNTL0_REG_WLANRXMSK_Pos (4UL)                 /*!< BLE BLE_COEXIFCNTL0_REG: WLANRXMSK (Bit 4)            */
#define BLE_BLE_COEXIFCNTL0_REG_WLANRXMSK_Msk (0x30UL)              /*!< BLE BLE_COEXIFCNTL0_REG: WLANRXMSK (Bitfield-Mask: 0x03) */
#define BLE_BLE_COEXIFCNTL0_REG_SYNCGEN_EN_Pos (1UL)                /*!< BLE BLE_COEXIFCNTL0_REG: SYNCGEN_EN (Bit 1)           */
#define BLE_BLE_COEXIFCNTL0_REG_SYNCGEN_EN_Msk (0x2UL)              /*!< BLE BLE_COEXIFCNTL0_REG: SYNCGEN_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_COEXIFCNTL0_REG_COEX_EN_Pos (0UL)                   /*!< BLE BLE_COEXIFCNTL0_REG: COEX_EN (Bit 0)              */
#define BLE_BLE_COEXIFCNTL0_REG_COEX_EN_Msk (0x1UL)                 /*!< BLE BLE_COEXIFCNTL0_REG: COEX_EN (Bitfield-Mask: 0x01) */
/* ==================================================  BLE_COEXIFCNTL1_REG  ================================================== */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPRXTHR_Pos (24UL)                /*!< BLE BLE_COEXIFCNTL1_REG: WLCPRXTHR (Bit 24)           */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPRXTHR_Msk (0x1f000000UL)        /*!< BLE BLE_COEXIFCNTL1_REG: WLCPRXTHR (Bitfield-Mask: 0x1f) */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPTXTHR_Pos (16UL)                /*!< BLE BLE_COEXIFCNTL1_REG: WLCPTXTHR (Bit 16)           */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPTXTHR_Msk (0x1f0000UL)          /*!< BLE BLE_COEXIFCNTL1_REG: WLCPTXTHR (Bitfield-Mask: 0x1f) */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDURATION_Pos (8UL)              /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDURATION (Bit 8)         */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDURATION_Msk (0x7f00UL)         /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDURATION (Bitfield-Mask: 0x7f) */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDELAY_Pos (0UL)                 /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDELAY (Bit 0)            */
#define BLE_BLE_COEXIFCNTL1_REG_WLCPDELAY_Msk (0x7fUL)              /*!< BLE BLE_COEXIFCNTL1_REG: WLCPDELAY (Bitfield-Mask: 0x7f) */
/* ===============================================  BLE_CURRENTRXDESCPTR_REG  ================================================ */
#define BLE_BLE_CURRENTRXDESCPTR_REG_ETPTR_Pos (16UL)               /*!< BLE BLE_CURRENTRXDESCPTR_REG: ETPTR (Bit 16)          */
#define BLE_BLE_CURRENTRXDESCPTR_REG_ETPTR_Msk (0xffff0000UL)       /*!< BLE BLE_CURRENTRXDESCPTR_REG: ETPTR (Bitfield-Mask: 0xffff) */
#define BLE_BLE_CURRENTRXDESCPTR_REG_CURRENTRXDESCPTR_Pos (0UL)     /*!< BLE BLE_CURRENTRXDESCPTR_REG: CURRENTRXDESCPTR (Bit 0) */
#define BLE_BLE_CURRENTRXDESCPTR_REG_CURRENTRXDESCPTR_Msk (0x7fffUL) /*!< BLE BLE_CURRENTRXDESCPTR_REG: CURRENTRXDESCPTR (Bitfield-Mask: 0x7fff) */
/* ==================================================  BLE_DEBUGADDMAX_REG  ================================================== */
#define BLE_BLE_DEBUGADDMAX_REG_REG_ADDMAX_Pos (16UL)               /*!< BLE BLE_DEBUGADDMAX_REG: REG_ADDMAX (Bit 16)          */
#define BLE_BLE_DEBUGADDMAX_REG_REG_ADDMAX_Msk (0xffff0000UL)       /*!< BLE BLE_DEBUGADDMAX_REG: REG_ADDMAX (Bitfield-Mask: 0xffff) */
#define BLE_BLE_DEBUGADDMAX_REG_EM_ADDMAX_Pos (0UL)                 /*!< BLE BLE_DEBUGADDMAX_REG: EM_ADDMAX (Bit 0)            */
#define BLE_BLE_DEBUGADDMAX_REG_EM_ADDMAX_Msk (0xffffUL)            /*!< BLE BLE_DEBUGADDMAX_REG: EM_ADDMAX (Bitfield-Mask: 0xffff) */
/* ==================================================  BLE_DEBUGADDMIN_REG  ================================================== */
#define BLE_BLE_DEBUGADDMIN_REG_REG_ADDMIN_Pos (16UL)               /*!< BLE BLE_DEBUGADDMIN_REG: REG_ADDMIN (Bit 16)          */
#define BLE_BLE_DEBUGADDMIN_REG_REG_ADDMIN_Msk (0xffff0000UL)       /*!< BLE BLE_DEBUGADDMIN_REG: REG_ADDMIN (Bitfield-Mask: 0xffff) */
#define BLE_BLE_DEBUGADDMIN_REG_EM_ADDMIN_Pos (0UL)                 /*!< BLE BLE_DEBUGADDMIN_REG: EM_ADDMIN (Bit 0)            */
#define BLE_BLE_DEBUGADDMIN_REG_EM_ADDMIN_Msk (0xffffUL)            /*!< BLE BLE_DEBUGADDMIN_REG: EM_ADDMIN (Bitfield-Mask: 0xffff) */
/* ==================================================  BLE_DEEPSLCNTL_REG  =================================================== */
#define BLE_BLE_DEEPSLCNTL_REG_EXTWKUPDSB_Pos (31UL)                /*!< BLE BLE_DEEPSLCNTL_REG: EXTWKUPDSB (Bit 31)           */
#define BLE_BLE_DEEPSLCNTL_REG_EXTWKUPDSB_Msk (0x80000000UL)        /*!< BLE BLE_DEEPSLCNTL_REG: EXTWKUPDSB (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_STAT_Pos (15UL)           /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_STAT (Bit 15)      */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_STAT_Msk (0x8000UL)       /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_STAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_SOFT_WAKEUP_REQ_Pos (4UL)            /*!< BLE BLE_DEEPSLCNTL_REG: SOFT_WAKEUP_REQ (Bit 4)       */
#define BLE_BLE_DEEPSLCNTL_REG_SOFT_WAKEUP_REQ_Msk (0x10UL)         /*!< BLE BLE_DEEPSLCNTL_REG: SOFT_WAKEUP_REQ (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_CORR_EN_Pos (3UL)         /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_CORR_EN (Bit 3)    */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_CORR_EN_Msk (0x8UL)       /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_CORR_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_ON_Pos (2UL)              /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_ON (Bit 2)         */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_ON_Msk (0x4UL)            /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_ON (Bitfield-Mask: 0x01) */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_IRQ_EN_Pos (0UL)          /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_IRQ_EN (Bit 0)     */
#define BLE_BLE_DEEPSLCNTL_REG_DEEP_SLEEP_IRQ_EN_Msk (0x3UL)        /*!< BLE BLE_DEEPSLCNTL_REG: DEEP_SLEEP_IRQ_EN (Bitfield-Mask: 0x03) */
/* ==================================================  BLE_DEEPSLSTAT_REG  =================================================== */
#define BLE_BLE_DEEPSLSTAT_REG_DEEPSLDUR_Pos (0UL)                  /*!< BLE BLE_DEEPSLSTAT_REG: DEEPSLDUR (Bit 0)             */
#define BLE_BLE_DEEPSLSTAT_REG_DEEPSLDUR_Msk (0xffffffffUL)         /*!< BLE BLE_DEEPSLSTAT_REG: DEEPSLDUR (Bitfield-Mask: 0xffffffff) */
/* ==================================================  BLE_DEEPSLWKUP_REG  =================================================== */
#define BLE_BLE_DEEPSLWKUP_REG_DEEPSLTIME_Pos (0UL)                 /*!< BLE BLE_DEEPSLWKUP_REG: DEEPSLTIME (Bit 0)            */
#define BLE_BLE_DEEPSLWKUP_REG_DEEPSLTIME_Msk (0xffffffffUL)        /*!< BLE BLE_DEEPSLWKUP_REG: DEEPSLTIME (Bitfield-Mask: 0xffffffff) */
/* ===================================================  BLE_DIAGCNTL2_REG  =================================================== */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_EN_Pos (31UL)                   /*!< BLE BLE_DIAGCNTL2_REG: DIAG7_EN (Bit 31)              */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_EN_Msk (0x80000000UL)           /*!< BLE BLE_DIAGCNTL2_REG: DIAG7_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_Pos   (24UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG7 (Bit 24)                 */
#define BLE_BLE_DIAGCNTL2_REG_DIAG7_Msk   (0x3f000000UL)            /*!< BLE BLE_DIAGCNTL2_REG: DIAG7 (Bitfield-Mask: 0x3f)    */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_EN_Pos (23UL)                   /*!< BLE BLE_DIAGCNTL2_REG: DIAG6_EN (Bit 23)              */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_EN_Msk (0x800000UL)             /*!< BLE BLE_DIAGCNTL2_REG: DIAG6_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_Pos   (16UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG6 (Bit 16)                 */
#define BLE_BLE_DIAGCNTL2_REG_DIAG6_Msk   (0x3f0000UL)              /*!< BLE BLE_DIAGCNTL2_REG: DIAG6 (Bitfield-Mask: 0x3f)    */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_EN_Pos (15UL)                   /*!< BLE BLE_DIAGCNTL2_REG: DIAG5_EN (Bit 15)              */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_EN_Msk (0x8000UL)               /*!< BLE BLE_DIAGCNTL2_REG: DIAG5_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_Pos   (8UL)                     /*!< BLE BLE_DIAGCNTL2_REG: DIAG5 (Bit 8)                  */
#define BLE_BLE_DIAGCNTL2_REG_DIAG5_Msk   (0x3f00UL)                /*!< BLE BLE_DIAGCNTL2_REG: DIAG5 (Bitfield-Mask: 0x3f)    */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_EN_Pos (7UL)                    /*!< BLE BLE_DIAGCNTL2_REG: DIAG4_EN (Bit 7)               */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_EN_Msk (0x80UL)                 /*!< BLE BLE_DIAGCNTL2_REG: DIAG4_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_Pos   (0UL)                     /*!< BLE BLE_DIAGCNTL2_REG: DIAG4 (Bit 0)                  */
#define BLE_BLE_DIAGCNTL2_REG_DIAG4_Msk   (0x3fUL)                  /*!< BLE BLE_DIAGCNTL2_REG: DIAG4 (Bitfield-Mask: 0x3f)    */
/* ===================================================  BLE_DIAGCNTL3_REG  =================================================== */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_INV_Pos (31UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_INV (Bit 31)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_INV_Msk (0x80000000UL)          /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_BIT_Pos (28UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_BIT (Bit 28)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG7_BIT_Msk (0x70000000UL)          /*!< BLE BLE_DIAGCNTL3_REG: DIAG7_BIT (Bitfield-Mask: 0x07) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_INV_Pos (27UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_INV (Bit 27)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_INV_Msk (0x8000000UL)           /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_BIT_Pos (24UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_BIT (Bit 24)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG6_BIT_Msk (0x7000000UL)           /*!< BLE BLE_DIAGCNTL3_REG: DIAG6_BIT (Bitfield-Mask: 0x07) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_INV_Pos (23UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_INV (Bit 23)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_INV_Msk (0x800000UL)            /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_BIT_Pos (20UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_BIT (Bit 20)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG5_BIT_Msk (0x700000UL)            /*!< BLE BLE_DIAGCNTL3_REG: DIAG5_BIT (Bitfield-Mask: 0x07) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_INV_Pos (19UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_INV (Bit 19)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_INV_Msk (0x80000UL)             /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_BIT_Pos (16UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_BIT (Bit 16)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG4_BIT_Msk (0x70000UL)             /*!< BLE BLE_DIAGCNTL3_REG: DIAG4_BIT (Bitfield-Mask: 0x07) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_INV_Pos (15UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_INV (Bit 15)             */
