S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_INV_Msk (0x8000UL)              /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_BIT_Pos (12UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_BIT (Bit 12)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG3_BIT_Msk (0x7000UL)              /*!< BLE BLE_DIAGCNTL3_REG: DIAG3_BIT (Bitfield-Mask: 0x07) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_INV_Pos (11UL)                  /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_INV (Bit 11)             */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_INV_Msk (0x800UL)               /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_BIT_Pos (8UL)                   /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_BIT (Bit 8)              */
#define BLE_BLE_DIAGCNTL3_REG_DIAG2_BIT_Msk (0x700UL)               /*!< BLE BLE_DIAGCNTL3_REG: DIAG2_BIT (Bitfield-Mask: 0x07) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_INV_Pos (7UL)                   /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_INV (Bit 7)              */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_INV_Msk (0x80UL)                /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_BIT_Pos (4UL)                   /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_BIT (Bit 4)              */
#define BLE_BLE_DIAGCNTL3_REG_DIAG1_BIT_Msk (0x70UL)                /*!< BLE BLE_DIAGCNTL3_REG: DIAG1_BIT (Bitfield-Mask: 0x07) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_INV_Pos (3UL)                   /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_INV (Bit 3)              */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_INV_Msk (0x8UL)                 /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_INV (Bitfield-Mask: 0x01) */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_BIT_Pos (0UL)                   /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_BIT (Bit 0)              */
#define BLE_BLE_DIAGCNTL3_REG_DIAG0_BIT_Msk (0x7UL)                 /*!< BLE BLE_DIAGCNTL3_REG: DIAG0_BIT (Bitfield-Mask: 0x07) */
/* ===================================================  BLE_DIAGCNTL_REG  ==================================================== */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_EN_Pos (31UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG3_EN (Bit 31)               */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_EN_Msk (0x80000000UL)            /*!< BLE BLE_DIAGCNTL_REG: DIAG3_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_Pos    (24UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG3 (Bit 24)                  */
#define BLE_BLE_DIAGCNTL_REG_DIAG3_Msk    (0x3f000000UL)            /*!< BLE BLE_DIAGCNTL_REG: DIAG3 (Bitfield-Mask: 0x3f)     */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_EN_Pos (23UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG2_EN (Bit 23)               */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_EN_Msk (0x800000UL)              /*!< BLE BLE_DIAGCNTL_REG: DIAG2_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_Pos    (16UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG2 (Bit 16)                  */
#define BLE_BLE_DIAGCNTL_REG_DIAG2_Msk    (0x3f0000UL)              /*!< BLE BLE_DIAGCNTL_REG: DIAG2 (Bitfield-Mask: 0x3f)     */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_EN_Pos (15UL)                    /*!< BLE BLE_DIAGCNTL_REG: DIAG1_EN (Bit 15)               */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_EN_Msk (0x8000UL)                /*!< BLE BLE_DIAGCNTL_REG: DIAG1_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_Pos    (8UL)                     /*!< BLE BLE_DIAGCNTL_REG: DIAG1 (Bit 8)                   */
#define BLE_BLE_DIAGCNTL_REG_DIAG1_Msk    (0x3f00UL)                /*!< BLE BLE_DIAGCNTL_REG: DIAG1 (Bitfield-Mask: 0x3f)     */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_EN_Pos (7UL)                     /*!< BLE BLE_DIAGCNTL_REG: DIAG0_EN (Bit 7)                */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_EN_Msk (0x80UL)                  /*!< BLE BLE_DIAGCNTL_REG: DIAG0_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_Pos    (0UL)                     /*!< BLE BLE_DIAGCNTL_REG: DIAG0 (Bit 0)                   */
#define BLE_BLE_DIAGCNTL_REG_DIAG0_Msk    (0x3fUL)                  /*!< BLE BLE_DIAGCNTL_REG: DIAG0 (Bitfield-Mask: 0x3f)     */
/* ===================================================  BLE_DIAGSTAT_REG  ==================================================== */
#define BLE_BLE_DIAGSTAT_REG_DIAG3STAT_Pos (24UL)                   /*!< BLE BLE_DIAGSTAT_REG: DIAG3STAT (Bit 24)              */
#define BLE_BLE_DIAGSTAT_REG_DIAG3STAT_Msk (0xff000000UL)           /*!< BLE BLE_DIAGSTAT_REG: DIAG3STAT (Bitfield-Mask: 0xff) */
#define BLE_BLE_DIAGSTAT_REG_DIAG2STAT_Pos (16UL)                   /*!< BLE BLE_DIAGSTAT_REG: DIAG2STAT (Bit 16)              */
#define BLE_BLE_DIAGSTAT_REG_DIAG2STAT_Msk (0xff0000UL)             /*!< BLE BLE_DIAGSTAT_REG: DIAG2STAT (Bitfield-Mask: 0xff) */
#define BLE_BLE_DIAGSTAT_REG_DIAG1STAT_Pos (8UL)                    /*!< BLE BLE_DIAGSTAT_REG: DIAG1STAT (Bit 8)               */
#define BLE_BLE_DIAGSTAT_REG_DIAG1STAT_Msk (0xff00UL)               /*!< BLE BLE_DIAGSTAT_REG: DIAG1STAT (Bitfield-Mask: 0xff) */
#define BLE_BLE_DIAGSTAT_REG_DIAG0STAT_Pos (0UL)                    /*!< BLE BLE_DIAGSTAT_REG: DIAG0STAT (Bit 0)               */
#define BLE_BLE_DIAGSTAT_REG_DIAG0STAT_Msk (0xffUL)                 /*!< BLE BLE_DIAGSTAT_REG: DIAG0STAT (Bitfield-Mask: 0xff) */
/* ====================================================  BLE_EM_BASE_REG  ==================================================== */
#define BLE_BLE_EM_BASE_REG_BLE_EM_BASE_16_10_Pos (10UL)            /*!< BLE BLE_EM_BASE_REG: BLE_EM_BASE_16_10 (Bit 10)       */
#define BLE_BLE_EM_BASE_REG_BLE_EM_BASE_16_10_Msk (0x1fc00UL)       /*!< BLE BLE_EM_BASE_REG: BLE_EM_BASE_16_10 (Bitfield-Mask: 0x7f) */
/* ===================================================  BLE_ENBPRESET_REG  =================================================== */
#define BLE_BLE_ENBPRESET_REG_TWEXT_Pos   (21UL)                    /*!< BLE BLE_ENBPRESET_REG: TWEXT (Bit 21)                 */
#define BLE_BLE_ENBPRESET_REG_TWEXT_Msk   (0xffe00000UL)            /*!< BLE BLE_ENBPRESET_REG: TWEXT (Bitfield-Mask: 0x7ff)   */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_SET_Pos (10UL)                  /*!< BLE BLE_ENBPRESET_REG: TWIRQ_SET (Bit 10)             */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_SET_Msk (0x1ffc00UL)            /*!< BLE BLE_ENBPRESET_REG: TWIRQ_SET (Bitfield-Mask: 0x7ff) */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_RESET_Pos (0UL)                 /*!< BLE BLE_ENBPRESET_REG: TWIRQ_RESET (Bit 0)            */
#define BLE_BLE_ENBPRESET_REG_TWIRQ_RESET_Msk (0x3ffUL)             /*!< BLE BLE_ENBPRESET_REG: TWIRQ_RESET (Bitfield-Mask: 0x3ff) */
/* =================================================  BLE_ERRORTYPESTAT_REG  ================================================= */
#define BLE_BLE_ERRORTYPESTAT_REG_CONCEVTIRQ_ERROR_Pos (17UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: CONCEVTIRQ_ERROR (Bit 17)  */
#define BLE_BLE_ERRORTYPESTAT_REG_CONCEVTIRQ_ERROR_Msk (0x20000UL)  /*!< BLE BLE_ERRORTYPESTAT_REG: CONCEVTIRQ_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDATA_PTR_ERROR_Pos (16UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: RXDATA_PTR_ERROR (Bit 16)  */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDATA_PTR_ERROR_Msk (0x10000UL)  /*!< BLE BLE_ERRORTYPESTAT_REG: RXDATA_PTR_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDATA_PTR_ERROR_Pos (15UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: TXDATA_PTR_ERROR (Bit 15)  */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDATA_PTR_ERROR_Msk (0x8000UL)   /*!< BLE BLE_ERRORTYPESTAT_REG: TXDATA_PTR_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDESC_EMPTY_ERROR_Pos (14UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: RXDESC_EMPTY_ERROR (Bit 14) */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDESC_EMPTY_ERROR_Msk (0x4000UL) /*!< BLE BLE_ERRORTYPESTAT_REG: RXDESC_EMPTY_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDESC_EMPTY_ERROR_Pos (13UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: TXDESC_EMPTY_ERROR (Bit 13) */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDESC_EMPTY_ERROR_Msk (0x2000UL) /*!< BLE BLE_ERRORTYPESTAT_REG: TXDESC_EMPTY_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_CSFORMAT_ERROR_Pos (12UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: CSFORMAT_ERROR (Bit 12)    */
#define BLE_BLE_ERRORTYPESTAT_REG_CSFORMAT_ERROR_Msk (0x1000UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: CSFORMAT_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_LLCHMAP_ERROR_Pos (11UL)          /*!< BLE BLE_ERRORTYPESTAT_REG: LLCHMAP_ERROR (Bit 11)     */
#define BLE_BLE_ERRORTYPESTAT_REG_LLCHMAP_ERROR_Msk (0x800UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: LLCHMAP_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_ADV_UNDERRUN_Pos (10UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: ADV_UNDERRUN (Bit 10)      */
#define BLE_BLE_ERRORTYPESTAT_REG_ADV_UNDERRUN_Msk (0x400UL)        /*!< BLE BLE_ERRORTYPESTAT_REG: ADV_UNDERRUN (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_IFS_UNDERRUN_Pos (9UL)            /*!< BLE BLE_ERRORTYPESTAT_REG: IFS_UNDERRUN (Bit 9)       */
#define BLE_BLE_ERRORTYPESTAT_REG_IFS_UNDERRUN_Msk (0x200UL)        /*!< BLE BLE_ERRORTYPESTAT_REG: IFS_UNDERRUN (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_WHITELIST_ERROR_Pos (8UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: WHITELIST_ERROR (Bit 8)    */
#define BLE_BLE_ERRORTYPESTAT_REG_WHITELIST_ERROR_Msk (0x100UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: WHITELIST_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_CNTL_APFM_ERROR_Pos (7UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_CNTL_APFM_ERROR (Bit 7) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_CNTL_APFM_ERROR_Msk (0x80UL)  /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_CNTL_APFM_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_APFM_ERROR_Pos (6UL)    /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_APFM_ERROR (Bit 6) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_APFM_ERROR_Msk (0x40UL) /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_APFM_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_ENTRY_ERROR_Pos (5UL)   /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_ENTRY_ERROR (Bit 5) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_ENTRY_ERROR_Msk (0x20UL) /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_ENTRY_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_EMACC_ERROR_Pos (4UL)   /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_EMACC_ERROR (Bit 4) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_EMACC_ERROR_Msk (0x10UL) /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_EMACC_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RADIO_EMACC_ERROR_Pos (3UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: RADIO_EMACC_ERROR (Bit 3)  */
#define BLE_BLE_ERRORTYPESTAT_REG_RADIO_EMACC_ERROR_Msk (0x8UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: RADIO_EMACC_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_PKTCNTL_EMACC_ERROR_Pos (2UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: PKTCNTL_EMACC_ERROR (Bit 2) */
#define BLE_BLE_ERRORTYPESTAT_REG_PKTCNTL_EMACC_ERROR_Msk (0x4UL)   /*!< BLE BLE_ERRORTYPESTAT_REG: PKTCNTL_EMACC_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RXCRYPT_ERROR_Pos (1UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: RXCRYPT_ERROR (Bit 1)      */
#define BLE_BLE_ERRORTYPESTAT_REG_RXCRYPT_ERROR_Msk (0x2UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: RXCRYPT_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_TXCRYPT_ERROR_Pos (0UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: TXCRYPT_ERROR (Bit 0)      */
#define BLE_BLE_ERRORTYPESTAT_REG_TXCRYPT_ERROR_Msk (0x1UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: TXCRYPT_ERROR (Bitfield-Mask: 0x01) */
/* ==================================================  BLE_FINECNTCORR_REG  ================================================== */
#define BLE_BLE_FINECNTCORR_REG_FINECNTCORR_Pos (0UL)               /*!< BLE BLE_FINECNTCORR_REG: FINECNTCORR (Bit 0)          */
#define BLE_BLE_FINECNTCORR_REG_FINECNTCORR_Msk (0x3ffUL)           /*!< BLE BLE_FINECNTCORR_REG: FINECNTCORR (Bitfield-Mask: 0x3ff) */
/* ==================================================  BLE_FINETIMECNT_REG  ================================================== */
#define BLE_BLE_FINETIMECNT_REG_FINECNT_Pos (0UL)                   /*!< BLE BLE_FINETIMECNT_REG: FINECNT (Bit 0)              */
#define BLE_BLE_FINETIMECNT_REG_FINECNT_Msk (0x3ffUL)               /*!< BLE BLE_FINETIMECNT_REG: FINECNT (Bitfield-Mask: 0x3ff) */
/* ==================================================  BLE_FINETIMTGT_REG  =================================================== */
#define BLE_BLE_FINETIMTGT_REG_FINETARGET_Pos (0UL)                 /*!< BLE BLE_FINETIMTGT_REG: FINETARGET (Bit 0)            */
#define BLE_BLE_FINETIMTGT_REG_FINETARGET_Msk (0x7ffffffUL)         /*!< BLE BLE_FINETIMTGT_REG: FINETARGET (Bitfield-Mask: 0x7ffffff) */
/* ==================================================  BLE_GROSSTIMTGT_REG  ================================================== */
#define BLE_BLE_GROSSTIMTGT_REG_GROSSTARGET_Pos (0UL)               /*!< BLE BLE_GROSSTIMTGT_REG: GROSSTARGET (Bit 0)          */
#define BLE_BLE_GROSSTIMTGT_REG_GROSSTARGET_Msk (0x7fffffUL)        /*!< BLE BLE_GROSSTIMTGT_REG: GROSSTARGET (Bitfield-Mask: 0x7fffff) */
/* ====================================================  BLE_INTACK_REG  ===================================================== */
#define BLE_BLE_INTACK_REG_SWINTACK_Pos   (9UL)                     /*!< BLE BLE_INTACK_REG: SWINTACK (Bit 9)                  */
#define BLE_BLE_INTACK_REG_SWINTACK_Msk   (0x200UL)                 /*!< BLE BLE_INTACK_REG: SWINTACK (Bitfield-Mask: 0x01)    */
#define BLE_BLE_INTACK_REG_EVENTAPFAINTACK_Pos (8UL)                /*!< BLE BLE_INTACK_REG: EVENTAPFAINTACK (Bit 8)           */
#define BLE_BLE_INTACK_REG_EVENTAPFAINTACK_Msk (0x100UL)            /*!< BLE BLE_INTACK_REG: EVENTAPFAINTACK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTACK_REG_FINETGTIMINTACK_Pos (7UL)                /*!< BLE BLE_INTACK_REG: FINETGTIMINTACK (Bit 7)           */
#define BLE_BLE_INTACK_REG_FINETGTIMINTACK_Msk (0x80UL)             /*!< BLE BLE_INTACK_REG: FINETGTIMINTACK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTACK_REG_GROSSTGTIMINTACK_Pos (6UL)               /*!< BLE BLE_INTACK_REG: GROSSTGTIMINTACK (Bit 6)          */
#define BLE_BLE_INTACK_REG_GROSSTGTIMINTACK_Msk (0x40UL)            /*!< BLE BLE_INTACK_REG: GROSSTGTIMINTACK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTACK_REG_ERRORINTACK_Pos (5UL)                    /*!< BLE BLE_INTACK_REG: ERRORINTACK (Bit 5)               */
#define BLE_BLE_INTACK_REG_ERRORINTACK_Msk (0x20UL)                 /*!< BLE BLE_INTACK_REG: ERRORINTACK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTACK_REG_CRYPTINTACK_Pos (4UL)                    /*!< BLE BLE_INTACK_REG: CRYPTINTACK (Bit 4)               */
#define BLE_BLE_INTACK_REG_CRYPTINTACK_Msk (0x10UL)                 /*!< BLE BLE_INTACK_REG: CRYPTINTACK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTACK_REG_EVENTINTACK_Pos (3UL)                    /*!< BLE BLE_INTACK_REG: EVENTINTACK (Bit 3)               */
#define BLE_BLE_INTACK_REG_EVENTINTACK_Msk (0x8UL)                  /*!< BLE BLE_INTACK_REG: EVENTINTACK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTACK_REG_SLPINTACK_Pos  (2UL)                     /*!< BLE BLE_INTACK_REG: SLPINTACK (Bit 2)                 */
#define BLE_BLE_INTACK_REG_SLPINTACK_Msk  (0x4UL)                   /*!< BLE BLE_INTACK_REG: SLPINTACK (Bitfield-Mask: 0x01)   */
#define BLE_BLE_INTACK_REG_RXINTACK_Pos   (1UL)                     /*!< BLE BLE_INTACK_REG: RXINTACK (Bit 1)                  */
#define BLE_BLE_INTACK_REG_RXINTACK_Msk   (0x2UL)                   /*!< BLE BLE_INTACK_REG: RXINTACK (Bitfield-Mask: 0x01)    */
#define BLE_BLE_INTACK_REG_CSCNTINTACK_Pos (0UL)                    /*!< BLE BLE_INTACK_REG: CSCNTINTACK (Bit 0)               */
#define BLE_BLE_INTACK_REG_CSCNTINTACK_Msk (0x1UL)                  /*!< BLE BLE_INTACK_REG: CSCNTINTACK (Bitfield-Mask: 0x01) */
/* ====================================================  BLE_INTCNTL_REG  ==================================================== */
#define BLE_BLE_INTCNTL_REG_CSCNTDEVMSK_Pos (15UL)                  /*!< BLE BLE_INTCNTL_REG: CSCNTDEVMSK (Bit 15)             */
#define BLE_BLE_INTCNTL_REG_CSCNTDEVMSK_Msk (0x8000UL)              /*!< BLE BLE_INTCNTL_REG: CSCNTDEVMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_SWINTMSK_Pos  (9UL)                     /*!< BLE BLE_INTCNTL_REG: SWINTMSK (Bit 9)                 */
#define BLE_BLE_INTCNTL_REG_SWINTMSK_Msk  (0x200UL)                 /*!< BLE BLE_INTCNTL_REG: SWINTMSK (Bitfield-Mask: 0x01)   */
#define BLE_BLE_INTCNTL_REG_EVENTAPFAINTMSK_Pos (8UL)               /*!< BLE BLE_INTCNTL_REG: EVENTAPFAINTMSK (Bit 8)          */
#define BLE_BLE_INTCNTL_REG_EVENTAPFAINTMSK_Msk (0x100UL)           /*!< BLE BLE_INTCNTL_REG: EVENTAPFAINTMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_FINETGTIMINTMSK_Pos (7UL)               /*!< BLE BLE_INTCNTL_REG: FINETGTIMINTMSK (Bit 7)          */
#define BLE_BLE_INTCNTL_REG_FINETGTIMINTMSK_Msk (0x80UL)            /*!< BLE BLE_INTCNTL_REG: FINETGTIMINTMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_GROSSTGTIMINTMSK_Pos (6UL)              /*!< BLE BLE_INTCNTL_REG: GROSSTGTIMINTMSK (Bit 6)         */
#define BLE_BLE_INTCNTL_REG_GROSSTGTIMINTMSK_Msk (0x40UL)           /*!< BLE BLE_INTCNTL_REG: GROSSTGTIMINTMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_ERRORINTMSK_Pos (5UL)                   /*!< BLE BLE_INTCNTL_REG: ERRORINTMSK (Bit 5)              */
#define BLE_BLE_INTCNTL_REG_ERRORINTMSK_Msk (0x20UL)                /*!< BLE BLE_INTCNTL_REG: ERRORINTMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_CRYPTINTMSK_Pos (4UL)                   /*!< BLE BLE_INTCNTL_REG: CRYPTINTMSK (Bit 4)              */
#define BLE_BLE_INTCNTL_REG_CRYPTINTMSK_Msk (0x10UL)                /*!< BLE BLE_INTCNTL_REG: CRYPTINTMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_EVENTINTMSK_Pos (3UL)                   /*!< BLE BLE_INTCNTL_REG: EVENTINTMSK (Bit 3)              */
#define BLE_BLE_INTCNTL_REG_EVENTINTMSK_Msk (0x8UL)                 /*!< BLE BLE_INTCNTL_REG: EVENTINTMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_SLPINTMSK_Pos (2UL)                     /*!< BLE BLE_INTCNTL_REG: SLPINTMSK (Bit 2)                */
#define BLE_BLE_INTCNTL_REG_SLPINTMSK_Msk (0x4UL)                   /*!< BLE BLE_INTCNTL_REG: SLPINTMSK (Bitfield-Mask: 0x01)  */
#define BLE_BLE_INTCNTL_REG_RXINTMSK_Pos  (1UL)                     /*!< BLE BLE_INTCNTL_REG: RXINTMSK (Bit 1)                 */
#define BLE_BLE_INTCNTL_REG_RXINTMSK_Msk  (0x2UL)                   /*!< BLE BLE_INTCNTL_REG: RXINTMSK (Bitfield-Mask: 0x01)   */
#define BLE_BLE_INTCNTL_REG_CSCNTINTMSK_Pos (0UL)                   /*!< BLE BLE_INTCNTL_REG: CSCNTINTMSK (Bit 0)              */
#define BLE_BLE_INTCNTL_REG_CSCNTINTMSK_Msk (0x1UL)                 /*!< BLE BLE_INTCNTL_REG: CSCNTINTMSK (Bitfield-Mask: 0x01) */
/* ==================================================  BLE_INTRAWSTAT_REG  =================================================== */
#define BLE_BLE_INTRAWSTAT_REG_SWINTRAWSTAT_Pos (9UL)               /*!< BLE BLE_INTRAWSTAT_REG: SWINTRAWSTAT (Bit 9)          */
#define BLE_BLE_INTRAWSTAT_REG_SWINTRAWSTAT_Msk (0x200UL)           /*!< BLE BLE_INTRAWSTAT_REG: SWINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_EVENTAPFAINTRAWSTAT_Pos (8UL)        /*!< BLE BLE_INTRAWSTAT_REG: EVENTAPFAINTRAWSTAT (Bit 8)   */
#define BLE_BLE_INTRAWSTAT_REG_EVENTAPFAINTRAWSTAT_Msk (0x100UL)    /*!< BLE BLE_INTRAWSTAT_REG: EVENTAPFAINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_FINETGTIMINTRAWSTAT_Pos (7UL)        /*!< BLE BLE_INTRAWSTAT_REG: FINETGTIMINTRAWSTAT (Bit 7)   */
#define BLE_BLE_INTRAWSTAT_REG_FINETGTIMINTRAWSTAT_Msk (0x80UL)     /*!< BLE BLE_INTRAWSTAT_REG: FINETGTIMINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_GROSSTGTIMINTRAWSTAT_Pos (6UL)       /*!< BLE BLE_INTRAWSTAT_REG: GROSSTGTIMINTRAWSTAT (Bit 6)  */
#define BLE_BLE_INTRAWSTAT_REG_GROSSTGTIMINTRAWSTAT_Msk (0x40UL)    /*!< BLE BLE_INTRAWSTAT_REG: GROSSTGTIMINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_ERRORINTRAWSTAT_Pos (5UL)            /*!< BLE BLE_INTRAWSTAT_REG: ERRORINTRAWSTAT (Bit 5)       */
#define BLE_BLE_INTRAWSTAT_REG_ERRORINTRAWSTAT_Msk (0x20UL)         /*!< BLE BLE_INTRAWSTAT_REG: ERRORINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_CRYPTINTRAWSTAT_Pos (4UL)            /*!< BLE BLE_INTRAWSTAT_REG: CRYPTINTRAWSTAT (Bit 4)       */
#define BLE_BLE_INTRAWSTAT_REG_CRYPTINTRAWSTAT_Msk (0x10UL)         /*!< BLE BLE_INTRAWSTAT_REG: CRYPTINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_EVENTINTRAWSTAT_Pos (3UL)            /*!< BLE BLE_INTRAWSTAT_REG: EVENTINTRAWSTAT (Bit 3)       */
#define BLE_BLE_INTRAWSTAT_REG_EVENTINTRAWSTAT_Msk (0x8UL)          /*!< BLE BLE_INTRAWSTAT_REG: EVENTINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_SLPINTRAWSTAT_Pos (2UL)              /*!< BLE BLE_INTRAWSTAT_REG: SLPINTRAWSTAT (Bit 2)         */
#define BLE_BLE_INTRAWSTAT_REG_SLPINTRAWSTAT_Msk (0x4UL)            /*!< BLE BLE_INTRAWSTAT_REG: SLPINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_RXINTRAWSTAT_Pos (1UL)               /*!< BLE BLE_INTRAWSTAT_REG: RXINTRAWSTAT (Bit 1)          */
#define BLE_BLE_INTRAWSTAT_REG_RXINTRAWSTAT_Msk (0x2UL)             /*!< BLE BLE_INTRAWSTAT_REG: RXINTRAWSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTRAWSTAT_REG_CSCNTINTRAWSTAT_Pos (0UL)            /*!< BLE BLE_INTRAWSTAT_REG: CSCNTINTRAWSTAT (Bit 0)       */
#define BLE_BLE_INTRAWSTAT_REG_CSCNTINTRAWSTAT_Msk (0x1UL)          /*!< BLE BLE_INTRAWSTAT_REG: CSCNTINTRAWSTAT (Bitfield-Mask: 0x01) */
/* ====================================================  BLE_INTSTAT_REG  ==================================================== */
#define BLE_BLE_INTSTAT_REG_SWINTSTAT_Pos (9UL)                     /*!< BLE BLE_INTSTAT_REG: SWINTSTAT (Bit 9)                */
#define BLE_BLE_INTSTAT_REG_SWINTSTAT_Msk (0x200UL)                 /*!< BLE BLE_INTSTAT_REG: SWINTSTAT (Bitfield-Mask: 0x01)  */
#define BLE_BLE_INTSTAT_REG_EVENTAPFAINTSTAT_Pos (8UL)              /*!< BLE BLE_INTSTAT_REG: EVENTAPFAINTSTAT (Bit 8)         */
#define BLE_BLE_INTSTAT_REG_EVENTAPFAINTSTAT_Msk (0x100UL)          /*!< BLE BLE_INTSTAT_REG: EVENTAPFAINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_FINETGTIMINTSTAT_Pos (7UL)              /*!< BLE BLE_INTSTAT_REG: FINETGTIMINTSTAT (Bit 7)         */
#define BLE_BLE_INTSTAT_REG_FINETGTIMINTSTAT_Msk (0x80UL)           /*!< BLE BLE_INTSTAT_REG: FINETGTIMINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_GROSSTGTIMINTSTAT_Pos (6UL)             /*!< BLE BLE_INTSTAT_REG: GROSSTGTIMINTSTAT (Bit 6)        */
#define BLE_BLE_INTSTAT_REG_GROSSTGTIMINTSTAT_Msk (0x40UL)          /*!< BLE BLE_INTSTAT_REG: GROSSTGTIMINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_ERRORINTSTAT_Pos (5UL)                  /*!< BLE BLE_INTSTAT_REG: ERRORINTSTAT (Bit 5)             */
#define BLE_BLE_INTSTAT_REG_ERRORINTSTAT_Msk (0x20UL)               /*!< BLE BLE_INTSTAT_REG: ERRORINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_CRYPTINTSTAT_Pos (4UL)                  /*!< BLE BLE_INTSTAT_REG: CRYPTINTSTAT (Bit 4)             */
#define BLE_BLE_INTSTAT_REG_CRYPTINTSTAT_Msk (0x10UL)               /*!< BLE BLE_INTSTAT_REG: CRYPTINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_EVENTINTSTAT_Pos (3UL)                  /*!< BLE BLE_INTSTAT_REG: EVENTINTSTAT (Bit 3)             */
#define BLE_BLE_INTSTAT_REG_EVENTINTSTAT_Msk (0x8UL)                /*!< BLE BLE_INTSTAT_REG: EVENTINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_SLPINTSTAT_Pos (2UL)                    /*!< BLE BLE_INTSTAT_REG: SLPINTSTAT (Bit 2)               */
