S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define BLE_BLE_INTSTAT_REG_SLPINTSTAT_Msk (0x4UL)                  /*!< BLE BLE_INTSTAT_REG: SLPINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_RXINTSTAT_Pos (1UL)                     /*!< BLE BLE_INTSTAT_REG: RXINTSTAT (Bit 1)                */
#define BLE_BLE_INTSTAT_REG_RXINTSTAT_Msk (0x2UL)                   /*!< BLE BLE_INTSTAT_REG: RXINTSTAT (Bitfield-Mask: 0x01)  */
#define BLE_BLE_INTSTAT_REG_CSCNTINTSTAT_Pos (0UL)                  /*!< BLE BLE_INTSTAT_REG: CSCNTINTSTAT (Bit 0)             */
#define BLE_BLE_INTSTAT_REG_CSCNTINTSTAT_Msk (0x1UL)                /*!< BLE BLE_INTSTAT_REG: CSCNTINTSTAT (Bitfield-Mask: 0x01) */
/* ==================================================  BLE_RADIOCNTL0_REG  =================================================== */
/* ==================================================  BLE_RADIOCNTL1_REG  =================================================== */
#define BLE_BLE_RADIOCNTL1_REG_XRFSEL_Pos (16UL)                    /*!< BLE BLE_RADIOCNTL1_REG: XRFSEL (Bit 16)               */
#define BLE_BLE_RADIOCNTL1_REG_XRFSEL_Msk (0x1f0000UL)              /*!< BLE BLE_RADIOCNTL1_REG: XRFSEL (Bitfield-Mask: 0x1f)  */
/* ==================================================  BLE_RADIOCNTL2_REG  =================================================== */
/* ==================================================  BLE_RADIOCNTL3_REG  =================================================== */
/* =================================================  BLE_RADIOPWRUPDN_REG  ================================================== */
#define BLE_BLE_RADIOPWRUPDN_REG_RTRIP_DELAY_Pos (24UL)             /*!< BLE BLE_RADIOPWRUPDN_REG: RTRIP_DELAY (Bit 24)        */
#define BLE_BLE_RADIOPWRUPDN_REG_RTRIP_DELAY_Msk (0x7f000000UL)     /*!< BLE BLE_RADIOPWRUPDN_REG: RTRIP_DELAY (Bitfield-Mask: 0x7f) */
#define BLE_BLE_RADIOPWRUPDN_REG_RXPWRUP_Pos (16UL)                 /*!< BLE BLE_RADIOPWRUPDN_REG: RXPWRUP (Bit 16)            */
#define BLE_BLE_RADIOPWRUPDN_REG_RXPWRUP_Msk (0xff0000UL)           /*!< BLE BLE_RADIOPWRUPDN_REG: RXPWRUP (Bitfield-Mask: 0xff) */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRDN_Pos (8UL)                  /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRDN (Bit 8)             */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRDN_Msk (0xf00UL)              /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRDN (Bitfield-Mask: 0x0f) */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRUP_Pos (0UL)                  /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRUP (Bit 0)             */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRUP_Msk (0xffUL)               /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRUP (Bitfield-Mask: 0xff) */
/* ==================================================  BLE_RFTESTCNTL_REG  =================================================== */
#define BLE_BLE_RFTESTCNTL_REG_INFINITERX_Pos (31UL)                /*!< BLE BLE_RFTESTCNTL_REG: INFINITERX (Bit 31)           */
#define BLE_BLE_RFTESTCNTL_REG_INFINITERX_Msk (0x80000000UL)        /*!< BLE BLE_RFTESTCNTL_REG: INFINITERX (Bitfield-Mask: 0x01) */
#define BLE_BLE_RFTESTCNTL_REG_RXPKTCNTEN_Pos (27UL)                /*!< BLE BLE_RFTESTCNTL_REG: RXPKTCNTEN (Bit 27)           */
#define BLE_BLE_RFTESTCNTL_REG_RXPKTCNTEN_Msk (0x8000000UL)         /*!< BLE BLE_RFTESTCNTL_REG: RXPKTCNTEN (Bitfield-Mask: 0x01) */
#define BLE_BLE_RFTESTCNTL_REG_INFINITETX_Pos (15UL)                /*!< BLE BLE_RFTESTCNTL_REG: INFINITETX (Bit 15)           */
#define BLE_BLE_RFTESTCNTL_REG_INFINITETX_Msk (0x8000UL)            /*!< BLE BLE_RFTESTCNTL_REG: INFINITETX (Bitfield-Mask: 0x01) */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTHSRC_Pos (14UL)               /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTHSRC (Bit 14)          */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTHSRC_Msk (0x4000UL)           /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTHSRC (Bitfield-Mask: 0x01) */
#define BLE_BLE_RFTESTCNTL_REG_PRBSTYPE_Pos (13UL)                  /*!< BLE BLE_RFTESTCNTL_REG: PRBSTYPE (Bit 13)             */
#define BLE_BLE_RFTESTCNTL_REG_PRBSTYPE_Msk (0x2000UL)              /*!< BLE BLE_RFTESTCNTL_REG: PRBSTYPE (Bitfield-Mask: 0x01) */
#define BLE_BLE_RFTESTCNTL_REG_TXPLDSRC_Pos (12UL)                  /*!< BLE BLE_RFTESTCNTL_REG: TXPLDSRC (Bit 12)             */
#define BLE_BLE_RFTESTCNTL_REG_TXPLDSRC_Msk (0x1000UL)              /*!< BLE BLE_RFTESTCNTL_REG: TXPLDSRC (Bitfield-Mask: 0x01) */
#define BLE_BLE_RFTESTCNTL_REG_TXPKTCNTEN_Pos (11UL)                /*!< BLE BLE_RFTESTCNTL_REG: TXPKTCNTEN (Bit 11)           */
#define BLE_BLE_RFTESTCNTL_REG_TXPKTCNTEN_Msk (0x800UL)             /*!< BLE BLE_RFTESTCNTL_REG: TXPKTCNTEN (Bitfield-Mask: 0x01) */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTH_Pos (0UL)                   /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTH (Bit 0)              */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTH_Msk (0x1ffUL)               /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTH (Bitfield-Mask: 0x1ff) */
/* =================================================  BLE_RFTESTRXSTAT_REG  ================================================== */
#define BLE_BLE_RFTESTRXSTAT_REG_RXPKTCNT_Pos (0UL)                 /*!< BLE BLE_RFTESTRXSTAT_REG: RXPKTCNT (Bit 0)            */
#define BLE_BLE_RFTESTRXSTAT_REG_RXPKTCNT_Msk (0xffffffffUL)        /*!< BLE BLE_RFTESTRXSTAT_REG: RXPKTCNT (Bitfield-Mask: 0xffffffff) */
/* =================================================  BLE_RFTESTTXSTAT_REG  ================================================== */
#define BLE_BLE_RFTESTTXSTAT_REG_TXPKTCNT_Pos (0UL)                 /*!< BLE BLE_RFTESTTXSTAT_REG: TXPKTCNT (Bit 0)            */
#define BLE_BLE_RFTESTTXSTAT_REG_TXPKTCNT_Msk (0xffffffffUL)        /*!< BLE BLE_RFTESTTXSTAT_REG: TXPKTCNT (Bitfield-Mask: 0xffffffff) */
/* ===================================================  BLE_RWBLECNTL_REG  =================================================== */
#define BLE_BLE_RWBLECNTL_REG_MASTER_SOFT_RST_Pos (31UL)            /*!< BLE BLE_RWBLECNTL_REG: MASTER_SOFT_RST (Bit 31)       */
#define BLE_BLE_RWBLECNTL_REG_MASTER_SOFT_RST_Msk (0x80000000UL)    /*!< BLE BLE_RWBLECNTL_REG: MASTER_SOFT_RST (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_MASTER_TGSOFT_RST_Pos (30UL)          /*!< BLE BLE_RWBLECNTL_REG: MASTER_TGSOFT_RST (Bit 30)     */
#define BLE_BLE_RWBLECNTL_REG_MASTER_TGSOFT_RST_Msk (0x40000000UL)  /*!< BLE BLE_RWBLECNTL_REG: MASTER_TGSOFT_RST (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_REG_SOFT_RST_Pos (29UL)               /*!< BLE BLE_RWBLECNTL_REG: REG_SOFT_RST (Bit 29)          */
#define BLE_BLE_RWBLECNTL_REG_REG_SOFT_RST_Msk (0x20000000UL)       /*!< BLE BLE_RWBLECNTL_REG: REG_SOFT_RST (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_SWINT_REQ_Pos (28UL)                  /*!< BLE BLE_RWBLECNTL_REG: SWINT_REQ (Bit 28)             */
#define BLE_BLE_RWBLECNTL_REG_SWINT_REQ_Msk (0x10000000UL)          /*!< BLE BLE_RWBLECNTL_REG: SWINT_REQ (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_RFTEST_ABORT_Pos (26UL)               /*!< BLE BLE_RWBLECNTL_REG: RFTEST_ABORT (Bit 26)          */
#define BLE_BLE_RWBLECNTL_REG_RFTEST_ABORT_Msk (0x4000000UL)        /*!< BLE BLE_RWBLECNTL_REG: RFTEST_ABORT (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_ADVERT_ABORT_Pos (25UL)               /*!< BLE BLE_RWBLECNTL_REG: ADVERT_ABORT (Bit 25)          */
#define BLE_BLE_RWBLECNTL_REG_ADVERT_ABORT_Msk (0x2000000UL)        /*!< BLE BLE_RWBLECNTL_REG: ADVERT_ABORT (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_SCAN_ABORT_Pos (24UL)                 /*!< BLE BLE_RWBLECNTL_REG: SCAN_ABORT (Bit 24)            */
#define BLE_BLE_RWBLECNTL_REG_SCAN_ABORT_Msk (0x1000000UL)          /*!< BLE BLE_RWBLECNTL_REG: SCAN_ABORT (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_MD_DSB_Pos  (22UL)                    /*!< BLE BLE_RWBLECNTL_REG: MD_DSB (Bit 22)                */
#define BLE_BLE_RWBLECNTL_REG_MD_DSB_Msk  (0x400000UL)              /*!< BLE BLE_RWBLECNTL_REG: MD_DSB (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RWBLECNTL_REG_SN_DSB_Pos  (21UL)                    /*!< BLE BLE_RWBLECNTL_REG: SN_DSB (Bit 21)                */
#define BLE_BLE_RWBLECNTL_REG_SN_DSB_Msk  (0x200000UL)              /*!< BLE BLE_RWBLECNTL_REG: SN_DSB (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RWBLECNTL_REG_NESN_DSB_Pos (20UL)                   /*!< BLE BLE_RWBLECNTL_REG: NESN_DSB (Bit 20)              */
#define BLE_BLE_RWBLECNTL_REG_NESN_DSB_Msk (0x100000UL)             /*!< BLE BLE_RWBLECNTL_REG: NESN_DSB (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_CRYPT_DSB_Pos (19UL)                  /*!< BLE BLE_RWBLECNTL_REG: CRYPT_DSB (Bit 19)             */
#define BLE_BLE_RWBLECNTL_REG_CRYPT_DSB_Msk (0x80000UL)             /*!< BLE BLE_RWBLECNTL_REG: CRYPT_DSB (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_WHIT_DSB_Pos (18UL)                   /*!< BLE BLE_RWBLECNTL_REG: WHIT_DSB (Bit 18)              */
#define BLE_BLE_RWBLECNTL_REG_WHIT_DSB_Msk (0x40000UL)              /*!< BLE BLE_RWBLECNTL_REG: WHIT_DSB (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_CRC_DSB_Pos (17UL)                    /*!< BLE BLE_RWBLECNTL_REG: CRC_DSB (Bit 17)               */
#define BLE_BLE_RWBLECNTL_REG_CRC_DSB_Msk (0x20000UL)               /*!< BLE BLE_RWBLECNTL_REG: CRC_DSB (Bitfield-Mask: 0x01)  */
#define BLE_BLE_RWBLECNTL_REG_HOP_REMAP_DSB_Pos (16UL)              /*!< BLE BLE_RWBLECNTL_REG: HOP_REMAP_DSB (Bit 16)         */
#define BLE_BLE_RWBLECNTL_REG_HOP_REMAP_DSB_Msk (0x10000UL)         /*!< BLE BLE_RWBLECNTL_REG: HOP_REMAP_DSB (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_CORR_MODE_Pos (12UL)                  /*!< BLE BLE_RWBLECNTL_REG: CORR_MODE (Bit 12)             */
#define BLE_BLE_RWBLECNTL_REG_CORR_MODE_Msk (0x3000UL)              /*!< BLE BLE_RWBLECNTL_REG: CORR_MODE (Bitfield-Mask: 0x03) */
#define BLE_BLE_RWBLECNTL_REG_ADVERTFILT_EN_Pos (9UL)               /*!< BLE BLE_RWBLECNTL_REG: ADVERTFILT_EN (Bit 9)          */
#define BLE_BLE_RWBLECNTL_REG_ADVERTFILT_EN_Msk (0x200UL)           /*!< BLE BLE_RWBLECNTL_REG: ADVERTFILT_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_RWBLE_EN_Pos (8UL)                    /*!< BLE BLE_RWBLECNTL_REG: RWBLE_EN (Bit 8)               */
#define BLE_BLE_RWBLECNTL_REG_RWBLE_EN_Msk (0x100UL)                /*!< BLE BLE_RWBLECNTL_REG: RWBLE_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_RXWINSZDEF_Pos (4UL)                  /*!< BLE BLE_RWBLECNTL_REG: RXWINSZDEF (Bit 4)             */
#define BLE_BLE_RWBLECNTL_REG_RXWINSZDEF_Msk (0xf0UL)               /*!< BLE BLE_RWBLECNTL_REG: RXWINSZDEF (Bitfield-Mask: 0x0f) */
#define BLE_BLE_RWBLECNTL_REG_SYNCERR_Pos (0UL)                     /*!< BLE BLE_RWBLECNTL_REG: SYNCERR (Bit 0)                */
#define BLE_BLE_RWBLECNTL_REG_SYNCERR_Msk (0x7UL)                   /*!< BLE BLE_RWBLECNTL_REG: SYNCERR (Bitfield-Mask: 0x07)  */
/* ===================================================  BLE_RWBLECONF_REG  =================================================== */
#define BLE_BLE_RWBLECONF_REG_ADD_WIDTH_Pos (24UL)                  /*!< BLE BLE_RWBLECONF_REG: ADD_WIDTH (Bit 24)             */
#define BLE_BLE_RWBLECONF_REG_ADD_WIDTH_Msk (0x3f000000UL)          /*!< BLE BLE_RWBLECONF_REG: ADD_WIDTH (Bitfield-Mask: 0x3f) */
#define BLE_BLE_RWBLECONF_REG_RFIF_Pos    (16UL)                    /*!< BLE BLE_RWBLECONF_REG: RFIF (Bit 16)                  */
#define BLE_BLE_RWBLECONF_REG_RFIF_Msk    (0x7f0000UL)              /*!< BLE BLE_RWBLECONF_REG: RFIF (Bitfield-Mask: 0x7f)     */
#define BLE_BLE_RWBLECONF_REG_CLK_SEL_Pos (8UL)                     /*!< BLE BLE_RWBLECONF_REG: CLK_SEL (Bit 8)                */
#define BLE_BLE_RWBLECONF_REG_CLK_SEL_Msk (0x3f00UL)                /*!< BLE BLE_RWBLECONF_REG: CLK_SEL (Bitfield-Mask: 0x3f)  */
#define BLE_BLE_RWBLECONF_REG_DECIPHER_Pos (6UL)                    /*!< BLE BLE_RWBLECONF_REG: DECIPHER (Bit 6)               */
#define BLE_BLE_RWBLECONF_REG_DECIPHER_Msk (0x40UL)                 /*!< BLE BLE_RWBLECONF_REG: DECIPHER (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECONF_REG_DMMODE_Pos  (5UL)                     /*!< BLE BLE_RWBLECONF_REG: DMMODE (Bit 5)                 */
#define BLE_BLE_RWBLECONF_REG_DMMODE_Msk  (0x20UL)                  /*!< BLE BLE_RWBLECONF_REG: DMMODE (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RWBLECONF_REG_INTMODE_Pos (4UL)                     /*!< BLE BLE_RWBLECONF_REG: INTMODE (Bit 4)                */
#define BLE_BLE_RWBLECONF_REG_INTMODE_Msk (0x10UL)                  /*!< BLE BLE_RWBLECONF_REG: INTMODE (Bitfield-Mask: 0x01)  */
#define BLE_BLE_RWBLECONF_REG_COEX_Pos    (3UL)                     /*!< BLE BLE_RWBLECONF_REG: COEX (Bit 3)                   */
#define BLE_BLE_RWBLECONF_REG_COEX_Msk    (0x8UL)                   /*!< BLE BLE_RWBLECONF_REG: COEX (Bitfield-Mask: 0x01)     */
#define BLE_BLE_RWBLECONF_REG_USEDBG_Pos  (2UL)                     /*!< BLE BLE_RWBLECONF_REG: USEDBG (Bit 2)                 */
#define BLE_BLE_RWBLECONF_REG_USEDBG_Msk  (0x4UL)                   /*!< BLE BLE_RWBLECONF_REG: USEDBG (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RWBLECONF_REG_USECRYPT_Pos (1UL)                    /*!< BLE BLE_RWBLECONF_REG: USECRYPT (Bit 1)               */
#define BLE_BLE_RWBLECONF_REG_USECRYPT_Msk (0x2UL)                  /*!< BLE BLE_RWBLECONF_REG: USECRYPT (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECONF_REG_BUSWIDTH_Pos (0UL)                    /*!< BLE BLE_RWBLECONF_REG: BUSWIDTH (Bit 0)               */
#define BLE_BLE_RWBLECONF_REG_BUSWIDTH_Msk (0x1UL)                  /*!< BLE BLE_RWBLECONF_REG: BUSWIDTH (Bitfield-Mask: 0x01) */
/* ===================================================  BLE_RXMICVAL_REG  ==================================================== */
#define BLE_BLE_RXMICVAL_REG_RXMICVAL_Pos (0UL)                     /*!< BLE BLE_RXMICVAL_REG: RXMICVAL (Bit 0)                */
#define BLE_BLE_RXMICVAL_REG_RXMICVAL_Msk (0xffffffffUL)            /*!< BLE BLE_RXMICVAL_REG: RXMICVAL (Bitfield-Mask: 0xffffffff) */
/* ===================================================  BLE_SAMPLECLK_REG  =================================================== */
#define BLE_BLE_SAMPLECLK_REG_SAMP_Pos    (0UL)                     /*!< BLE BLE_SAMPLECLK_REG: SAMP (Bit 0)                   */
#define BLE_BLE_SAMPLECLK_REG_SAMP_Msk    (0x1UL)                   /*!< BLE BLE_SAMPLECLK_REG: SAMP (Bitfield-Mask: 0x01)     */
/* ==================================================  BLE_SWPROFILING_REG  ================================================== */
#define BLE_BLE_SWPROFILING_REG_SWPROFVAL_Pos (0UL)                 /*!< BLE BLE_SWPROFILING_REG: SWPROFVAL (Bit 0)            */
#define BLE_BLE_SWPROFILING_REG_SWPROFVAL_Msk (0xffffffffUL)        /*!< BLE BLE_SWPROFILING_REG: SWPROFVAL (Bitfield-Mask: 0xffffffff) */
/* ==================================================  BLE_TIMGENCNTL_REG  =================================================== */
#define BLE_BLE_TIMGENCNTL_REG_APFM_EN_Pos (31UL)                   /*!< BLE BLE_TIMGENCNTL_REG: APFM_EN (Bit 31)              */
#define BLE_BLE_TIMGENCNTL_REG_APFM_EN_Msk (0x80000000UL)           /*!< BLE BLE_TIMGENCNTL_REG: APFM_EN (Bitfield-Mask: 0x01) */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCHABORT_TIME_Pos (16UL)        /*!< BLE BLE_TIMGENCNTL_REG: PREFETCHABORT_TIME (Bit 16)   */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCHABORT_TIME_Msk (0x3ff0000UL) /*!< BLE BLE_TIMGENCNTL_REG: PREFETCHABORT_TIME (Bitfield-Mask: 0x3ff) */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCH_TIME_Pos (0UL)              /*!< BLE BLE_TIMGENCNTL_REG: PREFETCH_TIME (Bit 0)         */
#define BLE_BLE_TIMGENCNTL_REG_PREFETCH_TIME_Msk (0x1ffUL)          /*!< BLE BLE_TIMGENCNTL_REG: PREFETCH_TIME (Bitfield-Mask: 0x1ff) */
/* ===================================================  BLE_TXMICVAL_REG  ==================================================== */
#define BLE_BLE_TXMICVAL_REG_TXMICVAL_Pos (0UL)                     /*!< BLE BLE_TXMICVAL_REG: TXMICVAL (Bit 0)                */
#define BLE_BLE_TXMICVAL_REG_TXMICVAL_Msk (0xffffffffUL)            /*!< BLE BLE_TXMICVAL_REG: TXMICVAL (Bitfield-Mask: 0xffffffff) */
/* ====================================================  BLE_VERSION_REG  ==================================================== */
#define BLE_BLE_VERSION_REG_TYP_Pos       (24UL)                    /*!< BLE BLE_VERSION_REG: TYP (Bit 24)                     */
#define BLE_BLE_VERSION_REG_TYP_Msk       (0xff000000UL)            /*!< BLE BLE_VERSION_REG: TYP (Bitfield-Mask: 0xff)        */
#define BLE_BLE_VERSION_REG_REL_Pos       (16UL)                    /*!< BLE BLE_VERSION_REG: REL (Bit 16)                     */
#define BLE_BLE_VERSION_REG_REL_Msk       (0xff0000UL)              /*!< BLE BLE_VERSION_REG: REL (Bitfield-Mask: 0xff)        */
#define BLE_BLE_VERSION_REG_UPG_Pos       (8UL)                     /*!< BLE BLE_VERSION_REG: UPG (Bit 8)                      */
#define BLE_BLE_VERSION_REG_UPG_Msk       (0xff00UL)                /*!< BLE BLE_VERSION_REG: UPG (Bitfield-Mask: 0xff)        */
#define BLE_BLE_VERSION_REG_BUILD_Pos     (0UL)                     /*!< BLE BLE_VERSION_REG: BUILD (Bit 0)                    */
#define BLE_BLE_VERSION_REG_BUILD_Msk     (0xffUL)                  /*!< BLE BLE_VERSION_REG: BUILD (Bitfield-Mask: 0xff)      */
/* ====================================================  BLE_WLNBDEV_REG  ==================================================== */
#define BLE_BLE_WLNBDEV_REG_NBPRIVDEV_Pos (8UL)                     /*!< BLE BLE_WLNBDEV_REG: NBPRIVDEV (Bit 8)                */
#define BLE_BLE_WLNBDEV_REG_NBPRIVDEV_Msk (0xff00UL)                /*!< BLE BLE_WLNBDEV_REG: NBPRIVDEV (Bitfield-Mask: 0xff)  */
#define BLE_BLE_WLNBDEV_REG_NBPUBDEV_Pos  (0UL)                     /*!< BLE BLE_WLNBDEV_REG: NBPUBDEV (Bit 0)                 */
#define BLE_BLE_WLNBDEV_REG_NBPUBDEV_Msk  (0xffUL)                  /*!< BLE BLE_WLNBDEV_REG: NBPUBDEV (Bitfield-Mask: 0xff)   */
/* =================================================  BLE_WLPRIVADDPTR_REG  ================================================== */
#define BLE_BLE_WLPRIVADDPTR_REG_WLPRIVADDPTR_Pos (0UL)             /*!< BLE BLE_WLPRIVADDPTR_REG: WLPRIVADDPTR (Bit 0)        */
#define BLE_BLE_WLPRIVADDPTR_REG_WLPRIVADDPTR_Msk (0xffffUL)        /*!< BLE BLE_WLPRIVADDPTR_REG: WLPRIVADDPTR (Bitfield-Mask: 0xffff) */
/* ==================================================  BLE_WLPUBADDPTR_REG  ================================================== */
#define BLE_BLE_WLPUBADDPTR_REG_WLPUBADDPTR_Pos (0UL)               /*!< BLE BLE_WLPUBADDPTR_REG: WLPUBADDPTR (Bit 0)          */
#define BLE_BLE_WLPUBADDPTR_REG_WLPUBADDPTR_Msk (0xffffUL)          /*!< BLE BLE_WLPUBADDPTR_REG: WLPUBADDPTR (Bitfield-Mask: 0xffff) */


/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */

