S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ===================================================  COEX_BLE_PTI_REG  ==================================================== */
#define COEX_COEX_BLE_PTI_REG_COEX_BLE_PTI_Pos (0UL)                /*!< COEX COEX_BLE_PTI_REG: COEX_BLE_PTI (Bit 0)           */
#define COEX_COEX_BLE_PTI_REG_COEX_BLE_PTI_Msk (0x7UL)              /*!< COEX COEX_BLE_PTI_REG: COEX_BLE_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_CTRL_REG  ===================================================== */
#define COEX_COEX_CTRL_REG_IGNORE_BLE_Pos (15UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_BLE (Bit 15)               */
#define COEX_COEX_CTRL_REG_IGNORE_BLE_Msk (0x8000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_BLE (Bitfield-Mask: 0x01)  */
#define COEX_COEX_CTRL_REG_IGNORE_FTDF_Pos (14UL)                   /*!< COEX COEX_CTRL_REG: IGNORE_FTDF (Bit 14)              */
#define COEX_COEX_CTRL_REG_IGNORE_FTDF_Msk (0x4000UL)               /*!< COEX COEX_CTRL_REG: IGNORE_FTDF (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_IGNORE_EXT_Pos (13UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_EXT (Bit 13)               */
#define COEX_COEX_CTRL_REG_IGNORE_EXT_Msk (0x2000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_EXT (Bitfield-Mask: 0x01)  */
#define COEX_COEX_CTRL_REG_SEL_BLE_RADIO_BUSY_Pos (11UL)            /*!< COEX COEX_CTRL_REG: SEL_BLE_RADIO_BUSY (Bit 11)       */
#define COEX_COEX_CTRL_REG_SEL_BLE_RADIO_BUSY_Msk (0x1800UL)        /*!< COEX COEX_CTRL_REG: SEL_BLE_RADIO_BUSY (Bitfield-Mask: 0x03) */
#define COEX_COEX_CTRL_REG_SEL_BLE_WLAN_TX_RX_Pos (10UL)            /*!< COEX COEX_CTRL_REG: SEL_BLE_WLAN_TX_RX (Bit 10)       */
#define COEX_COEX_CTRL_REG_SEL_BLE_WLAN_TX_RX_Msk (0x400UL)         /*!< COEX COEX_CTRL_REG: SEL_BLE_WLAN_TX_RX (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_SEL_FTDF_PTI_Pos (8UL)                   /*!< COEX COEX_CTRL_REG: SEL_FTDF_PTI (Bit 8)              */
#define COEX_COEX_CTRL_REG_SEL_FTDF_PTI_Msk (0x100UL)               /*!< COEX COEX_CTRL_REG: SEL_FTDF_PTI (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_SEL_FTDF_CCA_Pos (7UL)                   /*!< COEX COEX_CTRL_REG: SEL_FTDF_CCA (Bit 7)              */
#define COEX_COEX_CTRL_REG_SEL_FTDF_CCA_Msk (0x80UL)                /*!< COEX COEX_CTRL_REG: SEL_FTDF_CCA (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_SEL_COEX_DIAG_Pos (5UL)                  /*!< COEX COEX_CTRL_REG: SEL_COEX_DIAG (Bit 5)             */
#define COEX_COEX_CTRL_REG_SEL_COEX_DIAG_Msk (0x60UL)               /*!< COEX COEX_CTRL_REG: SEL_COEX_DIAG (Bitfield-Mask: 0x03) */
#define COEX_COEX_CTRL_REG_SMART_ACT_IMPL_Pos (4UL)                 /*!< COEX COEX_CTRL_REG: SMART_ACT_IMPL (Bit 4)            */
#define COEX_COEX_CTRL_REG_SMART_ACT_IMPL_Msk (0x10UL)              /*!< COEX COEX_CTRL_REG: SMART_ACT_IMPL (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_PRGING_ARBITER_Pos (0UL)                 /*!< COEX COEX_CTRL_REG: PRGING_ARBITER (Bit 0)            */
#define COEX_COEX_CTRL_REG_PRGING_ARBITER_Msk (0x1UL)               /*!< COEX COEX_CTRL_REG: PRGING_ARBITER (Bitfield-Mask: 0x01) */
/* =====================================================  COEX_DIAG_REG  ===================================================== */
#define COEX_COEX_DIAG_REG_COEX_DIAG_MON_Pos (0UL)                  /*!< COEX COEX_DIAG_REG: COEX_DIAG_MON (Bit 0)             */
#define COEX_COEX_DIAG_REG_COEX_DIAG_MON_Msk (0xffffUL)             /*!< COEX COEX_DIAG_REG: COEX_DIAG_MON (Bitfield-Mask: 0xffff) */
/* ===================================================  COEX_FTDF_PTI_REG  =================================================== */
#define COEX_COEX_FTDF_PTI_REG_COEX_FTDF_PTI_Pos (0UL)              /*!< COEX COEX_FTDF_PTI_REG: COEX_FTDF_PTI (Bit 0)         */
#define COEX_COEX_FTDF_PTI_REG_COEX_FTDF_PTI_Msk (0x7UL)            /*!< COEX COEX_FTDF_PTI_REG: COEX_FTDF_PTI (Bitfield-Mask: 0x07) */
/* ===================================================  COEX_INT_MASK_REG  =================================================== */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_DECISION_SW_Pos (15UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_DECISION_SW (Bit 15) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_DECISION_SW_Msk (0x8000UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_DECISION_SW (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_START_MID_Pos (14UL)     /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_START_MID (Bit 14) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_START_MID_Msk (0x4000UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_START_MID (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_CLOSING_BRK_Pos (13UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_CLOSING_BRK (Bit 13) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_CLOSING_BRK_Msk (0x2000UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_CLOSING_BRK (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_F_Pos (12UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bit 12) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_F_Msk (0x1000UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_R_Pos (11UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bit 11) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_R_Msk (0x800UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Pos (10UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bit 10) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Msk (0x400UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Pos (9UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bit 9) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Msk (0x200UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Pos (8UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bit 8) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Msk (0x100UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Pos (7UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bit 7) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Msk (0x80UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_F_Pos (6UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_F (Bit 6) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_F_Msk (0x40UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_R_Pos (5UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_R (Bit 5) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_R_Msk (0x20UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_F_Pos (4UL)    /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_F (Bit 4) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_F_Msk (0x10UL) /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_R_Pos (3UL)    /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_R (Bit 3) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_R_Msk (0x8UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_F_Pos (2UL)    /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_F (Bit 2) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_F_Msk (0x4UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_R_Pos (1UL)    /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_R (Bit 1) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_R_Msk (0x2UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_MASK_Pos (0UL)              /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_MASK (Bit 0)         */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_MASK_Msk (0x1UL)            /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_MASK (Bitfield-Mask: 0x01) */
/* ===================================================  COEX_INT_STAT_REG  =================================================== */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_DECISION_SW_Pos (15UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_DECISION_SW (Bit 15) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_DECISION_SW_Msk (0x8000UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_DECISION_SW (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_START_MID_Pos (14UL)     /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_START_MID (Bit 14) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_START_MID_Msk (0x4000UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_START_MID (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_CLOSING_BRK_Pos (13UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_CLOSING_BRK (Bit 13) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_CLOSING_BRK_Msk (0x2000UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_CLOSING_BRK (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_F_Pos (12UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bit 12) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_F_Msk (0x1000UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_R_Pos (11UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bit 11) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_R_Msk (0x800UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Pos (10UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bit 10) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Msk (0x400UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Pos (9UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bit 9) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Msk (0x200UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Pos (8UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bit 8) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Msk (0x100UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Pos (7UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bit 7) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Msk (0x80UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_F_Pos (6UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_F (Bit 6) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_F_Msk (0x40UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_R_Pos (5UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_R (Bit 5) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_R_Msk (0x20UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_F_Pos (4UL)    /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_F (Bit 4) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_F_Msk (0x10UL) /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_R_Pos (3UL)    /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_R (Bit 3) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_R_Msk (0x8UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_F_Pos (2UL)    /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_F (Bit 2) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_F_Msk (0x4UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_R_Pos (1UL)    /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_R (Bit 1) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_R_Msk (0x2UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_STAT_Pos (0UL)              /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_STAT (Bit 0)         */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_STAT_Msk (0x1UL)            /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_STAT (Bitfield-Mask: 0x01) */
/* ====================================================  COEX_PRI10_REG  ===================================================== */
#define COEX_COEX_PRI10_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI10_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI10_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI10_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI10_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI10_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI10_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI10_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* ====================================================  COEX_PRI11_REG  ===================================================== */
#define COEX_COEX_PRI11_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI11_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI11_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI11_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI11_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI11_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI11_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI11_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* ====================================================  COEX_PRI12_REG  ===================================================== */
#define COEX_COEX_PRI12_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI12_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI12_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI12_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI12_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI12_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI12_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI12_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* ====================================================  COEX_PRI13_REG  ===================================================== */
#define COEX_COEX_PRI13_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI13_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI13_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI13_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI13_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI13_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI13_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI13_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* ====================================================  COEX_PRI14_REG  ===================================================== */
#define COEX_COEX_PRI14_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI14_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI14_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI14_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI14_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI14_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI14_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI14_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* ====================================================  COEX_PRI15_REG  ===================================================== */
#define COEX_COEX_PRI15_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI15_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI15_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI15_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI15_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI15_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI15_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI15_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* ====================================================  COEX_PRI16_REG  ===================================================== */
#define COEX_COEX_PRI16_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI16_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI16_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI16_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI16_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI16_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI16_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI16_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* ====================================================  COEX_PRI17_REG  ===================================================== */
#define COEX_COEX_PRI17_REG_COEX_PRI_MAC_Pos (3UL)                  /*!< COEX COEX_PRI17_REG: COEX_PRI_MAC (Bit 3)             */
#define COEX_COEX_PRI17_REG_COEX_PRI_MAC_Msk (0x18UL)               /*!< COEX COEX_PRI17_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI17_REG_COEX_PRI_PTI_Pos (0UL)                  /*!< COEX COEX_PRI17_REG: COEX_PRI_PTI (Bit 0)             */
#define COEX_COEX_PRI17_REG_COEX_PRI_PTI_Msk (0x7UL)                /*!< COEX COEX_PRI17_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI1_REG  ===================================================== */
#define COEX_COEX_PRI1_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI1_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI1_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI1_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI1_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI1_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI1_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI1_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI2_REG  ===================================================== */
#define COEX_COEX_PRI2_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI2_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI2_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI2_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI2_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI2_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI2_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI2_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI3_REG  ===================================================== */
#define COEX_COEX_PRI3_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI3_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI3_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI3_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI3_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI3_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI3_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI3_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI4_REG  ===================================================== */
#define COEX_COEX_PRI4_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI4_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI4_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI4_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI4_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI4_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI4_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI4_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI5_REG  ===================================================== */
#define COEX_COEX_PRI5_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI5_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI5_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI5_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI5_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI5_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI5_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI5_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI6_REG  ===================================================== */
#define COEX_COEX_PRI6_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI6_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI6_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI6_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI6_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI6_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI6_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI6_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI7_REG  ===================================================== */
#define COEX_COEX_PRI7_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI7_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI7_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI7_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI7_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI7_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI7_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI7_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI8_REG  ===================================================== */
#define COEX_COEX_PRI8_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI8_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI8_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI8_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
#define COEX_COEX_PRI8_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI8_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI8_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI8_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_PRI9_REG  ===================================================== */
#define COEX_COEX_PRI9_REG_COEX_PRI_MAC_Pos (3UL)                   /*!< COEX COEX_PRI9_REG: COEX_PRI_MAC (Bit 3)              */
#define COEX_COEX_PRI9_REG_COEX_PRI_MAC_Msk (0x18UL)                /*!< COEX COEX_PRI9_REG: COEX_PRI_MAC (Bitfield-Mask: 0x03) */
