S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define COEX_COEX_PRI9_REG_COEX_PRI_PTI_Pos (0UL)                   /*!< COEX COEX_PRI9_REG: COEX_PRI_PTI (Bit 0)              */
#define COEX_COEX_PRI9_REG_COEX_PRI_PTI_Msk (0x7UL)                 /*!< COEX COEX_PRI9_REG: COEX_PRI_PTI (Bitfield-Mask: 0x07) */
/* =====================================================  COEX_STAT_REG  ===================================================== */
#define COEX_COEX_STAT_REG_IGNORE_BLE_STAT_Pos (15UL)               /*!< COEX COEX_STAT_REG: IGNORE_BLE_STAT (Bit 15)          */
#define COEX_COEX_STAT_REG_IGNORE_BLE_STAT_Msk (0x8000UL)           /*!< COEX COEX_STAT_REG: IGNORE_BLE_STAT (Bitfield-Mask: 0x01) */
#define COEX_COEX_STAT_REG_IGNORE_FTDF_STAT_Pos (14UL)              /*!< COEX COEX_STAT_REG: IGNORE_FTDF_STAT (Bit 14)         */
#define COEX_COEX_STAT_REG_IGNORE_FTDF_STAT_Msk (0x4000UL)          /*!< COEX COEX_STAT_REG: IGNORE_FTDF_STAT (Bitfield-Mask: 0x01) */
#define COEX_COEX_STAT_REG_IGNORE_EXT_STAT_Pos (13UL)               /*!< COEX COEX_STAT_REG: IGNORE_EXT_STAT (Bit 13)          */
#define COEX_COEX_STAT_REG_IGNORE_EXT_STAT_Msk (0x2000UL)           /*!< COEX COEX_STAT_REG: IGNORE_EXT_STAT (Bitfield-Mask: 0x01) */
#define COEX_COEX_STAT_REG_COEX_RADIO_BUSY_Pos (12UL)               /*!< COEX COEX_STAT_REG: COEX_RADIO_BUSY (Bit 12)          */
#define COEX_COEX_STAT_REG_COEX_RADIO_BUSY_Msk (0x1000UL)           /*!< COEX COEX_STAT_REG: COEX_RADIO_BUSY (Bitfield-Mask: 0x01) */
#define COEX_COEX_STAT_REG_EXT_ACT1_Pos   (11UL)                    /*!< COEX COEX_STAT_REG: EXT_ACT1 (Bit 11)                 */
#define COEX_COEX_STAT_REG_EXT_ACT1_Msk   (0x800UL)                 /*!< COEX COEX_STAT_REG: EXT_ACT1 (Bitfield-Mask: 0x01)    */
#define COEX_COEX_STAT_REG_EXT_ACT0_Pos   (10UL)                    /*!< COEX COEX_STAT_REG: EXT_ACT0 (Bit 10)                 */
#define COEX_COEX_STAT_REG_EXT_ACT0_Msk   (0x400UL)                 /*!< COEX COEX_STAT_REG: EXT_ACT0 (Bitfield-Mask: 0x01)    */
#define COEX_COEX_STAT_REG_SMART_PRI_Pos  (9UL)                     /*!< COEX COEX_STAT_REG: SMART_PRI (Bit 9)                 */
#define COEX_COEX_STAT_REG_SMART_PRI_Msk  (0x200UL)                 /*!< COEX COEX_STAT_REG: SMART_PRI (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT_REG_SMART_ACT_Pos  (8UL)                     /*!< COEX COEX_STAT_REG: SMART_ACT (Bit 8)                 */
#define COEX_COEX_STAT_REG_SMART_ACT_Msk  (0x100UL)                 /*!< COEX COEX_STAT_REG: SMART_ACT (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT_REG_COEX_DECISION_CLOSING_Pos (7UL)          /*!< COEX COEX_STAT_REG: COEX_DECISION_CLOSING (Bit 7)     */
#define COEX_COEX_STAT_REG_COEX_DECISION_CLOSING_Msk (0x80UL)       /*!< COEX COEX_STAT_REG: COEX_DECISION_CLOSING (Bitfield-Mask: 0x01) */
#define COEX_COEX_STAT_REG_COEX_DECISION_Pos (5UL)                  /*!< COEX COEX_STAT_REG: COEX_DECISION (Bit 5)             */
#define COEX_COEX_STAT_REG_COEX_DECISION_Msk (0x60UL)               /*!< COEX COEX_STAT_REG: COEX_DECISION (Bitfield-Mask: 0x03) */
#define COEX_COEX_STAT_REG_COEX_DECISION_PTR_Pos (0UL)              /*!< COEX COEX_STAT_REG: COEX_DECISION_PTR (Bit 0)         */
#define COEX_COEX_STAT_REG_COEX_DECISION_PTR_Msk (0x1fUL)           /*!< COEX COEX_STAT_REG: COEX_DECISION_PTR (Bitfield-Mask: 0x1f) */


/* =========================================================================================================================== */
/* ================                                          CRG_PER                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  CLK_PER_REG  ====================================================== */
#define CRG_PER_CLK_PER_REG_ADC_CLK_SEL_Pos (11UL)                  /*!< CRG_PER CLK_PER_REG: ADC_CLK_SEL (Bit 11)             */
#define CRG_PER_CLK_PER_REG_ADC_CLK_SEL_Msk (0x800UL)               /*!< CRG_PER CLK_PER_REG: ADC_CLK_SEL (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_KBSCAN_CLK_SEL_Pos (10UL)               /*!< CRG_PER CLK_PER_REG: KBSCAN_CLK_SEL (Bit 10)          */
#define CRG_PER_CLK_PER_REG_KBSCAN_CLK_SEL_Msk (0x400UL)            /*!< CRG_PER CLK_PER_REG: KBSCAN_CLK_SEL (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_I2C_CLK_SEL_Pos (9UL)                   /*!< CRG_PER CLK_PER_REG: I2C_CLK_SEL (Bit 9)              */
#define CRG_PER_CLK_PER_REG_I2C_CLK_SEL_Msk (0x200UL)               /*!< CRG_PER CLK_PER_REG: I2C_CLK_SEL (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_SPI_CLK_SEL_Pos (8UL)                   /*!< CRG_PER CLK_PER_REG: SPI_CLK_SEL (Bit 8)              */
#define CRG_PER_CLK_PER_REG_SPI_CLK_SEL_Msk (0x100UL)               /*!< CRG_PER CLK_PER_REG: SPI_CLK_SEL (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_KBSCAN_ENABLE_Pos (5UL)                 /*!< CRG_PER CLK_PER_REG: KBSCAN_ENABLE (Bit 5)            */
#define CRG_PER_CLK_PER_REG_KBSCAN_ENABLE_Msk (0x20UL)              /*!< CRG_PER CLK_PER_REG: KBSCAN_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_IR_CLK_ENABLE_Pos (4UL)                 /*!< CRG_PER CLK_PER_REG: IR_CLK_ENABLE (Bit 4)            */
#define CRG_PER_CLK_PER_REG_IR_CLK_ENABLE_Msk (0x10UL)              /*!< CRG_PER CLK_PER_REG: IR_CLK_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_QUAD_ENABLE_Pos (3UL)                   /*!< CRG_PER CLK_PER_REG: QUAD_ENABLE (Bit 3)              */
#define CRG_PER_CLK_PER_REG_QUAD_ENABLE_Msk (0x8UL)                 /*!< CRG_PER CLK_PER_REG: QUAD_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_I2C_ENABLE_Pos (2UL)                    /*!< CRG_PER CLK_PER_REG: I2C_ENABLE (Bit 2)               */
#define CRG_PER_CLK_PER_REG_I2C_ENABLE_Msk (0x4UL)                  /*!< CRG_PER CLK_PER_REG: I2C_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_SPI_ENABLE_Pos (1UL)                    /*!< CRG_PER CLK_PER_REG: SPI_ENABLE (Bit 1)               */
#define CRG_PER_CLK_PER_REG_SPI_ENABLE_Msk (0x2UL)                  /*!< CRG_PER CLK_PER_REG: SPI_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_PER_CLK_PER_REG_UART_ENABLE_Pos (0UL)                   /*!< CRG_PER CLK_PER_REG: UART_ENABLE (Bit 0)              */
#define CRG_PER_CLK_PER_REG_UART_ENABLE_Msk (0x1UL)                 /*!< CRG_PER CLK_PER_REG: UART_ENABLE (Bitfield-Mask: 0x01) */
/* ========================================================  EH_REG  ========================================================= */
#define CRG_PER_EH_REG_EH_EN_Pos          (0UL)                     /*!< CRG_PER EH_REG: EH_EN (Bit 0)                         */
#define CRG_PER_EH_REG_EH_EN_Msk          (0x1UL)                   /*!< CRG_PER EH_REG: EH_EN (Bitfield-Mask: 0x01)           */
/* ======================================================  PCM_DIV_REG  ====================================================== */
#define CRG_PER_PCM_DIV_REG_PCM_SRC_SEL_Pos (13UL)                  /*!< CRG_PER PCM_DIV_REG: PCM_SRC_SEL (Bit 13)             */
#define CRG_PER_PCM_DIV_REG_PCM_SRC_SEL_Msk (0x2000UL)              /*!< CRG_PER PCM_DIV_REG: PCM_SRC_SEL (Bitfield-Mask: 0x01) */
#define CRG_PER_PCM_DIV_REG_CLK_PCM_EN_Pos (12UL)                   /*!< CRG_PER PCM_DIV_REG: CLK_PCM_EN (Bit 12)              */
#define CRG_PER_PCM_DIV_REG_CLK_PCM_EN_Msk (0x1000UL)               /*!< CRG_PER PCM_DIV_REG: CLK_PCM_EN (Bitfield-Mask: 0x01) */
#define CRG_PER_PCM_DIV_REG_PCM_DIV_Pos   (0UL)                     /*!< CRG_PER PCM_DIV_REG: PCM_DIV (Bit 0)                  */
#define CRG_PER_PCM_DIV_REG_PCM_DIV_Msk   (0xfffUL)                 /*!< CRG_PER PCM_DIV_REG: PCM_DIV (Bitfield-Mask: 0xfff)   */
/* =====================================================  PCM_FDIV_REG  ====================================================== */
#define CRG_PER_PCM_FDIV_REG_PCM_FDIV_Pos (0UL)                     /*!< CRG_PER PCM_FDIV_REG: PCM_FDIV (Bit 0)                */
#define CRG_PER_PCM_FDIV_REG_PCM_FDIV_Msk (0xffffUL)                /*!< CRG_PER PCM_FDIV_REG: PCM_FDIV (Bitfield-Mask: 0xffff) */
/* ======================================================  PDM_DIV_REG  ====================================================== */
#define CRG_PER_PDM_DIV_REG_PDM_MASTER_MODE_Pos (9UL)               /*!< CRG_PER PDM_DIV_REG: PDM_MASTER_MODE (Bit 9)          */
#define CRG_PER_PDM_DIV_REG_PDM_MASTER_MODE_Msk (0x200UL)           /*!< CRG_PER PDM_DIV_REG: PDM_MASTER_MODE (Bitfield-Mask: 0x01) */
#define CRG_PER_PDM_DIV_REG_CLK_PDM_EN_Pos (8UL)                    /*!< CRG_PER PDM_DIV_REG: CLK_PDM_EN (Bit 8)               */
#define CRG_PER_PDM_DIV_REG_CLK_PDM_EN_Msk (0x100UL)                /*!< CRG_PER PDM_DIV_REG: CLK_PDM_EN (Bitfield-Mask: 0x01) */
#define CRG_PER_PDM_DIV_REG_PDM_DIV_Pos   (0UL)                     /*!< CRG_PER PDM_DIV_REG: PDM_DIV (Bit 0)                  */
#define CRG_PER_PDM_DIV_REG_PDM_DIV_Msk   (0xffUL)                  /*!< CRG_PER PDM_DIV_REG: PDM_DIV (Bitfield-Mask: 0xff)    */
/* ======================================================  SRC_DIV_REG  ====================================================== */
#define CRG_PER_SRC_DIV_REG_CLK_SRC_EN_Pos (8UL)                    /*!< CRG_PER SRC_DIV_REG: CLK_SRC_EN (Bit 8)               */
#define CRG_PER_SRC_DIV_REG_CLK_SRC_EN_Msk (0x100UL)                /*!< CRG_PER SRC_DIV_REG: CLK_SRC_EN (Bitfield-Mask: 0x01) */
#define CRG_PER_SRC_DIV_REG_SRC_DIV_Pos   (0UL)                     /*!< CRG_PER SRC_DIV_REG: SRC_DIV (Bit 0)                  */
#define CRG_PER_SRC_DIV_REG_SRC_DIV_Msk   (0xffUL)                  /*!< CRG_PER SRC_DIV_REG: SRC_DIV (Bitfield-Mask: 0xff)    */
/* ======================================================  USBPAD_REG  ======================================================= */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW2_ON_Pos (2UL)            /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW2_ON (Bit 2)       */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW2_ON_Msk (0x4UL)          /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW2_ON (Bitfield-Mask: 0x01) */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW1_OFF_Pos (1UL)           /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW1_OFF (Bit 1)      */
#define CRG_PER_USBPAD_REG_USBPHY_FORCE_SW1_OFF_Msk (0x2UL)         /*!< CRG_PER USBPAD_REG: USBPHY_FORCE_SW1_OFF (Bitfield-Mask: 0x01) */
#define CRG_PER_USBPAD_REG_USBPAD_EN_Pos  (0UL)                     /*!< CRG_PER USBPAD_REG: USBPAD_EN (Bit 0)                 */
#define CRG_PER_USBPAD_REG_USBPAD_EN_Msk  (0x1UL)                   /*!< CRG_PER USBPAD_REG: USBPAD_EN (Bitfield-Mask: 0x01)   */


/* =========================================================================================================================== */
/* ================                                          CRG_TOP                                          ================ */
/* =========================================================================================================================== */

