S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ====================================================  ANA_STATUS_REG  ===================================================== */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_PA_HIGH_Pos (15UL)          /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_PA_HIGH (Bit 15)     */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_PA_HIGH_Msk (0x8000UL)      /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_PA_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_FLASH_HIGH_Pos (14UL)       /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_FLASH_HIGH (Bit 14)  */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_FLASH_HIGH_Msk (0x4000UL)   /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_FLASH_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_V33_HIGH_Pos (13UL)             /*!< CRG_TOP ANA_STATUS_REG: COMP_V33_HIGH (Bit 13)        */
#define CRG_TOP_ANA_STATUS_REG_COMP_V33_HIGH_Msk (0x2000UL)         /*!< CRG_TOP ANA_STATUS_REG: COMP_V33_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_LOW_Pos (12UL)             /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_LOW (Bit 12)        */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_LOW_Msk (0x1000UL)         /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_HIGH_Pos (11UL)            /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_HIGH (Bit 11)       */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_HIGH_Msk (0x800UL)         /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_FLASH_OK_Pos (10UL)          /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_FLASH_OK (Bit 10)     */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_FLASH_OK_Msk (0x400UL)       /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_FLASH_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_PA_OK_Pos (9UL)              /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_PA_OK (Bit 9)         */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_PA_OK_Msk (0x200UL)          /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_PA_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_CORE_OK_Pos (8UL)                /*!< CRG_TOP ANA_STATUS_REG: LDO_CORE_OK (Bit 8)           */
#define CRG_TOP_ANA_STATUS_REG_LDO_CORE_OK_Msk (0x100UL)            /*!< CRG_TOP ANA_STATUS_REG: LDO_CORE_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_VDD_HIGH_Pos (7UL)              /*!< CRG_TOP ANA_STATUS_REG: COMP_VDD_HIGH (Bit 7)         */
#define CRG_TOP_ANA_STATUS_REG_COMP_VDD_HIGH_Msk (0x80UL)           /*!< CRG_TOP ANA_STATUS_REG: COMP_VDD_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_BANDGAP_OK_Pos (6UL)                 /*!< CRG_TOP ANA_STATUS_REG: BANDGAP_OK (Bit 6)            */
#define CRG_TOP_ANA_STATUS_REG_BANDGAP_OK_Msk (0x40UL)              /*!< CRG_TOP ANA_STATUS_REG: BANDGAP_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_USB_OK_Pos (5UL)          /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_USB_OK (Bit 5)     */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_USB_OK_Msk (0x20UL)       /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_USB_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_VBAT_OK_Pos (4UL)         /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_VBAT_OK (Bit 4)    */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_VBAT_OK_Msk (0x10UL)      /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_VBAT_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_NEWBAT_Pos (3UL)                     /*!< CRG_TOP ANA_STATUS_REG: NEWBAT (Bit 3)                */
#define CRG_TOP_ANA_STATUS_REG_NEWBAT_Msk (0x8UL)                   /*!< CRG_TOP ANA_STATUS_REG: NEWBAT (Bitfield-Mask: 0x01)  */
#define CRG_TOP_ANA_STATUS_REG_VBUS_AVAILABLE_Pos (2UL)             /*!< CRG_TOP ANA_STATUS_REG: VBUS_AVAILABLE (Bit 2)        */
#define CRG_TOP_ANA_STATUS_REG_VBUS_AVAILABLE_Msk (0x4UL)           /*!< CRG_TOP ANA_STATUS_REG: VBUS_AVAILABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBAT_OK_Pos (1UL)               /*!< CRG_TOP ANA_STATUS_REG: COMP_VBAT_OK (Bit 1)          */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBAT_OK_Msk (0x2UL)             /*!< CRG_TOP ANA_STATUS_REG: COMP_VBAT_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_RADIO_OK_Pos (0UL)               /*!< CRG_TOP ANA_STATUS_REG: LDO_RADIO_OK (Bit 0)          */
#define CRG_TOP_ANA_STATUS_REG_LDO_RADIO_OK_Msk (0x1UL)             /*!< CRG_TOP ANA_STATUS_REG: LDO_RADIO_OK (Bitfield-Mask: 0x01) */
/* =====================================================  AON_SPARE_REG  ===================================================== */
#define CRG_TOP_AON_SPARE_REG_EN_BUSSYS_RET_Pos (3UL)               /*!< CRG_TOP AON_SPARE_REG: EN_BUSSYS_RET (Bit 3)          */
#define CRG_TOP_AON_SPARE_REG_EN_BUSSYS_RET_Msk (0x8UL)             /*!< CRG_TOP AON_SPARE_REG: EN_BUSSYS_RET (Bitfield-Mask: 0x01) */
#define CRG_TOP_AON_SPARE_REG_EN_BATSYS_RET_Pos (2UL)               /*!< CRG_TOP AON_SPARE_REG: EN_BATSYS_RET (Bit 2)          */
#define CRG_TOP_AON_SPARE_REG_EN_BATSYS_RET_Msk (0x4UL)             /*!< CRG_TOP AON_SPARE_REG: EN_BATSYS_RET (Bitfield-Mask: 0x01) */
#define CRG_TOP_AON_SPARE_REG_OSC16_SH_DISABLE_Pos (1UL)            /*!< CRG_TOP AON_SPARE_REG: OSC16_SH_DISABLE (Bit 1)       */
#define CRG_TOP_AON_SPARE_REG_OSC16_SH_DISABLE_Msk (0x2UL)          /*!< CRG_TOP AON_SPARE_REG: OSC16_SH_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_AON_SPARE_REG_OSC16_HOLD_AMP_REG_Pos (0UL)          /*!< CRG_TOP AON_SPARE_REG: OSC16_HOLD_AMP_REG (Bit 0)     */
#define CRG_TOP_AON_SPARE_REG_OSC16_HOLD_AMP_REG_Msk (0x1UL)        /*!< CRG_TOP AON_SPARE_REG: OSC16_HOLD_AMP_REG (Bitfield-Mask: 0x01) */
/* ======================================================  BANDGAP_REG  ====================================================== */
#define CRG_TOP_BANDGAP_REG_BYPASS_COLD_BOOT_DISABLE_Pos (14UL)     /*!< CRG_TOP BANDGAP_REG: BYPASS_COLD_BOOT_DISABLE (Bit 14) */
#define CRG_TOP_BANDGAP_REG_BYPASS_COLD_BOOT_DISABLE_Msk (0x4000UL) /*!< CRG_TOP BANDGAP_REG: BYPASS_COLD_BOOT_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_BANDGAP_REG_LDO_SLEEP_TRIM_Pos (10UL)               /*!< CRG_TOP BANDGAP_REG: LDO_SLEEP_TRIM (Bit 10)          */
#define CRG_TOP_BANDGAP_REG_LDO_SLEEP_TRIM_Msk (0x3c00UL)           /*!< CRG_TOP BANDGAP_REG: LDO_SLEEP_TRIM (Bitfield-Mask: 0x0f) */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Pos (5UL)                     /*!< CRG_TOP BANDGAP_REG: BGR_ITRIM (Bit 5)                */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Msk (0x3e0UL)                 /*!< CRG_TOP BANDGAP_REG: BGR_ITRIM (Bitfield-Mask: 0x1f)  */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Pos  (0UL)                     /*!< CRG_TOP BANDGAP_REG: BGR_TRIM (Bit 0)                 */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Msk  (0x1fUL)                  /*!< CRG_TOP BANDGAP_REG: BGR_TRIM (Bitfield-Mask: 0x1f)   */
/* =====================================================  BOD_CTRL2_REG  ===================================================== */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VBAT_EN_Pos (5UL)                 /*!< CRG_TOP BOD_CTRL2_REG: BOD_VBAT_EN (Bit 5)            */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VBAT_EN_Msk (0x20UL)              /*!< CRG_TOP BOD_CTRL2_REG: BOD_VBAT_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_FLASH_EN_Pos (4UL)            /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_FLASH_EN (Bit 4)       */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_FLASH_EN_Msk (0x10UL)         /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_FLASH_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_PA_EN_Pos (3UL)               /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_PA_EN (Bit 3)          */
#define CRG_TOP_BOD_CTRL2_REG_BOD_1V8_PA_EN_Msk (0x8UL)             /*!< CRG_TOP BOD_CTRL2_REG: BOD_1V8_PA_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_CTRL2_REG_BOD_V33_EN_Pos (2UL)                  /*!< CRG_TOP BOD_CTRL2_REG: BOD_V33_EN (Bit 2)             */
#define CRG_TOP_BOD_CTRL2_REG_BOD_V33_EN_Msk (0x4UL)                /*!< CRG_TOP BOD_CTRL2_REG: BOD_V33_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VDD_EN_Pos (1UL)                  /*!< CRG_TOP BOD_CTRL2_REG: BOD_VDD_EN (Bit 1)             */
#define CRG_TOP_BOD_CTRL2_REG_BOD_VDD_EN_Msk (0x2UL)                /*!< CRG_TOP BOD_CTRL2_REG: BOD_VDD_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_CTRL2_REG_BOD_RESET_EN_Pos (0UL)                /*!< CRG_TOP BOD_CTRL2_REG: BOD_RESET_EN (Bit 0)           */
#define CRG_TOP_BOD_CTRL2_REG_BOD_RESET_EN_Msk (0x1UL)              /*!< CRG_TOP BOD_CTRL2_REG: BOD_RESET_EN (Bitfield-Mask: 0x01) */
/* =====================================================  BOD_CTRL_REG  ====================================================== */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDD_LVL_Pos (8UL)                  /*!< CRG_TOP BOD_CTRL_REG: BOD_VDD_LVL (Bit 8)             */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDD_LVL_Msk (0x700UL)              /*!< CRG_TOP BOD_CTRL_REG: BOD_VDD_LVL (Bitfield-Mask: 0x07) */
#define CRG_TOP_BOD_CTRL_REG_BOD_V33_TRIM_Pos (6UL)                 /*!< CRG_TOP BOD_CTRL_REG: BOD_V33_TRIM (Bit 6)            */
#define CRG_TOP_BOD_CTRL_REG_BOD_V33_TRIM_Msk (0xc0UL)              /*!< CRG_TOP BOD_CTRL_REG: BOD_V33_TRIM (Bitfield-Mask: 0x03) */
#define CRG_TOP_BOD_CTRL_REG_BOD_1V8_PA_TRIM_Pos (4UL)              /*!< CRG_TOP BOD_CTRL_REG: BOD_1V8_PA_TRIM (Bit 4)         */
#define CRG_TOP_BOD_CTRL_REG_BOD_1V8_PA_TRIM_Msk (0x30UL)           /*!< CRG_TOP BOD_CTRL_REG: BOD_1V8_PA_TRIM (Bitfield-Mask: 0x03) */
#define CRG_TOP_BOD_CTRL_REG_BOD_1V8_FLASH_TRIM_Pos (2UL)           /*!< CRG_TOP BOD_CTRL_REG: BOD_1V8_FLASH_TRIM (Bit 2)      */
#define CRG_TOP_BOD_CTRL_REG_BOD_1V8_FLASH_TRIM_Msk (0xcUL)         /*!< CRG_TOP BOD_CTRL_REG: BOD_1V8_FLASH_TRIM (Bitfield-Mask: 0x03) */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDD_TRIM_Pos (0UL)                 /*!< CRG_TOP BOD_CTRL_REG: BOD_VDD_TRIM (Bit 0)            */
#define CRG_TOP_BOD_CTRL_REG_BOD_VDD_TRIM_Msk (0x3UL)               /*!< CRG_TOP BOD_CTRL_REG: BOD_VDD_TRIM (Bitfield-Mask: 0x03) */
/* ====================================================  BOD_STATUS_REG  ===================================================== */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBAT_LOW_Pos (4UL)               /*!< CRG_TOP BOD_STATUS_REG: BOD_VBAT_LOW (Bit 4)          */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBAT_LOW_Msk (0x10UL)            /*!< CRG_TOP BOD_STATUS_REG: BOD_VBAT_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_STATUS_REG_BOD_V33_LOW_Pos (3UL)                /*!< CRG_TOP BOD_STATUS_REG: BOD_V33_LOW (Bit 3)           */
#define CRG_TOP_BOD_STATUS_REG_BOD_V33_LOW_Msk (0x8UL)              /*!< CRG_TOP BOD_STATUS_REG: BOD_V33_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_FLASH_LOW_Pos (2UL)          /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_FLASH_LOW (Bit 2)     */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_FLASH_LOW_Msk (0x4UL)        /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_FLASH_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_PA_LOW_Pos (1UL)             /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_PA_LOW (Bit 1)        */
#define CRG_TOP_BOD_STATUS_REG_BOD_1V8_PA_LOW_Msk (0x2UL)           /*!< CRG_TOP BOD_STATUS_REG: BOD_1V8_PA_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_BOD_STATUS_REG_BOD_VDD_LOW_Pos (0UL)                /*!< CRG_TOP BOD_STATUS_REG: BOD_VDD_LOW (Bit 0)           */
#define CRG_TOP_BOD_STATUS_REG_BOD_VDD_LOW_Msk (0x1UL)              /*!< CRG_TOP BOD_STATUS_REG: BOD_VDD_LOW (Bitfield-Mask: 0x01) */
/* ======================================================  CLK_16M_REG  ====================================================== */
#define CRG_TOP_CLK_16M_REG_RC16M_STARTUP_DISABLE_Pos (15UL)        /*!< CRG_TOP CLK_16M_REG: RC16M_STARTUP_DISABLE (Bit 15)   */
#define CRG_TOP_CLK_16M_REG_RC16M_STARTUP_DISABLE_Msk (0x8000UL)    /*!< CRG_TOP CLK_16M_REG: RC16M_STARTUP_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_HPASS_FLT_EN_Pos (14UL)          /*!< CRG_TOP CLK_16M_REG: XTAL16_HPASS_FLT_EN (Bit 14)     */
#define CRG_TOP_CLK_16M_REG_XTAL16_HPASS_FLT_EN_Msk (0x4000UL)      /*!< CRG_TOP CLK_16M_REG: XTAL16_HPASS_FLT_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_SPIKE_FLT_BYPASS_Pos (13UL)      /*!< CRG_TOP CLK_16M_REG: XTAL16_SPIKE_FLT_BYPASS (Bit 13) */
#define CRG_TOP_CLK_16M_REG_XTAL16_SPIKE_FLT_BYPASS_Msk (0x2000UL)  /*!< CRG_TOP CLK_16M_REG: XTAL16_SPIKE_FLT_BYPASS (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_AMP_TRIM_Pos (10UL)              /*!< CRG_TOP CLK_16M_REG: XTAL16_AMP_TRIM (Bit 10)         */
#define CRG_TOP_CLK_16M_REG_XTAL16_AMP_TRIM_Msk (0x1c00UL)          /*!< CRG_TOP CLK_16M_REG: XTAL16_AMP_TRIM (Bitfield-Mask: 0x07) */
#define CRG_TOP_CLK_16M_REG_XTAL16_EXT_CLK_ENABLE_Pos (9UL)         /*!< CRG_TOP CLK_16M_REG: XTAL16_EXT_CLK_ENABLE (Bit 9)    */
#define CRG_TOP_CLK_16M_REG_XTAL16_EXT_CLK_ENABLE_Msk (0x200UL)     /*!< CRG_TOP CLK_16M_REG: XTAL16_EXT_CLK_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_MAX_CURRENT_Pos (8UL)            /*!< CRG_TOP CLK_16M_REG: XTAL16_MAX_CURRENT (Bit 8)       */
#define CRG_TOP_CLK_16M_REG_XTAL16_MAX_CURRENT_Msk (0x100UL)        /*!< CRG_TOP CLK_16M_REG: XTAL16_MAX_CURRENT (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_16M_REG_XTAL16_CUR_SET_Pos (5UL)                /*!< CRG_TOP CLK_16M_REG: XTAL16_CUR_SET (Bit 5)           */
#define CRG_TOP_CLK_16M_REG_XTAL16_CUR_SET_Msk (0xe0UL)             /*!< CRG_TOP CLK_16M_REG: XTAL16_CUR_SET (Bitfield-Mask: 0x07) */
#define CRG_TOP_CLK_16M_REG_RC16M_TRIM_Pos (1UL)                    /*!< CRG_TOP CLK_16M_REG: RC16M_TRIM (Bit 1)               */
#define CRG_TOP_CLK_16M_REG_RC16M_TRIM_Msk (0x1eUL)                 /*!< CRG_TOP CLK_16M_REG: RC16M_TRIM (Bitfield-Mask: 0x0f) */
#define CRG_TOP_CLK_16M_REG_RC16M_ENABLE_Pos (0UL)                  /*!< CRG_TOP CLK_16M_REG: RC16M_ENABLE (Bit 0)             */
#define CRG_TOP_CLK_16M_REG_RC16M_ENABLE_Msk (0x1UL)                /*!< CRG_TOP CLK_16M_REG: RC16M_ENABLE (Bitfield-Mask: 0x01) */
/* ======================================================  CLK_32K_REG  ====================================================== */
#define CRG_TOP_CLK_32K_REG_XTAL32K_DISABLE_AMPREG_Pos (12UL)       /*!< CRG_TOP CLK_32K_REG: XTAL32K_DISABLE_AMPREG (Bit 12)  */
#define CRG_TOP_CLK_32K_REG_XTAL32K_DISABLE_AMPREG_Msk (0x1000UL)   /*!< CRG_TOP CLK_32K_REG: XTAL32K_DISABLE_AMPREG (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_32K_REG_RC32K_TRIM_Pos (8UL)                    /*!< CRG_TOP CLK_32K_REG: RC32K_TRIM (Bit 8)               */
#define CRG_TOP_CLK_32K_REG_RC32K_TRIM_Msk (0xf00UL)                /*!< CRG_TOP CLK_32K_REG: RC32K_TRIM (Bitfield-Mask: 0x0f) */
#define CRG_TOP_CLK_32K_REG_RC32K_ENABLE_Pos (7UL)                  /*!< CRG_TOP CLK_32K_REG: RC32K_ENABLE (Bit 7)             */
#define CRG_TOP_CLK_32K_REG_RC32K_ENABLE_Msk (0x80UL)               /*!< CRG_TOP CLK_32K_REG: RC32K_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_32K_REG_XTAL32K_CUR_Pos (3UL)                   /*!< CRG_TOP CLK_32K_REG: XTAL32K_CUR (Bit 3)              */
#define CRG_TOP_CLK_32K_REG_XTAL32K_CUR_Msk (0x78UL)                /*!< CRG_TOP CLK_32K_REG: XTAL32K_CUR (Bitfield-Mask: 0x0f) */
#define CRG_TOP_CLK_32K_REG_XTAL32K_RBIAS_Pos (1UL)                 /*!< CRG_TOP CLK_32K_REG: XTAL32K_RBIAS (Bit 1)            */
#define CRG_TOP_CLK_32K_REG_XTAL32K_RBIAS_Msk (0x6UL)               /*!< CRG_TOP CLK_32K_REG: XTAL32K_RBIAS (Bitfield-Mask: 0x03) */
#define CRG_TOP_CLK_32K_REG_XTAL32K_ENABLE_Pos (0UL)                /*!< CRG_TOP CLK_32K_REG: XTAL32K_ENABLE (Bit 0)           */
#define CRG_TOP_CLK_32K_REG_XTAL32K_ENABLE_Msk (0x1UL)              /*!< CRG_TOP CLK_32K_REG: XTAL32K_ENABLE (Bitfield-Mask: 0x01) */
/* =====================================================  CLK_AMBA_REG  ====================================================== */
#define CRG_TOP_CLK_AMBA_REG_QSPI_ENABLE_Pos (12UL)                 /*!< CRG_TOP CLK_AMBA_REG: QSPI_ENABLE (Bit 12)            */
#define CRG_TOP_CLK_AMBA_REG_QSPI_ENABLE_Msk (0x1000UL)             /*!< CRG_TOP CLK_AMBA_REG: QSPI_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_AMBA_REG_QSPI_DIV_Pos (10UL)                    /*!< CRG_TOP CLK_AMBA_REG: QSPI_DIV (Bit 10)               */
#define CRG_TOP_CLK_AMBA_REG_QSPI_DIV_Msk (0xc00UL)                 /*!< CRG_TOP CLK_AMBA_REG: QSPI_DIV (Bitfield-Mask: 0x03)  */
#define CRG_TOP_CLK_AMBA_REG_OTP_ENABLE_Pos (9UL)                   /*!< CRG_TOP CLK_AMBA_REG: OTP_ENABLE (Bit 9)              */
#define CRG_TOP_CLK_AMBA_REG_OTP_ENABLE_Msk (0x200UL)               /*!< CRG_TOP CLK_AMBA_REG: OTP_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_AMBA_REG_TRNG_CLK_ENABLE_Pos (8UL)              /*!< CRG_TOP CLK_AMBA_REG: TRNG_CLK_ENABLE (Bit 8)         */
#define CRG_TOP_CLK_AMBA_REG_TRNG_CLK_ENABLE_Msk (0x100UL)          /*!< CRG_TOP CLK_AMBA_REG: TRNG_CLK_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_AMBA_REG_ECC_CLK_ENABLE_Pos (7UL)               /*!< CRG_TOP CLK_AMBA_REG: ECC_CLK_ENABLE (Bit 7)          */
#define CRG_TOP_CLK_AMBA_REG_ECC_CLK_ENABLE_Msk (0x80UL)            /*!< CRG_TOP CLK_AMBA_REG: ECC_CLK_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Pos (6UL)               /*!< CRG_TOP CLK_AMBA_REG: AES_CLK_ENABLE (Bit 6)          */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Msk (0x40UL)            /*!< CRG_TOP CLK_AMBA_REG: AES_CLK_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Pos (4UL)                     /*!< CRG_TOP CLK_AMBA_REG: PCLK_DIV (Bit 4)                */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Msk (0x30UL)                  /*!< CRG_TOP CLK_AMBA_REG: PCLK_DIV (Bitfield-Mask: 0x03)  */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Pos (0UL)                     /*!< CRG_TOP CLK_AMBA_REG: HCLK_DIV (Bit 0)                */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Msk (0x7UL)                   /*!< CRG_TOP CLK_AMBA_REG: HCLK_DIV (Bitfield-Mask: 0x07)  */
/* =====================================================  CLK_CTRL_REG  ====================================================== */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_PLL96M_Pos (15UL)           /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_PLL96M (Bit 15)      */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_PLL96M_Msk (0x8000UL)       /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_PLL96M (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL16M_Pos (14UL)          /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_XTAL16M (Bit 14)     */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL16M_Msk (0x4000UL)      /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_XTAL16M (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RC16M_Pos (13UL)            /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_RC16M (Bit 13)       */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RC16M_Msk (0x2000UL)        /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_RC16M (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_32K_Pos (12UL)              /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_32K (Bit 12)         */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_32K_Msk (0x1000UL)          /*!< CRG_TOP CLK_CTRL_REG: RUNNING_AT_32K (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_CLK32K_SOURCE_Pos (8UL)                /*!< CRG_TOP CLK_CTRL_REG: CLK32K_SOURCE (Bit 8)           */
#define CRG_TOP_CLK_CTRL_REG_CLK32K_SOURCE_Msk (0x300UL)            /*!< CRG_TOP CLK_CTRL_REG: CLK32K_SOURCE (Bitfield-Mask: 0x03) */
#define CRG_TOP_CLK_CTRL_REG_DIVN_SYNC_LEVEL_Pos (7UL)              /*!< CRG_TOP CLK_CTRL_REG: DIVN_SYNC_LEVEL (Bit 7)         */
#define CRG_TOP_CLK_CTRL_REG_DIVN_SYNC_LEVEL_Msk (0x80UL)           /*!< CRG_TOP CLK_CTRL_REG: DIVN_SYNC_LEVEL (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_DIVN_XTAL32M_MODE_Pos (6UL)            /*!< CRG_TOP CLK_CTRL_REG: DIVN_XTAL32M_MODE (Bit 6)       */
#define CRG_TOP_CLK_CTRL_REG_DIVN_XTAL32M_MODE_Msk (0x40UL)         /*!< CRG_TOP CLK_CTRL_REG: DIVN_XTAL32M_MODE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_PLL_DIV2_Pos (5UL)                     /*!< CRG_TOP CLK_CTRL_REG: PLL_DIV2 (Bit 5)                */
#define CRG_TOP_CLK_CTRL_REG_PLL_DIV2_Msk (0x20UL)                  /*!< CRG_TOP CLK_CTRL_REG: PLL_DIV2 (Bitfield-Mask: 0x01)  */
#define CRG_TOP_CLK_CTRL_REG_USB_CLK_SRC_Pos (4UL)                  /*!< CRG_TOP CLK_CTRL_REG: USB_CLK_SRC (Bit 4)             */
#define CRG_TOP_CLK_CTRL_REG_USB_CLK_SRC_Msk (0x10UL)               /*!< CRG_TOP CLK_CTRL_REG: USB_CLK_SRC (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_XTAL32M_MODE_Pos (3UL)                 /*!< CRG_TOP CLK_CTRL_REG: XTAL32M_MODE (Bit 3)            */
#define CRG_TOP_CLK_CTRL_REG_XTAL32M_MODE_Msk (0x8UL)               /*!< CRG_TOP CLK_CTRL_REG: XTAL32M_MODE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_XTAL16M_DISABLE_Pos (2UL)              /*!< CRG_TOP CLK_CTRL_REG: XTAL16M_DISABLE (Bit 2)         */
#define CRG_TOP_CLK_CTRL_REG_XTAL16M_DISABLE_Msk (0x4UL)            /*!< CRG_TOP CLK_CTRL_REG: XTAL16M_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Pos (0UL)                  /*!< CRG_TOP CLK_CTRL_REG: SYS_CLK_SEL (Bit 0)             */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Msk (0x3UL)                /*!< CRG_TOP CLK_CTRL_REG: SYS_CLK_SEL (Bitfield-Mask: 0x03) */
/* ===================================================  CLK_FREQ_TRIM_REG  =================================================== */
#define CRG_TOP_CLK_FREQ_TRIM_REG_COARSE_ADJ_Pos (8UL)              /*!< CRG_TOP CLK_FREQ_TRIM_REG: COARSE_ADJ (Bit 8)         */
#define CRG_TOP_CLK_FREQ_TRIM_REG_COARSE_ADJ_Msk (0x700UL)          /*!< CRG_TOP CLK_FREQ_TRIM_REG: COARSE_ADJ (Bitfield-Mask: 0x07) */
#define CRG_TOP_CLK_FREQ_TRIM_REG_FINE_ADJ_Pos (0UL)                /*!< CRG_TOP CLK_FREQ_TRIM_REG: FINE_ADJ (Bit 0)           */
#define CRG_TOP_CLK_FREQ_TRIM_REG_FINE_ADJ_Msk (0xffUL)             /*!< CRG_TOP CLK_FREQ_TRIM_REG: FINE_ADJ (Bitfield-Mask: 0xff) */
/* =====================================================  CLK_RADIO_REG  ===================================================== */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_ENABLE_Pos (11UL)            /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_ENABLE (Bit 11)       */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_ENABLE_Msk (0x800UL)         /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_DIV_Pos (8UL)                /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_DIV (Bit 8)           */
#define CRG_TOP_CLK_RADIO_REG_FTDF_MAC_DIV_Msk (0x300UL)            /*!< CRG_TOP CLK_RADIO_REG: FTDF_MAC_DIV (Bitfield-Mask: 0x03) */
#define CRG_TOP_CLK_RADIO_REG_BLE_ENABLE_Pos (7UL)                  /*!< CRG_TOP CLK_RADIO_REG: BLE_ENABLE (Bit 7)             */
#define CRG_TOP_CLK_RADIO_REG_BLE_ENABLE_Msk (0x80UL)               /*!< CRG_TOP CLK_RADIO_REG: BLE_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_RADIO_REG_BLE_LP_RESET_Pos (6UL)                /*!< CRG_TOP CLK_RADIO_REG: BLE_LP_RESET (Bit 6)           */
#define CRG_TOP_CLK_RADIO_REG_BLE_LP_RESET_Msk (0x40UL)             /*!< CRG_TOP CLK_RADIO_REG: BLE_LP_RESET (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_RADIO_REG_BLE_DIV_Pos (4UL)                     /*!< CRG_TOP CLK_RADIO_REG: BLE_DIV (Bit 4)                */
#define CRG_TOP_CLK_RADIO_REG_BLE_DIV_Msk (0x30UL)                  /*!< CRG_TOP CLK_RADIO_REG: BLE_DIV (Bitfield-Mask: 0x03)  */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Pos (3UL)                 /*!< CRG_TOP CLK_RADIO_REG: RFCU_ENABLE (Bit 3)            */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Msk (0x8UL)               /*!< CRG_TOP CLK_RADIO_REG: RFCU_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_RADIO_REG_RFCU_DIV_Pos (0UL)                    /*!< CRG_TOP CLK_RADIO_REG: RFCU_DIV (Bit 0)               */
#define CRG_TOP_CLK_RADIO_REG_RFCU_DIV_Msk (0x3UL)                  /*!< CRG_TOP CLK_RADIO_REG: RFCU_DIV (Bitfield-Mask: 0x03) */
/* ====================================================  CLK_RCX20K_REG  ===================================================== */
