S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_ENABLE_Pos (11UL)             /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_ENABLE (Bit 11)        */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_ENABLE_Msk (0x800UL)          /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_LOWF_Pos (10UL)               /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_LOWF (Bit 10)          */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_LOWF_Msk (0x400UL)            /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_LOWF (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_BIAS_Pos (8UL)                /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_BIAS (Bit 8)           */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_BIAS_Msk (0x300UL)            /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_BIAS (Bitfield-Mask: 0x03) */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_NTC_Pos (4UL)                 /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_NTC (Bit 4)            */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_NTC_Msk (0xf0UL)              /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_NTC (Bitfield-Mask: 0x0f) */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_TRIM_Pos (0UL)                /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_TRIM (Bit 0)           */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_TRIM_Msk (0xfUL)              /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_TRIM (Bitfield-Mask: 0x0f) */
/* ======================================================  CLK_TMR_REG  ====================================================== */
#define CRG_TOP_CLK_TMR_REG_P06_TMR1_PWM_MODE_Pos (14UL)            /*!< CRG_TOP CLK_TMR_REG: P06_TMR1_PWM_MODE (Bit 14)       */
#define CRG_TOP_CLK_TMR_REG_P06_TMR1_PWM_MODE_Msk (0x4000UL)        /*!< CRG_TOP CLK_TMR_REG: P06_TMR1_PWM_MODE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Pos (13UL)              /*!< CRG_TOP CLK_TMR_REG: WAKEUPCT_ENABLE (Bit 13)         */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Msk (0x2000UL)          /*!< CRG_TOP CLK_TMR_REG: WAKEUPCT_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_BREATH_ENABLE_Pos (12UL)                /*!< CRG_TOP CLK_TMR_REG: BREATH_ENABLE (Bit 12)           */
#define CRG_TOP_CLK_TMR_REG_BREATH_ENABLE_Msk (0x1000UL)            /*!< CRG_TOP CLK_TMR_REG: BREATH_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_TMR2_CLK_SEL_Pos (11UL)                 /*!< CRG_TOP CLK_TMR_REG: TMR2_CLK_SEL (Bit 11)            */
#define CRG_TOP_CLK_TMR_REG_TMR2_CLK_SEL_Msk (0x800UL)              /*!< CRG_TOP CLK_TMR_REG: TMR2_CLK_SEL (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_TMR2_ENABLE_Pos (10UL)                  /*!< CRG_TOP CLK_TMR_REG: TMR2_ENABLE (Bit 10)             */
#define CRG_TOP_CLK_TMR_REG_TMR2_ENABLE_Msk (0x400UL)               /*!< CRG_TOP CLK_TMR_REG: TMR2_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_TMR2_DIV_Pos  (8UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR2_DIV (Bit 8)                 */
#define CRG_TOP_CLK_TMR_REG_TMR2_DIV_Msk  (0x300UL)                 /*!< CRG_TOP CLK_TMR_REG: TMR2_DIV (Bitfield-Mask: 0x03)   */
#define CRG_TOP_CLK_TMR_REG_TMR1_CLK_SEL_Pos (7UL)                  /*!< CRG_TOP CLK_TMR_REG: TMR1_CLK_SEL (Bit 7)             */
#define CRG_TOP_CLK_TMR_REG_TMR1_CLK_SEL_Msk (0x80UL)               /*!< CRG_TOP CLK_TMR_REG: TMR1_CLK_SEL (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_TMR1_ENABLE_Pos (6UL)                   /*!< CRG_TOP CLK_TMR_REG: TMR1_ENABLE (Bit 6)              */
#define CRG_TOP_CLK_TMR_REG_TMR1_ENABLE_Msk (0x40UL)                /*!< CRG_TOP CLK_TMR_REG: TMR1_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_TMR1_DIV_Pos  (4UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR1_DIV (Bit 4)                 */
#define CRG_TOP_CLK_TMR_REG_TMR1_DIV_Msk  (0x30UL)                  /*!< CRG_TOP CLK_TMR_REG: TMR1_DIV (Bitfield-Mask: 0x03)   */
#define CRG_TOP_CLK_TMR_REG_TMR0_CLK_SEL_Pos (3UL)                  /*!< CRG_TOP CLK_TMR_REG: TMR0_CLK_SEL (Bit 3)             */
#define CRG_TOP_CLK_TMR_REG_TMR0_CLK_SEL_Msk (0x8UL)                /*!< CRG_TOP CLK_TMR_REG: TMR0_CLK_SEL (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_TMR0_ENABLE_Pos (2UL)                   /*!< CRG_TOP CLK_TMR_REG: TMR0_ENABLE (Bit 2)              */
#define CRG_TOP_CLK_TMR_REG_TMR0_ENABLE_Msk (0x4UL)                 /*!< CRG_TOP CLK_TMR_REG: TMR0_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_CLK_TMR_REG_TMR0_DIV_Pos  (0UL)                     /*!< CRG_TOP CLK_TMR_REG: TMR0_DIV (Bit 0)                 */
#define CRG_TOP_CLK_TMR_REG_TMR0_DIV_Msk  (0x3UL)                   /*!< CRG_TOP CLK_TMR_REG: TMR0_DIV (Bitfield-Mask: 0x03)   */
/* =====================================================  DIVN_SYNC_REG  ===================================================== */
#define CRG_TOP_DIVN_SYNC_REG_DIVN_SYNC_Pos (0UL)                   /*!< CRG_TOP DIVN_SYNC_REG: DIVN_SYNC (Bit 0)              */
#define CRG_TOP_DIVN_SYNC_REG_DIVN_SYNC_Msk (0x1UL)                 /*!< CRG_TOP DIVN_SYNC_REG: DIVN_SYNC (Bitfield-Mask: 0x01) */
/* ====================================================  FORCE_SLEEP_REG  ==================================================== */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_BLE_SLEEP_Pos (1UL)           /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_BLE_SLEEP (Bit 1)      */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_BLE_SLEEP_Msk (0x2UL)         /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_BLE_SLEEP (Bitfield-Mask: 0x01) */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_FTDF_SLEEP_Pos (0UL)          /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_FTDF_SLEEP (Bit 0)     */
#define CRG_TOP_FORCE_SLEEP_REG_FORCE_FTDF_SLEEP_Msk (0x1UL)        /*!< CRG_TOP FORCE_SLEEP_REG: FORCE_FTDF_SLEEP (Bitfield-Mask: 0x01) */
/* ===================================================  LDOS_DISABLE_REG  ==================================================== */
#define CRG_TOP_LDOS_DISABLE_REG_LDOS_DISABLE_Pos (0UL)             /*!< CRG_TOP LDOS_DISABLE_REG: LDOS_DISABLE (Bit 0)        */
#define CRG_TOP_LDOS_DISABLE_REG_LDOS_DISABLE_Msk (0x1UL)           /*!< CRG_TOP LDOS_DISABLE_REG: LDOS_DISABLE (Bitfield-Mask: 0x01) */
/* =====================================================  LDO_CTRL1_REG  ===================================================== */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_ENABLE_Pos (14UL)           /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_ENABLE (Bit 14)      */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_ENABLE_Msk (0x4000UL)       /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_SETVDD_Pos (11UL)           /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_SETVDD (Bit 11)      */
#define CRG_TOP_LDO_CTRL1_REG_LDO_RADIO_SETVDD_Msk (0x3800UL)       /*!< CRG_TOP LDO_CTRL1_REG: LDO_RADIO_SETVDD (Bitfield-Mask: 0x07) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_SETVDD_Pos (8UL)             /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_SETVDD (Bit 8)        */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_SETVDD_Msk (0x700UL)         /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_SETVDD (Bitfield-Mask: 0x07) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_USB_LEVEL_Pos (6UL)        /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_USB_LEVEL (Bit 6)   */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_USB_LEVEL_Msk (0xc0UL)     /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_USB_LEVEL (Bitfield-Mask: 0x03) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_VBAT_LEVEL_Pos (4UL)       /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_VBAT_LEVEL (Bit 4)  */
#define CRG_TOP_LDO_CTRL1_REG_LDO_SUPPLY_VBAT_LEVEL_Msk (0x30UL)    /*!< CRG_TOP LDO_CTRL1_REG: LDO_SUPPLY_VBAT_LEVEL (Bitfield-Mask: 0x03) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_VBAT_RET_LEVEL_Pos (2UL)          /*!< CRG_TOP LDO_CTRL1_REG: LDO_VBAT_RET_LEVEL (Bit 2)     */
#define CRG_TOP_LDO_CTRL1_REG_LDO_VBAT_RET_LEVEL_Msk (0xcUL)        /*!< CRG_TOP LDO_CTRL1_REG: LDO_VBAT_RET_LEVEL (Bitfield-Mask: 0x03) */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_CURLIM_Pos (0UL)             /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_CURLIM (Bit 0)        */
#define CRG_TOP_LDO_CTRL1_REG_LDO_CORE_CURLIM_Msk (0x3UL)           /*!< CRG_TOP LDO_CTRL1_REG: LDO_CORE_CURLIM (Bitfield-Mask: 0x03) */
/* =====================================================  LDO_CTRL2_REG  ===================================================== */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_RET_DISABLE_Pos (6UL)      /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_RET_DISABLE (Bit 6) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_RET_DISABLE_Msk (0x40UL)   /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_RET_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_RET_DISABLE_Pos (5UL)   /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_RET_DISABLE (Bit 5) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_RET_DISABLE_Msk (0x20UL) /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_RET_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_VBAT_RET_DISABLE_Pos (4UL)        /*!< CRG_TOP LDO_CTRL2_REG: LDO_VBAT_RET_DISABLE (Bit 4)   */
#define CRG_TOP_LDO_CTRL2_REG_LDO_VBAT_RET_DISABLE_Msk (0x10UL)     /*!< CRG_TOP LDO_CTRL2_REG: LDO_VBAT_RET_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_ON_Pos (3UL)               /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_ON (Bit 3)          */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_PA_ON_Msk (0x8UL)             /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_PA_ON (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_ON_Pos (2UL)            /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_ON (Bit 2)       */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V8_FLASH_ON_Msk (0x4UL)          /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V8_FLASH_ON (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_3V3_ON_Pos (1UL)                  /*!< CRG_TOP LDO_CTRL2_REG: LDO_3V3_ON (Bit 1)             */
#define CRG_TOP_LDO_CTRL2_REG_LDO_3V3_ON_Msk (0x2UL)                /*!< CRG_TOP LDO_CTRL2_REG: LDO_3V3_ON (Bitfield-Mask: 0x01) */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V2_ON_Pos (0UL)                  /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V2_ON (Bit 0)             */
#define CRG_TOP_LDO_CTRL2_REG_LDO_1V2_ON_Msk (0x1UL)                /*!< CRG_TOP LDO_CTRL2_REG: LDO_1V2_ON (Bitfield-Mask: 0x01) */
/* =====================================================  PMU_CTRL_REG  ====================================================== */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_ECCRAM_Pos (15UL)               /*!< CRG_TOP PMU_CTRL_REG: RETAIN_ECCRAM (Bit 15)          */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_ECCRAM_Msk (0x8000UL)           /*!< CRG_TOP PMU_CTRL_REG: RETAIN_ECCRAM (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Pos (14UL)                /*!< CRG_TOP PMU_CTRL_REG: RETAIN_CACHE (Bit 14)           */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Msk (0x4000UL)            /*!< CRG_TOP PMU_CTRL_REG: RETAIN_CACHE (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_ENABLE_CLKLESS_Pos (13UL)              /*!< CRG_TOP PMU_CTRL_REG: ENABLE_CLKLESS (Bit 13)         */
#define CRG_TOP_PMU_CTRL_REG_ENABLE_CLKLESS_Msk (0x2000UL)          /*!< CRG_TOP PMU_CTRL_REG: ENABLE_CLKLESS (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_RAM_Pos (8UL)                   /*!< CRG_TOP PMU_CTRL_REG: RETAIN_RAM (Bit 8)              */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_RAM_Msk (0x1f00UL)              /*!< CRG_TOP PMU_CTRL_REG: RETAIN_RAM (Bitfield-Mask: 0x1f) */
#define CRG_TOP_PMU_CTRL_REG_OTP_COPY_DIV_Pos (6UL)                 /*!< CRG_TOP PMU_CTRL_REG: OTP_COPY_DIV (Bit 6)            */
#define CRG_TOP_PMU_CTRL_REG_OTP_COPY_DIV_Msk (0xc0UL)              /*!< CRG_TOP PMU_CTRL_REG: OTP_COPY_DIV (Bitfield-Mask: 0x03) */
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Pos (5UL)              /*!< CRG_TOP PMU_CTRL_REG: RESET_ON_WAKEUP (Bit 5)         */
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Msk (0x20UL)           /*!< CRG_TOP PMU_CTRL_REG: RESET_ON_WAKEUP (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_FTDF_SLEEP_Pos (3UL)                   /*!< CRG_TOP PMU_CTRL_REG: FTDF_SLEEP (Bit 3)              */
#define CRG_TOP_PMU_CTRL_REG_FTDF_SLEEP_Msk (0x8UL)                 /*!< CRG_TOP PMU_CTRL_REG: FTDF_SLEEP (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_BLE_SLEEP_Pos (2UL)                    /*!< CRG_TOP PMU_CTRL_REG: BLE_SLEEP (Bit 2)               */
#define CRG_TOP_PMU_CTRL_REG_BLE_SLEEP_Msk (0x4UL)                  /*!< CRG_TOP PMU_CTRL_REG: BLE_SLEEP (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Pos (1UL)                  /*!< CRG_TOP PMU_CTRL_REG: RADIO_SLEEP (Bit 1)             */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Msk (0x2UL)                /*!< CRG_TOP PMU_CTRL_REG: RADIO_SLEEP (Bitfield-Mask: 0x01) */
#define CRG_TOP_PMU_CTRL_REG_PERIPH_SLEEP_Pos (0UL)                 /*!< CRG_TOP PMU_CTRL_REG: PERIPH_SLEEP (Bit 0)            */
#define CRG_TOP_PMU_CTRL_REG_PERIPH_SLEEP_Msk (0x1UL)               /*!< CRG_TOP PMU_CTRL_REG: PERIPH_SLEEP (Bitfield-Mask: 0x01) */
/* ====================================================  POWER_CTRL_REG  ===================================================== */
#define CRG_TOP_POWER_CTRL_REG_TRIM_NEWBAT_Pos (0UL)                /*!< CRG_TOP POWER_CTRL_REG: TRIM_NEWBAT (Bit 0)           */
#define CRG_TOP_POWER_CTRL_REG_TRIM_NEWBAT_Msk (0x7UL)              /*!< CRG_TOP POWER_CTRL_REG: TRIM_NEWBAT (Bitfield-Mask: 0x07) */
/* ====================================================  SLEEP_TIMER_REG  ==================================================== */
#define CRG_TOP_SLEEP_TIMER_REG_SLEEP_TIMER_Pos (0UL)               /*!< CRG_TOP SLEEP_TIMER_REG: SLEEP_TIMER (Bit 0)          */
#define CRG_TOP_SLEEP_TIMER_REG_SLEEP_TIMER_Msk (0xffffUL)          /*!< CRG_TOP SLEEP_TIMER_REG: SLEEP_TIMER (Bitfield-Mask: 0xffff) */
/* ==================================================  STARTUP_STATUS_REG  =================================================== */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_1V8_FLASH_OK_Pos (13UL)   /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_1V8_FLASH_OK (Bit 13) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_1V8_FLASH_OK_Msk (0x2000UL) /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_1V8_FLASH_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_NEWBAT_Pos (12UL)             /*!< CRG_TOP STARTUP_STATUS_REG: SU_NEWBAT (Bit 12)        */
#define CRG_TOP_STARTUP_STATUS_REG_SU_NEWBAT_Msk (0x1000UL)         /*!< CRG_TOP STARTUP_STATUS_REG: SU_NEWBAT (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_1V8_FLASH_HIGH_Pos (11UL) /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_1V8_FLASH_HIGH (Bit 11) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_1V8_FLASH_HIGH_Msk (0x800UL) /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_1V8_FLASH_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_1V8_PA_HIGH_Pos (10UL)   /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_1V8_PA_HIGH (Bit 10) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_1V8_PA_HIGH_Msk (0x400UL) /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_1V8_PA_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_VBUS_LOW_Pos (9UL)       /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_VBUS_LOW (Bit 9)  */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_VBUS_LOW_Msk (0x200UL)   /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_VBUS_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_VBUS_HIGH_Pos (8UL)      /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_VBUS_HIGH (Bit 8) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_VBUS_HIGH_Msk (0x100UL)  /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_VBUS_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_V33_HIGH_Pos (7UL)       /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_V33_HIGH (Bit 7)  */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_V33_HIGH_Msk (0x80UL)    /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_V33_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_VDD_HIGH_Pos (6UL)       /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_VDD_HIGH (Bit 6)  */
#define CRG_TOP_STARTUP_STATUS_REG_SU_COMP_VDD_HIGH_Msk (0x40UL)    /*!< CRG_TOP STARTUP_STATUS_REG: SU_COMP_VDD_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_1V8_PA_OK_Pos (5UL)       /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_1V8_PA_OK (Bit 5)  */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_1V8_PA_OK_Msk (0x20UL)    /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_1V8_PA_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_CORE_OK_Pos (4UL)         /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_CORE_OK (Bit 4)    */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_CORE_OK_Msk (0x10UL)      /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_CORE_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LOD_SUPPLY_USB_OK_Pos (3UL)   /*!< CRG_TOP STARTUP_STATUS_REG: SU_LOD_SUPPLY_USB_OK (Bit 3) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LOD_SUPPLY_USB_OK_Msk (0x8UL) /*!< CRG_TOP STARTUP_STATUS_REG: SU_LOD_SUPPLY_USB_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_SUPPLY_VBAT_OK_Pos (2UL)  /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_SUPPLY_VBAT_OK (Bit 2) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_LDO_SUPPLY_VBAT_OK_Msk (0x4UL) /*!< CRG_TOP STARTUP_STATUS_REG: SU_LDO_SUPPLY_VBAT_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_VBUS_AVAILABLE_Pos (1UL)      /*!< CRG_TOP STARTUP_STATUS_REG: SU_VBUS_AVAILABLE (Bit 1) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_VBUS_AVAILABLE_Msk (0x2UL)    /*!< CRG_TOP STARTUP_STATUS_REG: SU_VBUS_AVAILABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_STARTUP_STATUS_REG_SU_BANDGAP_OK_Pos (0UL)          /*!< CRG_TOP STARTUP_STATUS_REG: SU_BANDGAP_OK (Bit 0)     */
#define CRG_TOP_STARTUP_STATUS_REG_SU_BANDGAP_OK_Msk (0x1UL)        /*!< CRG_TOP STARTUP_STATUS_REG: SU_BANDGAP_OK (Bitfield-Mask: 0x01) */
/* =====================================================  SYS_CTRL_REG  ====================================================== */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Pos (15UL)                    /*!< CRG_TOP SYS_CTRL_REG: SW_RESET (Bit 15)               */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Msk (0x8000UL)                /*!< CRG_TOP SYS_CTRL_REG: SW_RESET (Bitfield-Mask: 0x01)  */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Pos (14UL)               /*!< CRG_TOP SYS_CTRL_REG: REMAP_INTVECT (Bit 14)          */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Msk (0x4000UL)           /*!< CRG_TOP SYS_CTRL_REG: REMAP_INTVECT (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_OTP_COPY_Pos (13UL)                    /*!< CRG_TOP SYS_CTRL_REG: OTP_COPY (Bit 13)               */
#define CRG_TOP_SYS_CTRL_REG_OTP_COPY_Msk (0x2000UL)                /*!< CRG_TOP SYS_CTRL_REG: OTP_COPY (Bitfield-Mask: 0x01)  */
#define CRG_TOP_SYS_CTRL_REG_QSPI_INIT_Pos (12UL)                   /*!< CRG_TOP SYS_CTRL_REG: QSPI_INIT (Bit 12)              */
#define CRG_TOP_SYS_CTRL_REG_QSPI_INIT_Msk (0x1000UL)               /*!< CRG_TOP SYS_CTRL_REG: QSPI_INIT (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_DEV_PHASE_Pos (11UL)                   /*!< CRG_TOP SYS_CTRL_REG: DEV_PHASE (Bit 11)              */
#define CRG_TOP_SYS_CTRL_REG_DEV_PHASE_Msk (0x800UL)                /*!< CRG_TOP SYS_CTRL_REG: DEV_PHASE (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Pos (10UL)                /*!< CRG_TOP SYS_CTRL_REG: CACHERAM_MUX (Bit 10)           */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Msk (0x400UL)             /*!< CRG_TOP SYS_CTRL_REG: CACHERAM_MUX (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_TIMEOUT_DISABLE_Pos (9UL)              /*!< CRG_TOP SYS_CTRL_REG: TIMEOUT_DISABLE (Bit 9)         */
#define CRG_TOP_SYS_CTRL_REG_TIMEOUT_DISABLE_Msk (0x200UL)          /*!< CRG_TOP SYS_CTRL_REG: TIMEOUT_DISABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_DRA_OFF_Pos  (8UL)                     /*!< CRG_TOP SYS_CTRL_REG: DRA_OFF (Bit 8)                 */
#define CRG_TOP_SYS_CTRL_REG_DRA_OFF_Msk  (0x100UL)                 /*!< CRG_TOP SYS_CTRL_REG: DRA_OFF (Bitfield-Mask: 0x01)   */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Pos (7UL)              /*!< CRG_TOP SYS_CTRL_REG: DEBUGGER_ENABLE (Bit 7)         */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Msk (0x80UL)           /*!< CRG_TOP SYS_CTRL_REG: DEBUGGER_ENABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_OTPC_RESET_REQ_Pos (6UL)               /*!< CRG_TOP SYS_CTRL_REG: OTPC_RESET_REQ (Bit 6)          */
#define CRG_TOP_SYS_CTRL_REG_OTPC_RESET_REQ_Msk (0x40UL)            /*!< CRG_TOP SYS_CTRL_REG: OTPC_RESET_REQ (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_PAD_LATCH_EN_Pos (5UL)                 /*!< CRG_TOP SYS_CTRL_REG: PAD_LATCH_EN (Bit 5)            */
#define CRG_TOP_SYS_CTRL_REG_PAD_LATCH_EN_Msk (0x20UL)              /*!< CRG_TOP SYS_CTRL_REG: PAD_LATCH_EN (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_CTRL_REG_REMAP_RAMS_Pos (3UL)                   /*!< CRG_TOP SYS_CTRL_REG: REMAP_RAMS (Bit 3)              */
#define CRG_TOP_SYS_CTRL_REG_REMAP_RAMS_Msk (0x18UL)                /*!< CRG_TOP SYS_CTRL_REG: REMAP_RAMS (Bitfield-Mask: 0x03) */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Pos (0UL)                   /*!< CRG_TOP SYS_CTRL_REG: REMAP_ADR0 (Bit 0)              */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Msk (0x7UL)                 /*!< CRG_TOP SYS_CTRL_REG: REMAP_ADR0 (Bitfield-Mask: 0x07) */
/* =====================================================  SYS_STAT_REG  ====================================================== */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_UP_Pos (11UL)                  /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_UP (Bit 11)             */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_UP_Msk (0x800UL)               /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_UP (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_DOWN_Pos (10UL)                /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_DOWN (Bit 10)           */
#define CRG_TOP_SYS_STAT_REG_FTDF_IS_DOWN_Msk (0x400UL)             /*!< CRG_TOP SYS_STAT_REG: FTDF_IS_DOWN (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_UP_Pos (9UL)                    /*!< CRG_TOP SYS_STAT_REG: BLE_IS_UP (Bit 9)               */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_UP_Msk (0x200UL)                /*!< CRG_TOP SYS_STAT_REG: BLE_IS_UP (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_DOWN_Pos (8UL)                  /*!< CRG_TOP SYS_STAT_REG: BLE_IS_DOWN (Bit 8)             */
#define CRG_TOP_SYS_STAT_REG_BLE_IS_DOWN_Msk (0x100UL)              /*!< CRG_TOP SYS_STAT_REG: BLE_IS_DOWN (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_XTAL16_TRIM_READY_Pos (6UL)            /*!< CRG_TOP SYS_STAT_REG: XTAL16_TRIM_READY (Bit 6)       */
#define CRG_TOP_SYS_STAT_REG_XTAL16_TRIM_READY_Msk (0x40UL)         /*!< CRG_TOP SYS_STAT_REG: XTAL16_TRIM_READY (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Pos (5UL)                /*!< CRG_TOP SYS_STAT_REG: DBG_IS_ACTIVE (Bit 5)           */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Msk (0x20UL)             /*!< CRG_TOP SYS_STAT_REG: DBG_IS_ACTIVE (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_PER_IS_UP_Pos (3UL)                    /*!< CRG_TOP SYS_STAT_REG: PER_IS_UP (Bit 3)               */
#define CRG_TOP_SYS_STAT_REG_PER_IS_UP_Msk (0x8UL)                  /*!< CRG_TOP SYS_STAT_REG: PER_IS_UP (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_PER_IS_DOWN_Pos (2UL)                  /*!< CRG_TOP SYS_STAT_REG: PER_IS_DOWN (Bit 2)             */
#define CRG_TOP_SYS_STAT_REG_PER_IS_DOWN_Msk (0x4UL)                /*!< CRG_TOP SYS_STAT_REG: PER_IS_DOWN (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Pos (1UL)                    /*!< CRG_TOP SYS_STAT_REG: RAD_IS_UP (Bit 1)               */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Msk (0x2UL)                  /*!< CRG_TOP SYS_STAT_REG: RAD_IS_UP (Bitfield-Mask: 0x01) */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Pos (0UL)                  /*!< CRG_TOP SYS_STAT_REG: RAD_IS_DOWN (Bit 0)             */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Msk (0x1UL)                /*!< CRG_TOP SYS_STAT_REG: RAD_IS_DOWN (Bitfield-Mask: 0x01) */
