S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* =====================================================  TRIM_CTRL_REG  ===================================================== */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_TRIM_SELECT_Pos (6UL)            /*!< CRG_TOP TRIM_CTRL_REG: XTAL_TRIM_SELECT (Bit 6)       */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_TRIM_SELECT_Msk (0xc0UL)         /*!< CRG_TOP TRIM_CTRL_REG: XTAL_TRIM_SELECT (Bitfield-Mask: 0x03) */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_COUNT_N_Pos (0UL)                /*!< CRG_TOP TRIM_CTRL_REG: XTAL_COUNT_N (Bit 0)           */
#define CRG_TOP_TRIM_CTRL_REG_XTAL_COUNT_N_Msk (0x3fUL)             /*!< CRG_TOP TRIM_CTRL_REG: XTAL_COUNT_N (Bitfield-Mask: 0x3f) */
/* ==================================================  VBUS_IRQ_CLEAR_REG  =================================================== */
#define CRG_TOP_VBUS_IRQ_CLEAR_REG_VBUS_IRQ_CLEAR_Pos (0UL)         /*!< CRG_TOP VBUS_IRQ_CLEAR_REG: VBUS_IRQ_CLEAR (Bit 0)    */
#define CRG_TOP_VBUS_IRQ_CLEAR_REG_VBUS_IRQ_CLEAR_Msk (0xffffUL)    /*!< CRG_TOP VBUS_IRQ_CLEAR_REG: VBUS_IRQ_CLEAR (Bitfield-Mask: 0xffff) */
/* ===================================================  VBUS_IRQ_MASK_REG  =================================================== */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_RISE_Pos (1UL)        /*!< CRG_TOP VBUS_IRQ_MASK_REG: VBUS_IRQ_EN_RISE (Bit 1)   */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_RISE_Msk (0x2UL)      /*!< CRG_TOP VBUS_IRQ_MASK_REG: VBUS_IRQ_EN_RISE (Bitfield-Mask: 0x01) */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_FALL_Pos (0UL)        /*!< CRG_TOP VBUS_IRQ_MASK_REG: VBUS_IRQ_EN_FALL (Bit 0)   */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_FALL_Msk (0x1UL)      /*!< CRG_TOP VBUS_IRQ_MASK_REG: VBUS_IRQ_EN_FALL (Bitfield-Mask: 0x01) */
/* ===================================================  XTALRDY_CTRL_REG  ==================================================== */
#define CRG_TOP_XTALRDY_CTRL_REG_XTALRDY_CNT_Pos (0UL)              /*!< CRG_TOP XTALRDY_CTRL_REG: XTALRDY_CNT (Bit 0)         */
#define CRG_TOP_XTALRDY_CTRL_REG_XTALRDY_CNT_Msk (0xffUL)           /*!< CRG_TOP XTALRDY_CTRL_REG: XTALRDY_CNT (Bitfield-Mask: 0xff) */
/* ===================================================  XTALRDY_STAT_REG  ==================================================== */
#define CRG_TOP_XTALRDY_STAT_REG_XTALRDY_STAT_Pos (0UL)             /*!< CRG_TOP XTALRDY_STAT_REG: XTALRDY_STAT (Bit 0)        */
#define CRG_TOP_XTALRDY_STAT_REG_XTALRDY_STAT_Msk (0xffUL)          /*!< CRG_TOP XTALRDY_STAT_REG: XTALRDY_STAT (Bitfield-Mask: 0xff) */


/* =========================================================================================================================== */
/* ================                                           DCDC                                            ================ */
/* =========================================================================================================================== */

/* ====================================================  DCDC_CTRL_0_REG  ==================================================== */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FAST_STARTUP_Pos (14UL)           /*!< DCDC DCDC_CTRL_0_REG: DCDC_FAST_STARTUP (Bit 14)      */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FAST_STARTUP_Msk (0x4000UL)       /*!< DCDC DCDC_CTRL_0_REG: DCDC_FAST_STARTUP (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_CTRL_0_REG_DCDC_BROWNOUT_LV_MODE_Pos (13UL)       /*!< DCDC DCDC_CTRL_0_REG: DCDC_BROWNOUT_LV_MODE (Bit 13)  */
#define DCDC_DCDC_CTRL_0_REG_DCDC_BROWNOUT_LV_MODE_Msk (0x2000UL)   /*!< DCDC DCDC_CTRL_0_REG: DCDC_BROWNOUT_LV_MODE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_CTRL_0_REG_DCDC_IDLE_CLK_DIV_Pos (11UL)           /*!< DCDC DCDC_CTRL_0_REG: DCDC_IDLE_CLK_DIV (Bit 11)      */
#define DCDC_DCDC_CTRL_0_REG_DCDC_IDLE_CLK_DIV_Msk (0x1800UL)       /*!< DCDC DCDC_CTRL_0_REG: DCDC_IDLE_CLK_DIV (Bitfield-Mask: 0x03) */
#define DCDC_DCDC_CTRL_0_REG_DCDC_PRIORITY_Pos (3UL)                /*!< DCDC DCDC_CTRL_0_REG: DCDC_PRIORITY (Bit 3)           */
#define DCDC_DCDC_CTRL_0_REG_DCDC_PRIORITY_Msk (0x7f8UL)            /*!< DCDC DCDC_CTRL_0_REG: DCDC_PRIORITY (Bitfield-Mask: 0xff) */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FW_ENABLE_Pos (2UL)               /*!< DCDC DCDC_CTRL_0_REG: DCDC_FW_ENABLE (Bit 2)          */
#define DCDC_DCDC_CTRL_0_REG_DCDC_FW_ENABLE_Msk (0x4UL)             /*!< DCDC DCDC_CTRL_0_REG: DCDC_FW_ENABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_CTRL_0_REG_DCDC_MODE_Pos (0UL)                    /*!< DCDC DCDC_CTRL_0_REG: DCDC_MODE (Bit 0)               */
#define DCDC_DCDC_CTRL_0_REG_DCDC_MODE_Msk (0x3UL)                  /*!< DCDC DCDC_CTRL_0_REG: DCDC_MODE (Bitfield-Mask: 0x03) */
/* ====================================================  DCDC_CTRL_1_REG  ==================================================== */
#define DCDC_DCDC_CTRL_1_REG_DCDC_STARTUP_DELAY_Pos (11UL)          /*!< DCDC DCDC_CTRL_1_REG: DCDC_STARTUP_DELAY (Bit 11)     */
#define DCDC_DCDC_CTRL_1_REG_DCDC_STARTUP_DELAY_Msk (0xf800UL)      /*!< DCDC DCDC_CTRL_1_REG: DCDC_STARTUP_DELAY (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_CTRL_1_REG_DCDC_GLOBAL_MAX_IDLE_TIME_Pos (5UL)    /*!< DCDC DCDC_CTRL_1_REG: DCDC_GLOBAL_MAX_IDLE_TIME (Bit 5) */
#define DCDC_DCDC_CTRL_1_REG_DCDC_GLOBAL_MAX_IDLE_TIME_Msk (0x7e0UL) /*!< DCDC DCDC_CTRL_1_REG: DCDC_GLOBAL_MAX_IDLE_TIME (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_CTRL_1_REG_DCDC_TIMEOUT_Pos (0UL)                 /*!< DCDC DCDC_CTRL_1_REG: DCDC_TIMEOUT (Bit 0)            */
#define DCDC_DCDC_CTRL_1_REG_DCDC_TIMEOUT_Msk (0x1fUL)              /*!< DCDC DCDC_CTRL_1_REG: DCDC_TIMEOUT (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_CTRL_2_REG  ==================================================== */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_TRIG_Pos (12UL)       /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_TRIG (Bit 12)  */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_TRIG_Msk (0xf000UL)   /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_TRIG (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_RES_Pos (8UL)         /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_RES (Bit 8)    */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TIMEOUT_IRQ_RES_Msk (0xf00UL)     /*!< DCDC DCDC_CTRL_2_REG: DCDC_TIMEOUT_IRQ_RES (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TUNE_Pos (6UL)                    /*!< DCDC DCDC_CTRL_2_REG: DCDC_TUNE (Bit 6)               */
#define DCDC_DCDC_CTRL_2_REG_DCDC_TUNE_Msk (0xc0UL)                 /*!< DCDC DCDC_CTRL_2_REG: DCDC_TUNE (Bitfield-Mask: 0x03) */
#define DCDC_DCDC_CTRL_2_REG_DCDC_LSSUP_TRIM_Pos (3UL)              /*!< DCDC DCDC_CTRL_2_REG: DCDC_LSSUP_TRIM (Bit 3)         */
#define DCDC_DCDC_CTRL_2_REG_DCDC_LSSUP_TRIM_Msk (0x38UL)           /*!< DCDC DCDC_CTRL_2_REG: DCDC_LSSUP_TRIM (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_CTRL_2_REG_DCDC_HSGND_TRIM_Pos (0UL)              /*!< DCDC DCDC_CTRL_2_REG: DCDC_HSGND_TRIM (Bit 0)         */
#define DCDC_DCDC_CTRL_2_REG_DCDC_HSGND_TRIM_Msk (0x7UL)            /*!< DCDC DCDC_CTRL_2_REG: DCDC_HSGND_TRIM (Bitfield-Mask: 0x07) */
/* ==================================================  DCDC_IRQ_CLEAR_REG  =================================================== */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_BROWN_OUT_IRQ_CLEAR_Pos (4UL)  /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_BROWN_OUT_IRQ_CLEAR (Bit 4) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_BROWN_OUT_IRQ_CLEAR_Msk (0x10UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_BROWN_OUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18P_TIMEOUT_IRQ_CLEAR_Pos (3UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18P_TIMEOUT_IRQ_CLEAR (Bit 3) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18P_TIMEOUT_IRQ_CLEAR_Msk (0x8UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18P_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_VDD_TIMEOUT_IRQ_CLEAR_Pos (2UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_VDD_TIMEOUT_IRQ_CLEAR (Bit 2) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_VDD_TIMEOUT_IRQ_CLEAR_Msk (0x4UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_VDD_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18_TIMEOUT_IRQ_CLEAR_Pos (1UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18_TIMEOUT_IRQ_CLEAR (Bit 1) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18_TIMEOUT_IRQ_CLEAR_Msk (0x2UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V14_TIMEOUT_IRQ_CLEAR_Pos (0UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V14_TIMEOUT_IRQ_CLEAR (Bit 0) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V14_TIMEOUT_IRQ_CLEAR_Msk (0x1UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V14_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
/* ===================================================  DCDC_IRQ_MASK_REG  =================================================== */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_BROWN_OUT_IRQ_MASK_Pos (4UL)    /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_BROWN_OUT_IRQ_MASK (Bit 4) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_BROWN_OUT_IRQ_MASK_Msk (0x10UL) /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_BROWN_OUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18P_TIMEOUT_IRQ_MASK_Pos (3UL) /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18P_TIMEOUT_IRQ_MASK (Bit 3) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18P_TIMEOUT_IRQ_MASK_Msk (0x8UL) /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18P_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_VDD_TIMEOUT_IRQ_MASK_Pos (2UL)  /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_VDD_TIMEOUT_IRQ_MASK (Bit 2) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_VDD_TIMEOUT_IRQ_MASK_Msk (0x4UL) /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_VDD_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18_TIMEOUT_IRQ_MASK_Pos (1UL)  /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18_TIMEOUT_IRQ_MASK (Bit 1) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18_TIMEOUT_IRQ_MASK_Msk (0x2UL) /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V14_TIMEOUT_IRQ_MASK_Pos (0UL)  /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V14_TIMEOUT_IRQ_MASK (Bit 0) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V14_TIMEOUT_IRQ_MASK_Msk (0x1UL) /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V14_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
/* ==================================================  DCDC_IRQ_STATUS_REG  ================================================== */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_BROWN_OUT_IRQ_STATUS_Pos (4UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_BROWN_OUT_IRQ_STATUS (Bit 4) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_BROWN_OUT_IRQ_STATUS_Msk (0x10UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_BROWN_OUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18P_TIMEOUT_IRQ_STATUS_Pos (3UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18P_TIMEOUT_IRQ_STATUS (Bit 3) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18P_TIMEOUT_IRQ_STATUS_Msk (0x8UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18P_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_VDD_TIMEOUT_IRQ_STATUS_Pos (2UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_VDD_TIMEOUT_IRQ_STATUS (Bit 2) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_VDD_TIMEOUT_IRQ_STATUS_Msk (0x4UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_VDD_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18_TIMEOUT_IRQ_STATUS_Pos (1UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18_TIMEOUT_IRQ_STATUS (Bit 1) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18_TIMEOUT_IRQ_STATUS_Msk (0x2UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V14_TIMEOUT_IRQ_STATUS_Pos (0UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V14_TIMEOUT_IRQ_STATUS (Bit 0) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V14_TIMEOUT_IRQ_STATUS_Msk (0x1UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V14_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
/* ====================================================  DCDC_RET_0_REG  ===================================================== */
#define DCDC_DCDC_RET_0_REG_DCDC_V18P_RET_CYCLES_Pos (13UL)         /*!< DCDC DCDC_RET_0_REG: DCDC_V18P_RET_CYCLES (Bit 13)    */
#define DCDC_DCDC_RET_0_REG_DCDC_V18P_RET_CYCLES_Msk (0xe000UL)     /*!< DCDC DCDC_RET_0_REG: DCDC_V18P_RET_CYCLES (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_RET_0_REG_DCDC_V18P_CUR_LIM_RET_Pos (8UL)         /*!< DCDC DCDC_RET_0_REG: DCDC_V18P_CUR_LIM_RET (Bit 8)    */
#define DCDC_DCDC_RET_0_REG_DCDC_V18P_CUR_LIM_RET_Msk (0x1f00UL)    /*!< DCDC DCDC_RET_0_REG: DCDC_V18P_CUR_LIM_RET (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_RET_0_REG_DCDC_VDD_RET_CYCLES_Pos (5UL)           /*!< DCDC DCDC_RET_0_REG: DCDC_VDD_RET_CYCLES (Bit 5)      */
#define DCDC_DCDC_RET_0_REG_DCDC_VDD_RET_CYCLES_Msk (0xe0UL)        /*!< DCDC DCDC_RET_0_REG: DCDC_VDD_RET_CYCLES (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_RET_0_REG_DCDC_VDD_CUR_LIM_RET_Pos (0UL)          /*!< DCDC DCDC_RET_0_REG: DCDC_VDD_CUR_LIM_RET (Bit 0)     */
#define DCDC_DCDC_RET_0_REG_DCDC_VDD_CUR_LIM_RET_Msk (0x1fUL)       /*!< DCDC DCDC_RET_0_REG: DCDC_VDD_CUR_LIM_RET (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_RET_1_REG  ===================================================== */
#define DCDC_DCDC_RET_1_REG_DCDC_V18_RET_CYCLES_Pos (13UL)          /*!< DCDC DCDC_RET_1_REG: DCDC_V18_RET_CYCLES (Bit 13)     */
#define DCDC_DCDC_RET_1_REG_DCDC_V18_RET_CYCLES_Msk (0xe000UL)      /*!< DCDC DCDC_RET_1_REG: DCDC_V18_RET_CYCLES (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_RET_1_REG_DCDC_V18_CUR_LIM_RET_Pos (8UL)          /*!< DCDC DCDC_RET_1_REG: DCDC_V18_CUR_LIM_RET (Bit 8)     */
#define DCDC_DCDC_RET_1_REG_DCDC_V18_CUR_LIM_RET_Msk (0x1f00UL)     /*!< DCDC DCDC_RET_1_REG: DCDC_V18_CUR_LIM_RET (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_RET_1_REG_DCDC_V14_RET_CYCLES_Pos (5UL)           /*!< DCDC DCDC_RET_1_REG: DCDC_V14_RET_CYCLES (Bit 5)      */
#define DCDC_DCDC_RET_1_REG_DCDC_V14_RET_CYCLES_Msk (0xe0UL)        /*!< DCDC DCDC_RET_1_REG: DCDC_V14_RET_CYCLES (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_RET_1_REG_DCDC_V14_CUR_LIM_RET_Pos (0UL)          /*!< DCDC DCDC_RET_1_REG: DCDC_V14_CUR_LIM_RET (Bit 0)     */
#define DCDC_DCDC_RET_1_REG_DCDC_V14_CUR_LIM_RET_Msk (0x1fUL)       /*!< DCDC DCDC_RET_1_REG: DCDC_V14_CUR_LIM_RET (Bitfield-Mask: 0x1f) */
/* ===================================================  DCDC_STATUS_0_REG  =================================================== */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_3_Pos (9UL)          /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_3 (Bit 9)     */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_3_Msk (0xe00UL)      /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_3 (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_2_Pos (6UL)          /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_2 (Bit 6)     */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_2_Msk (0x1c0UL)      /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_2 (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_1_Pos (3UL)          /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_1 (Bit 3)     */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_1_Msk (0x38UL)       /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_1 (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_0_Pos (0UL)          /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_0 (Bit 0)     */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_0_Msk (0x7UL)        /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_0 (Bitfield-Mask: 0x07) */
/* ===================================================  DCDC_STATUS_1_REG  =================================================== */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_AVAILABLE_Pos (11UL)       /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_AVAILABLE (Bit 11)  */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_AVAILABLE_Msk (0x800UL)    /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_AVAILABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_AVAILABLE_Pos (10UL)        /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_AVAILABLE (Bit 10)   */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_AVAILABLE_Msk (0x400UL)     /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_AVAILABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_AVAILABLE_Pos (9UL)         /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_AVAILABLE (Bit 9)    */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_AVAILABLE_Msk (0x200UL)     /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_AVAILABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_AVAILABLE_Pos (8UL)         /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_AVAILABLE (Bit 8)    */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_AVAILABLE_Msk (0x100UL)     /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_AVAILABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_OK_Pos (7UL)               /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_OK (Bit 7)          */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_OK_Msk (0x80UL)            /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_OK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_OK_Pos (6UL)                /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_OK (Bit 6)           */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_OK_Msk (0x40UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_OK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_OK_Pos (5UL)                /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_OK (Bit 5)           */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_OK_Msk (0x20UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_OK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_OK_Pos (4UL)                /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_OK (Bit 4)           */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_OK_Msk (0x10UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_OK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_NOK_Pos (3UL)              /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_NOK (Bit 3)         */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_NOK_Msk (0x8UL)            /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_NOK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_NOK_Pos (2UL)               /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_NOK (Bit 2)          */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_NOK_Msk (0x4UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_NOK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_NOK_Pos (1UL)               /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_NOK (Bit 1)          */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_NOK_Msk (0x2UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_NOK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_NOK_Pos (0UL)               /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_NOK (Bit 0)          */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_NOK_Msk (0x1UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_NOK (Bitfield-Mask: 0x01) */
/* ===================================================  DCDC_STATUS_2_REG  =================================================== */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18P_SW_STATE_Pos (11UL)        /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18P_SW_STATE (Bit 11)   */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18P_SW_STATE_Msk (0x800UL)     /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18P_SW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_VDD_SW_STATE_Pos (10UL)         /*!< DCDC DCDC_STATUS_2_REG: DCDC_VDD_SW_STATE (Bit 10)    */
#define DCDC_DCDC_STATUS_2_REG_DCDC_VDD_SW_STATE_Msk (0x400UL)      /*!< DCDC DCDC_STATUS_2_REG: DCDC_VDD_SW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18_SW_STATE_Pos (9UL)          /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18_SW_STATE (Bit 9)     */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18_SW_STATE_Msk (0x200UL)      /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18_SW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V14_SW_STATE_Pos (8UL)          /*!< DCDC DCDC_STATUS_2_REG: DCDC_V14_SW_STATE (Bit 8)     */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V14_SW_STATE_Msk (0x100UL)      /*!< DCDC DCDC_STATUS_2_REG: DCDC_V14_SW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_NSW_STATE_Pos (7UL)             /*!< DCDC DCDC_STATUS_2_REG: DCDC_NSW_STATE (Bit 7)        */
#define DCDC_DCDC_STATUS_2_REG_DCDC_NSW_STATE_Msk (0x80UL)          /*!< DCDC DCDC_STATUS_2_REG: DCDC_NSW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_PSW_STATE_Pos (6UL)             /*!< DCDC DCDC_STATUS_2_REG: DCDC_PSW_STATE (Bit 6)        */
#define DCDC_DCDC_STATUS_2_REG_DCDC_PSW_STATE_Msk (0x40UL)          /*!< DCDC DCDC_STATUS_2_REG: DCDC_PSW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_P_Pos (5UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_P (Bit 5)         */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_P_Msk (0x20UL)           /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_P (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_N_Pos (4UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_N (Bit 4)         */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_N_Msk (0x10UL)           /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_N (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_P_Pos (3UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_P (Bit 3)         */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_P_Msk (0x8UL)            /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_P (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_N_Pos (2UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_N (Bit 2)         */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_N_Msk (0x4UL)            /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_N (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_Pos (1UL)                /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP (Bit 1)           */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_Msk (0x2UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_Pos (0UL)                /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP (Bit 0)           */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_Msk (0x1UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP (Bitfield-Mask: 0x01) */
/* ===================================================  DCDC_STATUS_3_REG  =================================================== */
#define DCDC_DCDC_STATUS_3_REG_DCDC_LV_MODE_Pos (10UL)              /*!< DCDC DCDC_STATUS_3_REG: DCDC_LV_MODE (Bit 10)         */
#define DCDC_DCDC_STATUS_3_REG_DCDC_LV_MODE_Msk (0x400UL)           /*!< DCDC DCDC_STATUS_3_REG: DCDC_LV_MODE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_V18P_Pos (5UL)            /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_V18P (Bit 5)       */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_V18P_Msk (0x3e0UL)        /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_V18P (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_VDD_Pos (0UL)             /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_VDD (Bit 0)        */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_VDD_Msk (0x1fUL)          /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_VDD (Bitfield-Mask: 0x1f) */
/* ===================================================  DCDC_STATUS_4_REG  =================================================== */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V18_Pos (5UL)             /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V18 (Bit 5)        */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V18_Msk (0x3e0UL)         /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V18 (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V14_Pos (0UL)             /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V14 (Bit 0)        */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V14_Msk (0x1fUL)          /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V14 (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_TEST_0_REG  ==================================================== */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_COMP_CLK_Pos (15UL)         /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_COMP_CLK (Bit 15)    */
