S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_COMP_CLK_Msk (0x8000UL)     /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_COMP_CLK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_CURRENT_Pos (14UL)          /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_CURRENT (Bit 14)     */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_CURRENT_Msk (0x4000UL)      /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_CURRENT (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_OUTPUT_MONITOR_Pos (11UL)         /*!< DCDC DCDC_TEST_0_REG: DCDC_OUTPUT_MONITOR (Bit 11)    */
#define DCDC_DCDC_TEST_0_REG_DCDC_OUTPUT_MONITOR_Msk (0x3800UL)     /*!< DCDC DCDC_TEST_0_REG: DCDC_OUTPUT_MONITOR (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_TEST_0_REG_DCDC_ANA_TEST_Pos (8UL)                /*!< DCDC DCDC_TEST_0_REG: DCDC_ANA_TEST (Bit 8)           */
#define DCDC_DCDC_TEST_0_REG_DCDC_ANA_TEST_Msk (0x700UL)            /*!< DCDC DCDC_TEST_0_REG: DCDC_ANA_TEST (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_IDLE_Pos (7UL)              /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_IDLE (Bit 7)         */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_IDLE_Msk (0x80UL)           /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_IDLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18P_Pos (6UL)              /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18P (Bit 6)         */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18P_Msk (0x40UL)           /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18P (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_VDD_Pos (5UL)               /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_VDD (Bit 5)          */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_VDD_Msk (0x20UL)            /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_VDD (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18_Pos (4UL)               /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18 (Bit 4)          */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18_Msk (0x10UL)            /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18 (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V14_Pos (3UL)               /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V14 (Bit 3)          */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V14_Msk (0x8UL)             /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V14 (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_FW_Pos (2UL)                /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_FW (Bit 2)           */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_FW_Msk (0x4UL)              /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_FW (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_NSW_Pos (1UL)               /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_NSW (Bit 1)          */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_NSW_Msk (0x2UL)             /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_NSW (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_PSW_Pos (0UL)               /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_PSW (Bit 0)          */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_PSW_Msk (0x1UL)             /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_PSW (Bitfield-Mask: 0x01) */
/* ====================================================  DCDC_TEST_1_REG  ==================================================== */
#define DCDC_DCDC_TEST_1_REG_DCDC_COMP_CLK_Pos (9UL)                /*!< DCDC DCDC_TEST_1_REG: DCDC_COMP_CLK (Bit 9)           */
#define DCDC_DCDC_TEST_1_REG_DCDC_COMP_CLK_Msk (0x1e00UL)           /*!< DCDC DCDC_TEST_1_REG: DCDC_COMP_CLK (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_CURRENT_Pos (4UL)            /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_CURRENT (Bit 4)       */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_CURRENT_Msk (0x1f0UL)        /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_CURRENT (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_REG_Pos (0UL)                /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_REG (Bit 0)           */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_REG_Msk (0xfUL)              /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_REG (Bitfield-Mask: 0x0f) */
/* ====================================================  DCDC_TRIM_0_REG  ==================================================== */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_P_Pos (6UL)              /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_P (Bit 6)         */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_P_Msk (0xfc0UL)          /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_P (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_N_Pos (0UL)              /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_N (Bit 0)         */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_N_Msk (0x3fUL)           /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_N (Bitfield-Mask: 0x3f) */
/* ====================================================  DCDC_TRIM_1_REG  ==================================================== */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_P_Pos (6UL)              /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_P (Bit 6)         */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_P_Msk (0xfc0UL)          /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_P (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_N_Pos (0UL)              /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_N (Bit 0)         */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_N_Msk (0x3fUL)           /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_N (Bitfield-Mask: 0x3f) */
/* ====================================================  DCDC_TRIM_2_REG  ==================================================== */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_P_Pos (6UL)              /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_P (Bit 6)         */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_P_Msk (0xfc0UL)          /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_P (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_N_Pos (0UL)              /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_N (Bit 0)         */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_N_Msk (0x3fUL)           /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_N (Bitfield-Mask: 0x3f) */
/* ====================================================  DCDC_TRIM_3_REG  ==================================================== */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_P_Pos (6UL)             /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_P (Bit 6)        */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_P_Msk (0xfc0UL)         /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_P (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_N_Pos (0UL)             /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_N (Bit 0)        */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_N_Msk (0x3fUL)          /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_N (Bitfield-Mask: 0x3f) */
/* =====================================================  DCDC_TRIM_REG  ===================================================== */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_MAN_TRIM_Pos (13UL)          /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_MAN_TRIM (Bit 13)     */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_MAN_TRIM_Msk (0x2000UL)      /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_MAN_TRIM (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_TRIM_Pos (7UL)               /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_TRIM (Bit 7)          */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_TRIM_Msk (0x1f80UL)          /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_TRIM (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_MAN_TRIM_Pos (6UL)           /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_MAN_TRIM (Bit 6)      */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_MAN_TRIM_Msk (0x40UL)        /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_MAN_TRIM (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_TRIM_Pos (0UL)               /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_TRIM (Bit 0)          */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_TRIM_Msk (0x3fUL)            /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_TRIM (Bitfield-Mask: 0x3f) */
/* ====================================================  DCDC_V14_0_REG  ===================================================== */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_FAST_RAMPING_Pos (15UL)        /*!< DCDC DCDC_V14_0_REG: DCDC_V14_FAST_RAMPING (Bit 15)   */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_FAST_RAMPING_Msk (0x8000UL)    /*!< DCDC DCDC_V14_0_REG: DCDC_V14_FAST_RAMPING (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_VOLTAGE_Pos (10UL)             /*!< DCDC DCDC_V14_0_REG: DCDC_V14_VOLTAGE (Bit 10)        */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_VOLTAGE_Msk (0x7c00UL)         /*!< DCDC DCDC_V14_0_REG: DCDC_V14_VOLTAGE (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MAX_HV_Pos (5UL)       /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MAX_HV (Bit 5)  */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MAX_HV_Msk (0x3e0UL)   /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MAX_HV (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MIN_Pos (0UL)          /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MIN (Bit 0)     */
#define DCDC_DCDC_V14_0_REG_DCDC_V14_CUR_LIM_MIN_Msk (0x1fUL)       /*!< DCDC DCDC_V14_0_REG: DCDC_V14_CUR_LIM_MIN (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_V14_1_REG  ===================================================== */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_HV_Pos (15UL)           /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_HV (Bit 15)      */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_HV_Msk (0x8000UL)       /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_HV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_LV_Pos (14UL)           /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_LV (Bit 14)      */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_ENABLE_LV_Msk (0x4000UL)       /*!< DCDC DCDC_V14_1_REG: DCDC_V14_ENABLE_LV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_CUR_LIM_MAX_LV_Pos (10UL)      /*!< DCDC DCDC_V14_1_REG: DCDC_V14_CUR_LIM_MAX_LV (Bit 10) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_CUR_LIM_MAX_LV_Msk (0x3c00UL)  /*!< DCDC DCDC_V14_1_REG: DCDC_V14_CUR_LIM_MAX_LV (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_HYST_Pos (5UL)            /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_HYST (Bit 5)       */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_HYST_Msk (0x3e0UL)        /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_HYST (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_MIN_Pos (0UL)             /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_MIN (Bit 0)        */
#define DCDC_DCDC_V14_1_REG_DCDC_V14_IDLE_MIN_Msk (0x1fUL)          /*!< DCDC DCDC_V14_1_REG: DCDC_V14_IDLE_MIN (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_V18P_0_REG  ==================================================== */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_FAST_RAMPING_Pos (15UL)      /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_FAST_RAMPING (Bit 15) */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_FAST_RAMPING_Msk (0x8000UL)  /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_FAST_RAMPING (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_VOLTAGE_Pos (10UL)           /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_VOLTAGE (Bit 10)      */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_VOLTAGE_Msk (0x7c00UL)       /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_VOLTAGE (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_CUR_LIM_MAX_HV_Pos (5UL)     /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_CUR_LIM_MAX_HV (Bit 5) */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_CUR_LIM_MAX_HV_Msk (0x3e0UL) /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_CUR_LIM_MAX_HV (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_CUR_LIM_MIN_Pos (0UL)        /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_CUR_LIM_MIN (Bit 0)   */
#define DCDC_DCDC_V18P_0_REG_DCDC_V18P_CUR_LIM_MIN_Msk (0x1fUL)     /*!< DCDC DCDC_V18P_0_REG: DCDC_V18P_CUR_LIM_MIN (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_V18P_1_REG  ==================================================== */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_ENABLE_HV_Pos (15UL)         /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_ENABLE_HV (Bit 15)    */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_ENABLE_HV_Msk (0x8000UL)     /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_ENABLE_HV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_ENABLE_LV_Pos (14UL)         /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_ENABLE_LV (Bit 14)    */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_ENABLE_LV_Msk (0x4000UL)     /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_ENABLE_LV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_CUR_LIM_MAX_LV_Pos (10UL)    /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_CUR_LIM_MAX_LV (Bit 10) */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_CUR_LIM_MAX_LV_Msk (0x3c00UL) /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_CUR_LIM_MAX_LV (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_IDLE_HYST_Pos (5UL)          /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_IDLE_HYST (Bit 5)     */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_IDLE_HYST_Msk (0x3e0UL)      /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_IDLE_HYST (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_IDLE_MIN_Pos (0UL)           /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_IDLE_MIN (Bit 0)      */
#define DCDC_DCDC_V18P_1_REG_DCDC_V18P_IDLE_MIN_Msk (0x1fUL)        /*!< DCDC DCDC_V18P_1_REG: DCDC_V18P_IDLE_MIN (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_V18_0_REG  ===================================================== */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_FAST_RAMPING_Pos (15UL)        /*!< DCDC DCDC_V18_0_REG: DCDC_V18_FAST_RAMPING (Bit 15)   */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_FAST_RAMPING_Msk (0x8000UL)    /*!< DCDC DCDC_V18_0_REG: DCDC_V18_FAST_RAMPING (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_VOLTAGE_Pos (10UL)             /*!< DCDC DCDC_V18_0_REG: DCDC_V18_VOLTAGE (Bit 10)        */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_VOLTAGE_Msk (0x7c00UL)         /*!< DCDC DCDC_V18_0_REG: DCDC_V18_VOLTAGE (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_CUR_LIM_MAX_HV_Pos (5UL)       /*!< DCDC DCDC_V18_0_REG: DCDC_V18_CUR_LIM_MAX_HV (Bit 5)  */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_CUR_LIM_MAX_HV_Msk (0x3e0UL)   /*!< DCDC DCDC_V18_0_REG: DCDC_V18_CUR_LIM_MAX_HV (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_CUR_LIM_MIN_Pos (0UL)          /*!< DCDC DCDC_V18_0_REG: DCDC_V18_CUR_LIM_MIN (Bit 0)     */
#define DCDC_DCDC_V18_0_REG_DCDC_V18_CUR_LIM_MIN_Msk (0x1fUL)       /*!< DCDC DCDC_V18_0_REG: DCDC_V18_CUR_LIM_MIN (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_V18_1_REG  ===================================================== */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_ENABLE_HV_Pos (15UL)           /*!< DCDC DCDC_V18_1_REG: DCDC_V18_ENABLE_HV (Bit 15)      */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_ENABLE_HV_Msk (0x8000UL)       /*!< DCDC DCDC_V18_1_REG: DCDC_V18_ENABLE_HV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_ENABLE_LV_Pos (14UL)           /*!< DCDC DCDC_V18_1_REG: DCDC_V18_ENABLE_LV (Bit 14)      */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_ENABLE_LV_Msk (0x4000UL)       /*!< DCDC DCDC_V18_1_REG: DCDC_V18_ENABLE_LV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_CUR_LIM_MAX_LV_Pos (10UL)      /*!< DCDC DCDC_V18_1_REG: DCDC_V18_CUR_LIM_MAX_LV (Bit 10) */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_CUR_LIM_MAX_LV_Msk (0x3c00UL)  /*!< DCDC DCDC_V18_1_REG: DCDC_V18_CUR_LIM_MAX_LV (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_IDLE_HYST_Pos (5UL)            /*!< DCDC DCDC_V18_1_REG: DCDC_V18_IDLE_HYST (Bit 5)       */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_IDLE_HYST_Msk (0x3e0UL)        /*!< DCDC DCDC_V18_1_REG: DCDC_V18_IDLE_HYST (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_IDLE_MIN_Pos (0UL)             /*!< DCDC DCDC_V18_1_REG: DCDC_V18_IDLE_MIN (Bit 0)        */
#define DCDC_DCDC_V18_1_REG_DCDC_V18_IDLE_MIN_Msk (0x1fUL)          /*!< DCDC DCDC_V18_1_REG: DCDC_V18_IDLE_MIN (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_VDD_0_REG  ===================================================== */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_FAST_RAMPING_Pos (15UL)        /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_FAST_RAMPING (Bit 15)   */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_FAST_RAMPING_Msk (0x8000UL)    /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_FAST_RAMPING (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_VOLTAGE_Pos (10UL)             /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_VOLTAGE (Bit 10)        */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_VOLTAGE_Msk (0x7c00UL)         /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_VOLTAGE (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_CUR_LIM_MAX_HV_Pos (5UL)       /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_CUR_LIM_MAX_HV (Bit 5)  */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_CUR_LIM_MAX_HV_Msk (0x3e0UL)   /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_CUR_LIM_MAX_HV (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_CUR_LIM_MIN_Pos (0UL)          /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_CUR_LIM_MIN (Bit 0)     */
#define DCDC_DCDC_VDD_0_REG_DCDC_VDD_CUR_LIM_MIN_Msk (0x1fUL)       /*!< DCDC DCDC_VDD_0_REG: DCDC_VDD_CUR_LIM_MIN (Bitfield-Mask: 0x1f) */
/* ====================================================  DCDC_VDD_1_REG  ===================================================== */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_ENABLE_HV_Pos (15UL)           /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_ENABLE_HV (Bit 15)      */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_ENABLE_HV_Msk (0x8000UL)       /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_ENABLE_HV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_ENABLE_LV_Pos (14UL)           /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_ENABLE_LV (Bit 14)      */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_ENABLE_LV_Msk (0x4000UL)       /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_ENABLE_LV (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_CUR_LIM_MAX_LV_Pos (10UL)      /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_CUR_LIM_MAX_LV (Bit 10) */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_CUR_LIM_MAX_LV_Msk (0x3c00UL)  /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_CUR_LIM_MAX_LV (Bitfield-Mask: 0x0f) */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_IDLE_HYST_Pos (5UL)            /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_IDLE_HYST (Bit 5)       */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_IDLE_HYST_Msk (0x3e0UL)        /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_IDLE_HYST (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_IDLE_MIN_Pos (0UL)             /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_IDLE_MIN (Bit 0)        */
#define DCDC_DCDC_VDD_1_REG_DCDC_VDD_IDLE_MIN_Msk (0x1fUL)          /*!< DCDC DCDC_VDD_1_REG: DCDC_VDD_IDLE_MIN (Bitfield-Mask: 0x1f) */


/* =========================================================================================================================== */
/* ================                                            DEM                                            ================ */
/* =========================================================================================================================== */

