S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ====================================================  RF_AFC_CTRL_REG  ==================================================== */
#define DEM_RF_AFC_CTRL_REG_POLE2_Pos     (6UL)                     /*!< DEM RF_AFC_CTRL_REG: POLE2 (Bit 6)                    */
#define DEM_RF_AFC_CTRL_REG_POLE2_Msk     (0xc0UL)                  /*!< DEM RF_AFC_CTRL_REG: POLE2 (Bitfield-Mask: 0x03)      */
#define DEM_RF_AFC_CTRL_REG_POLE1_Pos     (4UL)                     /*!< DEM RF_AFC_CTRL_REG: POLE1 (Bit 4)                    */
#define DEM_RF_AFC_CTRL_REG_POLE1_Msk     (0x30UL)                  /*!< DEM RF_AFC_CTRL_REG: POLE1 (Bitfield-Mask: 0x03)      */
#define DEM_RF_AFC_CTRL_REG_AFC_MODE_Pos  (0UL)                     /*!< DEM RF_AFC_CTRL_REG: AFC_MODE (Bit 0)                 */
#define DEM_RF_AFC_CTRL_REG_AFC_MODE_Msk  (0xfUL)                   /*!< DEM RF_AFC_CTRL_REG: AFC_MODE (Bitfield-Mask: 0x0f)   */
/* ===================================================  RF_AGC_CTRL1_REG  ==================================================== */
#define DEM_RF_AGC_CTRL1_REG_AGC_MODE_Pos (14UL)                    /*!< DEM RF_AGC_CTRL1_REG: AGC_MODE (Bit 14)               */
#define DEM_RF_AGC_CTRL1_REG_AGC_MODE_Msk (0xc000UL)                /*!< DEM RF_AGC_CTRL1_REG: AGC_MODE (Bitfield-Mask: 0x03)  */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_HIGH_Pos (7UL)                  /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_HIGH (Bit 7)             */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_HIGH_Msk (0x3f80UL)             /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_HIGH (Bitfield-Mask: 0x7f) */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_LOW_Pos (0UL)                   /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_LOW (Bit 0)              */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_LOW_Msk (0x7fUL)                /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_LOW (Bitfield-Mask: 0x7f) */
/* ===================================================  RF_AGC_CTRL2_REG  ==================================================== */
#define DEM_RF_AGC_CTRL2_REG_SLOW_AGC_Pos (12UL)                    /*!< DEM RF_AGC_CTRL2_REG: SLOW_AGC (Bit 12)               */
#define DEM_RF_AGC_CTRL2_REG_SLOW_AGC_Msk (0x1000UL)                /*!< DEM RF_AGC_CTRL2_REG: SLOW_AGC (Bitfield-Mask: 0x01)  */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_WR_Pos (8UL)                /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_WR (Bit 8)           */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_WR_Msk (0xf00UL)            /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_WR (Bitfield-Mask: 0x0f) */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_SEL_Pos (7UL)               /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_SEL (Bit 7)          */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_SEL_Msk (0x80UL)            /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_SEL (Bitfield-Mask: 0x01) */
#define DEM_RF_AGC_CTRL2_REG_EN_FRZ_GAIN_Pos (6UL)                  /*!< DEM RF_AGC_CTRL2_REG: EN_FRZ_GAIN (Bit 6)             */
#define DEM_RF_AGC_CTRL2_REG_EN_FRZ_GAIN_Msk (0x40UL)               /*!< DEM RF_AGC_CTRL2_REG: EN_FRZ_GAIN (Bitfield-Mask: 0x01) */
#define DEM_RF_AGC_CTRL2_REG_RSSI_TH_Pos  (0UL)                     /*!< DEM RF_AGC_CTRL2_REG: RSSI_TH (Bit 0)                 */
#define DEM_RF_AGC_CTRL2_REG_RSSI_TH_Msk  (0x3fUL)                  /*!< DEM RF_AGC_CTRL2_REG: RSSI_TH (Bitfield-Mask: 0x3f)   */
/* ===================================================  RF_AGC_LUT_01_REG  =================================================== */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN1_Pos (14UL)                  /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN1 (Bit 14)             */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN1_Msk (0xc000UL)              /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN1 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN1_Pos (11UL)                 /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN1 (Bit 11)            */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN1_Msk (0x3800UL)             /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN1 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN1_Pos (8UL)                  /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN1 (Bit 8)             */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN1_Msk (0x700UL)              /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN1 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN0_Pos (6UL)                   /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN0 (Bit 6)              */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN0_Msk (0xc0UL)                /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN0 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN0_Pos (3UL)                  /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN0 (Bit 3)             */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN0_Msk (0x38UL)               /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN0 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN0_Pos (0UL)                  /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN0 (Bit 0)             */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN0_Msk (0x7UL)                /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN0 (Bitfield-Mask: 0x07) */
/* ===================================================  RF_AGC_LUT_23_REG  =================================================== */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN3_Pos (14UL)                  /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN3 (Bit 14)             */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN3_Msk (0xc000UL)              /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN3 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN3_Pos (11UL)                 /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN3 (Bit 11)            */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN3_Msk (0x3800UL)             /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN3 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN3_Pos (8UL)                  /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN3 (Bit 8)             */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN3_Msk (0x700UL)              /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN3 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN2_Pos (6UL)                   /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN2 (Bit 6)              */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN2_Msk (0xc0UL)                /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN2 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN2_Pos (3UL)                  /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN2 (Bit 3)             */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN2_Msk (0x38UL)               /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN2 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN2_Pos (0UL)                  /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN2 (Bit 0)             */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN2_Msk (0x7UL)                /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN2 (Bitfield-Mask: 0x07) */
/* ===================================================  RF_AGC_LUT_45_REG  =================================================== */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN5_Pos (14UL)                  /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN5 (Bit 14)             */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN5_Msk (0xc000UL)              /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN5 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN5_Pos (11UL)                 /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN5 (Bit 11)            */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN5_Msk (0x3800UL)             /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN5 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN5_Pos (8UL)                  /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN5 (Bit 8)             */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN5_Msk (0x700UL)              /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN5 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN4_Pos (6UL)                   /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN4 (Bit 6)              */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN4_Msk (0xc0UL)                /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN4 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN4_Pos (3UL)                  /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN4 (Bit 3)             */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN4_Msk (0x38UL)               /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN4 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN4_Pos (0UL)                  /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN4 (Bit 0)             */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN4_Msk (0x7UL)                /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN4 (Bitfield-Mask: 0x07) */
/* ===================================================  RF_AGC_LUT_67_REG  =================================================== */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN7_Pos (14UL)                  /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN7 (Bit 14)             */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN7_Msk (0xc000UL)              /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN7 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN7_Pos (11UL)                 /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN7 (Bit 11)            */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN7_Msk (0x3800UL)             /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN7 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN7_Pos (8UL)                  /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN7 (Bit 8)             */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN7_Msk (0x700UL)              /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN7 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN6_Pos (6UL)                   /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN6 (Bit 6)              */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN6_Msk (0xc0UL)                /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN6 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN6_Pos (3UL)                  /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN6 (Bit 3)             */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN6_Msk (0x38UL)               /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN6 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN6_Pos (0UL)                  /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN6 (Bit 0)             */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN6_Msk (0x7UL)                /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN6 (Bitfield-Mask: 0x07) */
/* ===================================================  RF_AGC_LUT_89_REG  =================================================== */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN9_Pos (14UL)                  /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN9 (Bit 14)             */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN9_Msk (0xc000UL)              /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN9 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN9_Pos (11UL)                 /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN9 (Bit 11)            */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN9_Msk (0x3800UL)             /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN9 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN9_Pos (8UL)                  /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN9 (Bit 8)             */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN9_Msk (0x700UL)              /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN9 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN8_Pos (6UL)                   /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN8 (Bit 6)              */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN8_Msk (0xc0UL)                /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN8 (Bitfield-Mask: 0x03) */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN8_Pos (3UL)                  /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN8 (Bit 3)             */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN8_Msk (0x38UL)               /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN8 (Bitfield-Mask: 0x07) */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN8_Pos (0UL)                  /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN8 (Bit 0)             */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN8_Msk (0x7UL)                /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN8 (Bitfield-Mask: 0x07) */
/* ===================================================  RF_AGC_RESULT_REG  =================================================== */
#define DEM_RF_AGC_RESULT_REG_AGCSETTING_RD_Pos (8UL)               /*!< DEM RF_AGC_RESULT_REG: AGCSETTING_RD (Bit 8)          */
#define DEM_RF_AGC_RESULT_REG_AGCSETTING_RD_Msk (0xf00UL)           /*!< DEM RF_AGC_RESULT_REG: AGCSETTING_RD (Bitfield-Mask: 0x0f) */
#define DEM_RF_AGC_RESULT_REG_AFC_RD_Pos  (0UL)                     /*!< DEM RF_AGC_RESULT_REG: AFC_RD (Bit 0)                 */
#define DEM_RF_AGC_RESULT_REG_AFC_RD_Msk  (0xffUL)                  /*!< DEM RF_AGC_RESULT_REG: AFC_RD (Bitfield-Mask: 0xff)   */
/* ================================================  RF_DC_OFFSET_CTRL1_REG  ================================================= */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_Q_WR_Pos (8UL)          /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_Q_WR (Bit 8)     */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_Q_WR_Msk (0xff00UL)     /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_Q_WR (Bitfield-Mask: 0xff) */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_I_WR_Pos (0UL)          /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_I_WR (Bit 0)     */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_I_WR_Msk (0xffUL)       /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_I_WR (Bitfield-Mask: 0xff) */
/* ================================================  RF_DC_OFFSET_CTRL2_REG  ================================================= */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_INIT_Pos (9UL)          /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_INIT (Bit 9)     */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_INIT_Msk (0x200UL)      /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_INIT (Bitfield-Mask: 0x01) */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNGAIN_Pos (7UL)                /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNGAIN (Bit 7)           */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNGAIN_Msk (0x180UL)            /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNGAIN (Bitfield-Mask: 0x03) */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNSTEP_Pos (4UL)                /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNSTEP (Bit 4)           */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNSTEP_Msk (0x70UL)             /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNSTEP (Bitfield-Mask: 0x07) */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPOLE_Pos (2UL)                 /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPOLE (Bit 2)            */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPOLE_Msk (0xcUL)               /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPOLE (Bitfield-Mask: 0x03) */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_EN_Pos (1UL)            /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_EN (Bit 1)       */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_EN_Msk (0x2UL)          /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCOFFSET_SEL_Pos (0UL)           /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCOFFSET_SEL (Bit 0)      */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCOFFSET_SEL_Msk (0x1UL)         /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCOFFSET_SEL (Bitfield-Mask: 0x01) */
/* ================================================  RF_DC_OFFSET_CTRL3_REG  ================================================= */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_Q_Pos (8UL)               /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_Q (Bit 8)          */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_Q_Msk (0xff00UL)          /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_Q (Bitfield-Mask: 0xff) */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_I_Pos (0UL)               /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_I (Bit 0)          */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_I_Msk (0xffUL)            /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_I (Bitfield-Mask: 0xff) */
/* ================================================  RF_DC_OFFSET_CTRL4_REG  ================================================= */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL3_Pos (12UL)    /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL3 (Bit 12) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL3_Msk (0xf000UL) /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL3 (Bitfield-Mask: 0x0f) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL2_Pos (8UL)     /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL2 (Bit 8) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL2_Msk (0xf00UL) /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL2 (Bitfield-Mask: 0x0f) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL1_Pos (4UL)     /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL1 (Bit 4) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL1_Msk (0xf0UL)  /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL1 (Bitfield-Mask: 0x0f) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL0_Pos (0UL)     /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL0 (Bit 0) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL0_Msk (0xfUL)   /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL0 (Bitfield-Mask: 0x0f) */
/* ================================================  RF_DC_OFFSET_RESULT_REG  ================================================ */
#define DEM_RF_DC_OFFSET_RESULT_REG_DCOFFSET_Q_RD_Pos (8UL)         /*!< DEM RF_DC_OFFSET_RESULT_REG: DCOFFSET_Q_RD (Bit 8)    */
#define DEM_RF_DC_OFFSET_RESULT_REG_DCOFFSET_Q_RD_Msk (0xff00UL)    /*!< DEM RF_DC_OFFSET_RESULT_REG: DCOFFSET_Q_RD (Bitfield-Mask: 0xff) */
#define DEM_RF_DC_OFFSET_RESULT_REG_DCOFFSET_I_RD_Pos (0UL)         /*!< DEM RF_DC_OFFSET_RESULT_REG: DCOFFSET_I_RD (Bit 0)    */
#define DEM_RF_DC_OFFSET_RESULT_REG_DCOFFSET_I_RD_Msk (0xffUL)      /*!< DEM RF_DC_OFFSET_RESULT_REG: DCOFFSET_I_RD (Bitfield-Mask: 0xff) */
/* ====================================================  RF_DEM_CTRL_REG  ==================================================== */
#define DEM_RF_DEM_CTRL_REG_IQCORR_EN_Pos (8UL)                     /*!< DEM RF_DEM_CTRL_REG: IQCORR_EN (Bit 8)                */
#define DEM_RF_DEM_CTRL_REG_IQCORR_EN_Msk (0x100UL)                 /*!< DEM RF_DEM_CTRL_REG: IQCORR_EN (Bitfield-Mask: 0x01)  */
#define DEM_RF_DEM_CTRL_REG_BLE_DDC_EN_Pos (7UL)                    /*!< DEM RF_DEM_CTRL_REG: BLE_DDC_EN (Bit 7)               */
#define DEM_RF_DEM_CTRL_REG_BLE_DDC_EN_Msk (0x80UL)                 /*!< DEM RF_DEM_CTRL_REG: BLE_DDC_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_DEM_CTRL_REG_EQUAL_EN_Pos  (6UL)                     /*!< DEM RF_DEM_CTRL_REG: EQUAL_EN (Bit 6)                 */
#define DEM_RF_DEM_CTRL_REG_EQUAL_EN_Msk  (0x40UL)                  /*!< DEM RF_DEM_CTRL_REG: EQUAL_EN (Bitfield-Mask: 0x01)   */
#define DEM_RF_DEM_CTRL_REG_MATCH0101_TH_Pos (2UL)                  /*!< DEM RF_DEM_CTRL_REG: MATCH0101_TH (Bit 2)             */
#define DEM_RF_DEM_CTRL_REG_MATCH0101_TH_Msk (0x3cUL)               /*!< DEM RF_DEM_CTRL_REG: MATCH0101_TH (Bitfield-Mask: 0x0f) */
#define DEM_RF_DEM_CTRL_REG_DEM_HSI_POL_Pos (1UL)                   /*!< DEM RF_DEM_CTRL_REG: DEM_HSI_POL (Bit 1)              */
#define DEM_RF_DEM_CTRL_REG_DEM_HSI_POL_Msk (0x2UL)                 /*!< DEM RF_DEM_CTRL_REG: DEM_HSI_POL (Bitfield-Mask: 0x01) */
#define DEM_RF_DEM_CTRL_REG_RXDATA_INV_Pos (0UL)                    /*!< DEM RF_DEM_CTRL_REG: RXDATA_INV (Bit 0)               */
#define DEM_RF_DEM_CTRL_REG_RXDATA_INV_Msk (0x1UL)                  /*!< DEM RF_DEM_CTRL_REG: RXDATA_INV (Bitfield-Mask: 0x01) */
/* =================================================  RF_DEM_IQCORRECT_REG  ================================================== */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_ALPHA_Pos (8UL)             /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_ALPHA (Bit 8)        */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_ALPHA_Msk (0xff00UL)        /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_ALPHA (Bitfield-Mask: 0xff) */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_BETA_Pos (0UL)              /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_BETA (Bit 0)         */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_BETA_Msk (0xffUL)           /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_BETA (Bitfield-Mask: 0xff) */
/* ==================================================  RF_DEM_TESTMODE_REG  ================================================== */
#define DEM_RF_DEM_TESTMODE_REG_DEM_TESTMODE_Pos (0UL)              /*!< DEM RF_DEM_TESTMODE_REG: DEM_TESTMODE (Bit 0)         */
#define DEM_RF_DEM_TESTMODE_REG_DEM_TESTMODE_Msk (0xffUL)           /*!< DEM RF_DEM_TESTMODE_REG: DEM_TESTMODE (Bitfield-Mask: 0xff) */
/* =================================================  RF_FSSS_I_RESULT_REG  ================================================== */
#define DEM_RF_FSSS_I_RESULT_REG_FSSS_I_RD_Pos (0UL)                /*!< DEM RF_FSSS_I_RESULT_REG: FSSS_I_RD (Bit 0)           */
#define DEM_RF_FSSS_I_RESULT_REG_FSSS_I_RD_Msk (0xffffUL)           /*!< DEM RF_FSSS_I_RESULT_REG: FSSS_I_RD (Bitfield-Mask: 0xffff) */
/* ================================================  RF_FSSS_MAG_RESULT_REG  ================================================= */
#define DEM_RF_FSSS_MAG_RESULT_REG_FSSS_MAG_RD_Pos (0UL)            /*!< DEM RF_FSSS_MAG_RESULT_REG: FSSS_MAG_RD (Bit 0)       */
#define DEM_RF_FSSS_MAG_RESULT_REG_FSSS_MAG_RD_Msk (0xffffUL)       /*!< DEM RF_FSSS_MAG_RESULT_REG: FSSS_MAG_RD (Bitfield-Mask: 0xffff) */
/* =================================================  RF_FSSS_Q_RESULT_REG  ================================================== */
#define DEM_RF_FSSS_Q_RESULT_REG_FSSS_Q_RD_Pos (0UL)                /*!< DEM RF_FSSS_Q_RESULT_REG: FSSS_Q_RD (Bit 0)           */
#define DEM_RF_FSSS_Q_RESULT_REG_FSSS_Q_RD_Msk (0xffffUL)           /*!< DEM RF_FSSS_Q_RESULT_REG: FSSS_Q_RD (Bitfield-Mask: 0xffff) */
/* =================================================  RF_FTDF_COBI_HIGH_REG  ================================================= */
#define DEM_RF_FTDF_COBI_HIGH_REG_COBI_Pos (0UL)                    /*!< DEM RF_FTDF_COBI_HIGH_REG: COBI (Bit 0)               */
#define DEM_RF_FTDF_COBI_HIGH_REG_COBI_Msk (0xffffUL)               /*!< DEM RF_FTDF_COBI_HIGH_REG: COBI (Bitfield-Mask: 0xffff) */
/* =================================================  RF_FTDF_COBI_LOW_REG  ================================================== */
#define DEM_RF_FTDF_COBI_LOW_REG_COBI_Pos (0UL)                     /*!< DEM RF_FTDF_COBI_LOW_REG: COBI (Bit 0)                */
#define DEM_RF_FTDF_COBI_LOW_REG_COBI_Msk (0xffffUL)                /*!< DEM RF_FTDF_COBI_LOW_REG: COBI (Bitfield-Mask: 0xffff) */
/* ===================================================  RF_FTDF_CTRL1_REG  =================================================== */
#define DEM_RF_FTDF_CTRL1_REG_CHSEL_FILT_MODE2_Pos (14UL)           /*!< DEM RF_FTDF_CTRL1_REG: CHSEL_FILT_MODE2 (Bit 14)      */
#define DEM_RF_FTDF_CTRL1_REG_CHSEL_FILT_MODE2_Msk (0xc000UL)       /*!< DEM RF_FTDF_CTRL1_REG: CHSEL_FILT_MODE2 (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_CTRL1_REG_CFE_NSTEP_Pos (12UL)                  /*!< DEM RF_FTDF_CTRL1_REG: CFE_NSTEP (Bit 12)             */
#define DEM_RF_FTDF_CTRL1_REG_CFE_NSTEP_Msk (0x3000UL)              /*!< DEM RF_FTDF_CTRL1_REG: CFE_NSTEP (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_CTRL1_REG_CFE_MODE_Pos (10UL)                   /*!< DEM RF_FTDF_CTRL1_REG: CFE_MODE (Bit 10)              */
#define DEM_RF_FTDF_CTRL1_REG_CFE_MODE_Msk (0xc00UL)                /*!< DEM RF_FTDF_CTRL1_REG: CFE_MODE (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_CTRL1_REG_CFE_BIAS_Pos (0UL)                    /*!< DEM RF_FTDF_CTRL1_REG: CFE_BIAS (Bit 0)               */
#define DEM_RF_FTDF_CTRL1_REG_CFE_BIAS_Msk (0x3ffUL)                /*!< DEM RF_FTDF_CTRL1_REG: CFE_BIAS (Bitfield-Mask: 0x3ff) */
/* ===================================================  RF_FTDF_CTRL2_REG  =================================================== */
#define DEM_RF_FTDF_CTRL2_REG_PD_OFFSET_Pos (14UL)                  /*!< DEM RF_FTDF_CTRL2_REG: PD_OFFSET (Bit 14)             */
#define DEM_RF_FTDF_CTRL2_REG_PD_OFFSET_Msk (0xc000UL)              /*!< DEM RF_FTDF_CTRL2_REG: PD_OFFSET (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_CTRL2_REG_PD_NWIN_Pos (11UL)                    /*!< DEM RF_FTDF_CTRL2_REG: PD_NWIN (Bit 11)               */
#define DEM_RF_FTDF_CTRL2_REG_PD_NWIN_Msk (0x3800UL)                /*!< DEM RF_FTDF_CTRL2_REG: PD_NWIN (Bitfield-Mask: 0x07)  */
