S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define DEM_RF_FTDF_CTRL2_REG_PD_NPEAK_Pos (8UL)                    /*!< DEM RF_FTDF_CTRL2_REG: PD_NPEAK (Bit 8)               */
#define DEM_RF_FTDF_CTRL2_REG_PD_NPEAK_Msk (0x700UL)                /*!< DEM RF_FTDF_CTRL2_REG: PD_NPEAK (Bitfield-Mask: 0x07) */
#define DEM_RF_FTDF_CTRL2_REG_PD_MODE_Pos (7UL)                     /*!< DEM RF_FTDF_CTRL2_REG: PD_MODE (Bit 7)                */
#define DEM_RF_FTDF_CTRL2_REG_PD_MODE_Msk (0x80UL)                  /*!< DEM RF_FTDF_CTRL2_REG: PD_MODE (Bitfield-Mask: 0x01)  */
#define DEM_RF_FTDF_CTRL2_REG_NORM_EN_Pos (6UL)                     /*!< DEM RF_FTDF_CTRL2_REG: NORM_EN (Bit 6)                */
#define DEM_RF_FTDF_CTRL2_REG_NORM_EN_Msk (0x40UL)                  /*!< DEM RF_FTDF_CTRL2_REG: NORM_EN (Bitfield-Mask: 0x01)  */
#define DEM_RF_FTDF_CTRL2_REG_CORRTH_Pos  (0UL)                     /*!< DEM RF_FTDF_CTRL2_REG: CORRTH (Bit 0)                 */
#define DEM_RF_FTDF_CTRL2_REG_CORRTH_Msk  (0x3fUL)                  /*!< DEM RF_FTDF_CTRL2_REG: CORRTH (Bitfield-Mask: 0x3f)   */
/* ===================================================  RF_FTDF_CTRL3_REG  =================================================== */
#define DEM_RF_FTDF_CTRL3_REG_DS_OFFSET_Pos (14UL)                  /*!< DEM RF_FTDF_CTRL3_REG: DS_OFFSET (Bit 14)             */
#define DEM_RF_FTDF_CTRL3_REG_DS_OFFSET_Msk (0xc000UL)              /*!< DEM RF_FTDF_CTRL3_REG: DS_OFFSET (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_CTRL3_REG_CHSEL_FILT_MODE1_Pos (12UL)           /*!< DEM RF_FTDF_CTRL3_REG: CHSEL_FILT_MODE1 (Bit 12)      */
#define DEM_RF_FTDF_CTRL3_REG_CHSEL_FILT_MODE1_Msk (0x3000UL)       /*!< DEM RF_FTDF_CTRL3_REG: CHSEL_FILT_MODE1 (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_CTRL3_REG_TIMING_CORR_EN_Pos (11UL)             /*!< DEM RF_FTDF_CTRL3_REG: TIMING_CORR_EN (Bit 11)        */
#define DEM_RF_FTDF_CTRL3_REG_TIMING_CORR_EN_Msk (0x800UL)          /*!< DEM RF_FTDF_CTRL3_REG: TIMING_CORR_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL3_REG_MATCH_FILT_EN_Pos (10UL)              /*!< DEM RF_FTDF_CTRL3_REG: MATCH_FILT_EN (Bit 10)         */
#define DEM_RF_FTDF_CTRL3_REG_MATCH_FILT_EN_Msk (0x400UL)           /*!< DEM RF_FTDF_CTRL3_REG: MATCH_FILT_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL3_REG_FTDF_DDC_EN_Pos (9UL)                 /*!< DEM RF_FTDF_CTRL3_REG: FTDF_DDC_EN (Bit 9)            */
#define DEM_RF_FTDF_CTRL3_REG_FTDF_DDC_EN_Msk (0x200UL)             /*!< DEM RF_FTDF_CTRL3_REG: FTDF_DDC_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL3_REG_FIF_Pos     (0UL)                     /*!< DEM RF_FTDF_CTRL3_REG: FIF (Bit 0)                    */
#define DEM_RF_FTDF_CTRL3_REG_FIF_Msk     (0x1ffUL)                 /*!< DEM RF_FTDF_CTRL3_REG: FIF (Bitfield-Mask: 0x1ff)     */
/* ===================================================  RF_FTDF_CTRL4_REG  =================================================== */
#define DEM_RF_FTDF_CTRL4_REG_SO_FTDF_SEL_Pos (15UL)                /*!< DEM RF_FTDF_CTRL4_REG: SO_FTDF_SEL (Bit 15)           */
#define DEM_RF_FTDF_CTRL4_REG_SO_FTDF_SEL_Msk (0x8000UL)            /*!< DEM RF_FTDF_CTRL4_REG: SO_FTDF_SEL (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL4_REG_CCA_MODE_Pos (14UL)                   /*!< DEM RF_FTDF_CTRL4_REG: CCA_MODE (Bit 14)              */
#define DEM_RF_FTDF_CTRL4_REG_CCA_MODE_Msk (0x4000UL)               /*!< DEM RF_FTDF_CTRL4_REG: CCA_MODE (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL4_REG_FTDF_HSI_POL_Pos (13UL)               /*!< DEM RF_FTDF_CTRL4_REG: FTDF_HSI_POL (Bit 13)          */
#define DEM_RF_FTDF_CTRL4_REG_FTDF_HSI_POL_Msk (0x2000UL)           /*!< DEM RF_FTDF_CTRL4_REG: FTDF_HSI_POL (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL4_REG_LQI_SCALE_Pos (11UL)                  /*!< DEM RF_FTDF_CTRL4_REG: LQI_SCALE (Bit 11)             */
#define DEM_RF_FTDF_CTRL4_REG_LQI_SCALE_Msk (0x1800UL)              /*!< DEM RF_FTDF_CTRL4_REG: LQI_SCALE (Bitfield-Mask: 0x03) */
#define DEM_RF_FTDF_CTRL4_REG_LQI_CORRTH_EN_Pos (10UL)              /*!< DEM RF_FTDF_CTRL4_REG: LQI_CORRTH_EN (Bit 10)         */
#define DEM_RF_FTDF_CTRL4_REG_LQI_CORRTH_EN_Msk (0x400UL)           /*!< DEM RF_FTDF_CTRL4_REG: LQI_CORRTH_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL4_REG_LQI_SYMBOL_EN_Pos (9UL)               /*!< DEM RF_FTDF_CTRL4_REG: LQI_SYMBOL_EN (Bit 9)          */
#define DEM_RF_FTDF_CTRL4_REG_LQI_SYMBOL_EN_Msk (0x200UL)           /*!< DEM RF_FTDF_CTRL4_REG: LQI_SYMBOL_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL4_REG_LQI_PREAMBLE_EN_Pos (8UL)             /*!< DEM RF_FTDF_CTRL4_REG: LQI_PREAMBLE_EN (Bit 8)        */
#define DEM_RF_FTDF_CTRL4_REG_LQI_PREAMBLE_EN_Msk (0x100UL)         /*!< DEM RF_FTDF_CTRL4_REG: LQI_PREAMBLE_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL4_REG_SFD1_Pos    (4UL)                     /*!< DEM RF_FTDF_CTRL4_REG: SFD1 (Bit 4)                   */
#define DEM_RF_FTDF_CTRL4_REG_SFD1_Msk    (0xf0UL)                  /*!< DEM RF_FTDF_CTRL4_REG: SFD1 (Bitfield-Mask: 0x0f)     */
#define DEM_RF_FTDF_CTRL4_REG_SFD0_Pos    (0UL)                     /*!< DEM RF_FTDF_CTRL4_REG: SFD0 (Bit 0)                   */
#define DEM_RF_FTDF_CTRL4_REG_SFD0_Msk    (0xfUL)                   /*!< DEM RF_FTDF_CTRL4_REG: SFD0 (Bitfield-Mask: 0x0f)     */
/* ===================================================  RF_FTDF_CTRL5_REG  =================================================== */
#define DEM_RF_FTDF_CTRL5_REG_DS_OFFSET_SEL_Pos (15UL)              /*!< DEM RF_FTDF_CTRL5_REG: DS_OFFSET_SEL (Bit 15)         */
#define DEM_RF_FTDF_CTRL5_REG_DS_OFFSET_SEL_Msk (0x8000UL)          /*!< DEM RF_FTDF_CTRL5_REG: DS_OFFSET_SEL (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL5_REG_FSSS_CLEAR_Pos (14UL)                 /*!< DEM RF_FTDF_CTRL5_REG: FSSS_CLEAR (Bit 14)            */
#define DEM_RF_FTDF_CTRL5_REG_FSSS_CLEAR_Msk (0x4000UL)             /*!< DEM RF_FTDF_CTRL5_REG: FSSS_CLEAR (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL5_REG_FTDF_DDC_INV_Pos (13UL)               /*!< DEM RF_FTDF_CTRL5_REG: FTDF_DDC_INV (Bit 13)          */
#define DEM_RF_FTDF_CTRL5_REG_FTDF_DDC_INV_Msk (0x2000UL)           /*!< DEM RF_FTDF_CTRL5_REG: FTDF_DDC_INV (Bitfield-Mask: 0x01) */
#define DEM_RF_FTDF_CTRL5_REG_RSSITH_Pos  (0UL)                     /*!< DEM RF_FTDF_CTRL5_REG: RSSITH (Bit 0)                 */
#define DEM_RF_FTDF_CTRL5_REG_RSSITH_Msk  (0x1fffUL)                /*!< DEM RF_FTDF_CTRL5_REG: RSSITH (Bitfield-Mask: 0x1fff) */
/* ===============================================  RF_FTDF_LOOP_GAIN_DS_REG  ================================================ */
#define DEM_RF_FTDF_LOOP_GAIN_DS_REG_KI_LF_DS_Pos (8UL)             /*!< DEM RF_FTDF_LOOP_GAIN_DS_REG: KI_LF_DS (Bit 8)        */
#define DEM_RF_FTDF_LOOP_GAIN_DS_REG_KI_LF_DS_Msk (0xff00UL)        /*!< DEM RF_FTDF_LOOP_GAIN_DS_REG: KI_LF_DS (Bitfield-Mask: 0xff) */
#define DEM_RF_FTDF_LOOP_GAIN_DS_REG_KP_LF_DS_Pos (0UL)             /*!< DEM RF_FTDF_LOOP_GAIN_DS_REG: KP_LF_DS (Bit 0)        */
#define DEM_RF_FTDF_LOOP_GAIN_DS_REG_KP_LF_DS_Msk (0xffUL)          /*!< DEM RF_FTDF_LOOP_GAIN_DS_REG: KP_LF_DS (Bitfield-Mask: 0xff) */
/* ===============================================  RF_FTDF_LOOP_GAIN_PD_REG  ================================================ */
#define DEM_RF_FTDF_LOOP_GAIN_PD_REG_KI_LF_PD_Pos (8UL)             /*!< DEM RF_FTDF_LOOP_GAIN_PD_REG: KI_LF_PD (Bit 8)        */
#define DEM_RF_FTDF_LOOP_GAIN_PD_REG_KI_LF_PD_Msk (0xff00UL)        /*!< DEM RF_FTDF_LOOP_GAIN_PD_REG: KI_LF_PD (Bitfield-Mask: 0xff) */
#define DEM_RF_FTDF_LOOP_GAIN_PD_REG_KP_LF_PD_Pos (0UL)             /*!< DEM RF_FTDF_LOOP_GAIN_PD_REG: KP_LF_PD (Bit 0)        */
#define DEM_RF_FTDF_LOOP_GAIN_PD_REG_KP_LF_PD_Msk (0xffUL)          /*!< DEM RF_FTDF_LOOP_GAIN_PD_REG: KP_LF_PD (Bitfield-Mask: 0xff) */
/* ==================================================  RF_PAD_CNT_CTRL_REG  ================================================== */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_CLEAR_COUNT_Pos (14UL)          /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_CLEAR_COUNT (Bit 14)     */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_CLEAR_COUNT_Msk (0x4000UL)      /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_CLEAR_COUNT (Bitfield-Mask: 0x01) */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_NEG_LIMIT_Pos (7UL)             /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_NEG_LIMIT (Bit 7)        */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_NEG_LIMIT_Msk (0x3f80UL)        /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_NEG_LIMIT (Bitfield-Mask: 0x7f) */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_POS_LIMIT_Pos (0UL)             /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_POS_LIMIT (Bit 0)        */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_POS_LIMIT_Msk (0x7fUL)          /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_POS_LIMIT (Bitfield-Mask: 0x7f) */
/* =================================================  RF_PAD_CNT_RESULT_REG  ================================================= */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_NEG_CNT_RD_Pos (8UL)          /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_NEG_CNT_RD (Bit 8)     */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_NEG_CNT_RD_Msk (0xff00UL)     /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_NEG_CNT_RD (Bitfield-Mask: 0xff) */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_POS_CNT_RD_Pos (0UL)          /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_POS_CNT_RD (Bit 0)     */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_POS_CNT_RD_Msk (0xffUL)       /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_POS_CNT_RD (Bitfield-Mask: 0xff) */
/* =================================================  RF_RSSI_COMP_CTRL_REG  ================================================= */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP00_Pos (12UL)            /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP00 (Bit 12)       */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP00_Msk (0xf000UL)        /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP00 (Bitfield-Mask: 0x0f) */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP11_Pos (8UL)             /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP11 (Bit 8)        */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP11_Msk (0xf00UL)         /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP11 (Bitfield-Mask: 0x0f) */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP10_Pos (4UL)             /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP10 (Bit 4)        */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP10_Msk (0xf0UL)          /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP10 (Bitfield-Mask: 0x0f) */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP01_Pos (0UL)             /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP01 (Bit 0)        */
#define DEM_RF_RSSI_COMP_CTRL_REG_RSSI_COMP01_Msk (0xfUL)           /*!< DEM RF_RSSI_COMP_CTRL_REG: RSSI_COMP01 (Bitfield-Mask: 0x0f) */
/* ==================================================  RF_RSSI_RESULT_REG  =================================================== */
#define DEM_RF_RSSI_RESULT_REG_RSSI_AVG_RD_Pos (6UL)                /*!< DEM RF_RSSI_RESULT_REG: RSSI_AVG_RD (Bit 6)           */
#define DEM_RF_RSSI_RESULT_REG_RSSI_AVG_RD_Msk (0xffc0UL)           /*!< DEM RF_RSSI_RESULT_REG: RSSI_AVG_RD (Bitfield-Mask: 0x3ff) */
#define DEM_RF_RSSI_RESULT_REG_RSSI_PH_RD_Pos (0UL)                 /*!< DEM RF_RSSI_RESULT_REG: RSSI_PH_RD (Bit 0)            */
#define DEM_RF_RSSI_RESULT_REG_RSSI_PH_RD_Msk (0x3fUL)              /*!< DEM RF_RSSI_RESULT_REG: RSSI_PH_RD (Bitfield-Mask: 0x3f) */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

