S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define DMA_DMA4_CTRL_REG_DMA_IDLE_Pos    (11UL)                    /*!< DMA DMA4_CTRL_REG: DMA_IDLE (Bit 11)                  */
#define DMA_DMA4_CTRL_REG_DMA_IDLE_Msk    (0x800UL)                 /*!< DMA DMA4_CTRL_REG: DMA_IDLE (Bitfield-Mask: 0x01)     */
#define DMA_DMA4_CTRL_REG_DMA_PRIO_Pos    (8UL)                     /*!< DMA DMA4_CTRL_REG: DMA_PRIO (Bit 8)                   */
#define DMA_DMA4_CTRL_REG_DMA_PRIO_Msk    (0x700UL)                 /*!< DMA DMA4_CTRL_REG: DMA_PRIO (Bitfield-Mask: 0x07)     */
#define DMA_DMA4_CTRL_REG_CIRCULAR_Pos    (7UL)                     /*!< DMA DMA4_CTRL_REG: CIRCULAR (Bit 7)                   */
#define DMA_DMA4_CTRL_REG_CIRCULAR_Msk    (0x80UL)                  /*!< DMA DMA4_CTRL_REG: CIRCULAR (Bitfield-Mask: 0x01)     */
#define DMA_DMA4_CTRL_REG_AINC_Pos        (6UL)                     /*!< DMA DMA4_CTRL_REG: AINC (Bit 6)                       */
#define DMA_DMA4_CTRL_REG_AINC_Msk        (0x40UL)                  /*!< DMA DMA4_CTRL_REG: AINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA4_CTRL_REG_BINC_Pos        (5UL)                     /*!< DMA DMA4_CTRL_REG: BINC (Bit 5)                       */
#define DMA_DMA4_CTRL_REG_BINC_Msk        (0x20UL)                  /*!< DMA DMA4_CTRL_REG: BINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA4_CTRL_REG_DREQ_MODE_Pos   (4UL)                     /*!< DMA DMA4_CTRL_REG: DREQ_MODE (Bit 4)                  */
#define DMA_DMA4_CTRL_REG_DREQ_MODE_Msk   (0x10UL)                  /*!< DMA DMA4_CTRL_REG: DREQ_MODE (Bitfield-Mask: 0x01)    */
#define DMA_DMA4_CTRL_REG_IRQ_ENABLE_Pos  (3UL)                     /*!< DMA DMA4_CTRL_REG: IRQ_ENABLE (Bit 3)                 */
#define DMA_DMA4_CTRL_REG_IRQ_ENABLE_Msk  (0x8UL)                   /*!< DMA DMA4_CTRL_REG: IRQ_ENABLE (Bitfield-Mask: 0x01)   */
#define DMA_DMA4_CTRL_REG_BW_Pos          (1UL)                     /*!< DMA DMA4_CTRL_REG: BW (Bit 1)                         */
#define DMA_DMA4_CTRL_REG_BW_Msk          (0x6UL)                   /*!< DMA DMA4_CTRL_REG: BW (Bitfield-Mask: 0x03)           */
#define DMA_DMA4_CTRL_REG_DMA_ON_Pos      (0UL)                     /*!< DMA DMA4_CTRL_REG: DMA_ON (Bit 0)                     */
#define DMA_DMA4_CTRL_REG_DMA_ON_Msk      (0x1UL)                   /*!< DMA DMA4_CTRL_REG: DMA_ON (Bitfield-Mask: 0x01)       */
/* =====================================================  DMA4_IDX_REG  ====================================================== */
#define DMA_DMA4_IDX_REG_DMA4_IDX_Pos     (0UL)                     /*!< DMA DMA4_IDX_REG: DMA4_IDX (Bit 0)                    */
#define DMA_DMA4_IDX_REG_DMA4_IDX_Msk     (0xffffUL)                /*!< DMA DMA4_IDX_REG: DMA4_IDX (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA4_INT_REG  ====================================================== */
#define DMA_DMA4_INT_REG_DMA4_INT_Pos     (0UL)                     /*!< DMA DMA4_INT_REG: DMA4_INT (Bit 0)                    */
#define DMA_DMA4_INT_REG_DMA4_INT_Msk     (0xffffUL)                /*!< DMA DMA4_INT_REG: DMA4_INT (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA4_LEN_REG  ====================================================== */
#define DMA_DMA4_LEN_REG_DMA4_LEN_Pos     (0UL)                     /*!< DMA DMA4_LEN_REG: DMA4_LEN (Bit 0)                    */
#define DMA_DMA4_LEN_REG_DMA4_LEN_Msk     (0xffffUL)                /*!< DMA DMA4_LEN_REG: DMA4_LEN (Bitfield-Mask: 0xffff)    */
/* ===================================================  DMA5_A_STARTH_REG  =================================================== */
#define DMA_DMA5_A_STARTH_REG_DMA5_A_STARTH_Pos (0UL)               /*!< DMA DMA5_A_STARTH_REG: DMA5_A_STARTH (Bit 0)          */
#define DMA_DMA5_A_STARTH_REG_DMA5_A_STARTH_Msk (0xffffUL)          /*!< DMA DMA5_A_STARTH_REG: DMA5_A_STARTH (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA5_A_STARTL_REG  =================================================== */
#define DMA_DMA5_A_STARTL_REG_DMA5_A_STARTL_Pos (0UL)               /*!< DMA DMA5_A_STARTL_REG: DMA5_A_STARTL (Bit 0)          */
#define DMA_DMA5_A_STARTL_REG_DMA5_A_STARTL_Msk (0xffffUL)          /*!< DMA DMA5_A_STARTL_REG: DMA5_A_STARTL (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA5_B_STARTH_REG  =================================================== */
#define DMA_DMA5_B_STARTH_REG_DMA5_B_STARTH_Pos (0UL)               /*!< DMA DMA5_B_STARTH_REG: DMA5_B_STARTH (Bit 0)          */
#define DMA_DMA5_B_STARTH_REG_DMA5_B_STARTH_Msk (0xffffUL)          /*!< DMA DMA5_B_STARTH_REG: DMA5_B_STARTH (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA5_B_STARTL_REG  =================================================== */
#define DMA_DMA5_B_STARTL_REG_DMA5_B_STARTL_Pos (0UL)               /*!< DMA DMA5_B_STARTL_REG: DMA5_B_STARTL (Bit 0)          */
#define DMA_DMA5_B_STARTL_REG_DMA5_B_STARTL_Msk (0xffffUL)          /*!< DMA DMA5_B_STARTL_REG: DMA5_B_STARTL (Bitfield-Mask: 0xffff) */
/* =====================================================  DMA5_CTRL_REG  ===================================================== */
#define DMA_DMA5_CTRL_REG_DMA_INIT_Pos    (12UL)                    /*!< DMA DMA5_CTRL_REG: DMA_INIT (Bit 12)                  */
#define DMA_DMA5_CTRL_REG_DMA_INIT_Msk    (0x1000UL)                /*!< DMA DMA5_CTRL_REG: DMA_INIT (Bitfield-Mask: 0x01)     */
#define DMA_DMA5_CTRL_REG_DMA_IDLE_Pos    (11UL)                    /*!< DMA DMA5_CTRL_REG: DMA_IDLE (Bit 11)                  */
#define DMA_DMA5_CTRL_REG_DMA_IDLE_Msk    (0x800UL)                 /*!< DMA DMA5_CTRL_REG: DMA_IDLE (Bitfield-Mask: 0x01)     */
#define DMA_DMA5_CTRL_REG_DMA_PRIO_Pos    (8UL)                     /*!< DMA DMA5_CTRL_REG: DMA_PRIO (Bit 8)                   */
#define DMA_DMA5_CTRL_REG_DMA_PRIO_Msk    (0x700UL)                 /*!< DMA DMA5_CTRL_REG: DMA_PRIO (Bitfield-Mask: 0x07)     */
#define DMA_DMA5_CTRL_REG_CIRCULAR_Pos    (7UL)                     /*!< DMA DMA5_CTRL_REG: CIRCULAR (Bit 7)                   */
#define DMA_DMA5_CTRL_REG_CIRCULAR_Msk    (0x80UL)                  /*!< DMA DMA5_CTRL_REG: CIRCULAR (Bitfield-Mask: 0x01)     */
#define DMA_DMA5_CTRL_REG_AINC_Pos        (6UL)                     /*!< DMA DMA5_CTRL_REG: AINC (Bit 6)                       */
#define DMA_DMA5_CTRL_REG_AINC_Msk        (0x40UL)                  /*!< DMA DMA5_CTRL_REG: AINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA5_CTRL_REG_BINC_Pos        (5UL)                     /*!< DMA DMA5_CTRL_REG: BINC (Bit 5)                       */
#define DMA_DMA5_CTRL_REG_BINC_Msk        (0x20UL)                  /*!< DMA DMA5_CTRL_REG: BINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA5_CTRL_REG_DREQ_MODE_Pos   (4UL)                     /*!< DMA DMA5_CTRL_REG: DREQ_MODE (Bit 4)                  */
#define DMA_DMA5_CTRL_REG_DREQ_MODE_Msk   (0x10UL)                  /*!< DMA DMA5_CTRL_REG: DREQ_MODE (Bitfield-Mask: 0x01)    */
#define DMA_DMA5_CTRL_REG_IRQ_ENABLE_Pos  (3UL)                     /*!< DMA DMA5_CTRL_REG: IRQ_ENABLE (Bit 3)                 */
#define DMA_DMA5_CTRL_REG_IRQ_ENABLE_Msk  (0x8UL)                   /*!< DMA DMA5_CTRL_REG: IRQ_ENABLE (Bitfield-Mask: 0x01)   */
#define DMA_DMA5_CTRL_REG_BW_Pos          (1UL)                     /*!< DMA DMA5_CTRL_REG: BW (Bit 1)                         */
#define DMA_DMA5_CTRL_REG_BW_Msk          (0x6UL)                   /*!< DMA DMA5_CTRL_REG: BW (Bitfield-Mask: 0x03)           */
#define DMA_DMA5_CTRL_REG_DMA_ON_Pos      (0UL)                     /*!< DMA DMA5_CTRL_REG: DMA_ON (Bit 0)                     */
#define DMA_DMA5_CTRL_REG_DMA_ON_Msk      (0x1UL)                   /*!< DMA DMA5_CTRL_REG: DMA_ON (Bitfield-Mask: 0x01)       */
/* =====================================================  DMA5_IDX_REG  ====================================================== */
#define DMA_DMA5_IDX_REG_DMA5_IDX_Pos     (0UL)                     /*!< DMA DMA5_IDX_REG: DMA5_IDX (Bit 0)                    */
#define DMA_DMA5_IDX_REG_DMA5_IDX_Msk     (0xffffUL)                /*!< DMA DMA5_IDX_REG: DMA5_IDX (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA5_INT_REG  ====================================================== */
#define DMA_DMA5_INT_REG_DMA5_INT_Pos     (0UL)                     /*!< DMA DMA5_INT_REG: DMA5_INT (Bit 0)                    */
#define DMA_DMA5_INT_REG_DMA5_INT_Msk     (0xffffUL)                /*!< DMA DMA5_INT_REG: DMA5_INT (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA5_LEN_REG  ====================================================== */
#define DMA_DMA5_LEN_REG_DMA5_LEN_Pos     (0UL)                     /*!< DMA DMA5_LEN_REG: DMA5_LEN (Bit 0)                    */
#define DMA_DMA5_LEN_REG_DMA5_LEN_Msk     (0xffffUL)                /*!< DMA DMA5_LEN_REG: DMA5_LEN (Bitfield-Mask: 0xffff)    */
/* ===================================================  DMA6_A_STARTH_REG  =================================================== */
#define DMA_DMA6_A_STARTH_REG_DMA6_A_STARTH_Pos (0UL)               /*!< DMA DMA6_A_STARTH_REG: DMA6_A_STARTH (Bit 0)          */
#define DMA_DMA6_A_STARTH_REG_DMA6_A_STARTH_Msk (0xffffUL)          /*!< DMA DMA6_A_STARTH_REG: DMA6_A_STARTH (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA6_A_STARTL_REG  =================================================== */
#define DMA_DMA6_A_STARTL_REG_DMA6_A_STARTL_Pos (0UL)               /*!< DMA DMA6_A_STARTL_REG: DMA6_A_STARTL (Bit 0)          */
#define DMA_DMA6_A_STARTL_REG_DMA6_A_STARTL_Msk (0xffffUL)          /*!< DMA DMA6_A_STARTL_REG: DMA6_A_STARTL (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA6_B_STARTH_REG  =================================================== */
#define DMA_DMA6_B_STARTH_REG_DMA6_B_STARTH_Pos (0UL)               /*!< DMA DMA6_B_STARTH_REG: DMA6_B_STARTH (Bit 0)          */
#define DMA_DMA6_B_STARTH_REG_DMA6_B_STARTH_Msk (0xffffUL)          /*!< DMA DMA6_B_STARTH_REG: DMA6_B_STARTH (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA6_B_STARTL_REG  =================================================== */
#define DMA_DMA6_B_STARTL_REG_DMA6_B_STARTL_Pos (0UL)               /*!< DMA DMA6_B_STARTL_REG: DMA6_B_STARTL (Bit 0)          */
#define DMA_DMA6_B_STARTL_REG_DMA6_B_STARTL_Msk (0xffffUL)          /*!< DMA DMA6_B_STARTL_REG: DMA6_B_STARTL (Bitfield-Mask: 0xffff) */
/* =====================================================  DMA6_CTRL_REG  ===================================================== */
#define DMA_DMA6_CTRL_REG_DMA_INIT_Pos    (12UL)                    /*!< DMA DMA6_CTRL_REG: DMA_INIT (Bit 12)                  */
#define DMA_DMA6_CTRL_REG_DMA_INIT_Msk    (0x1000UL)                /*!< DMA DMA6_CTRL_REG: DMA_INIT (Bitfield-Mask: 0x01)     */
#define DMA_DMA6_CTRL_REG_DMA_IDLE_Pos    (11UL)                    /*!< DMA DMA6_CTRL_REG: DMA_IDLE (Bit 11)                  */
#define DMA_DMA6_CTRL_REG_DMA_IDLE_Msk    (0x800UL)                 /*!< DMA DMA6_CTRL_REG: DMA_IDLE (Bitfield-Mask: 0x01)     */
#define DMA_DMA6_CTRL_REG_DMA_PRIO_Pos    (8UL)                     /*!< DMA DMA6_CTRL_REG: DMA_PRIO (Bit 8)                   */
#define DMA_DMA6_CTRL_REG_DMA_PRIO_Msk    (0x700UL)                 /*!< DMA DMA6_CTRL_REG: DMA_PRIO (Bitfield-Mask: 0x07)     */
#define DMA_DMA6_CTRL_REG_CIRCULAR_Pos    (7UL)                     /*!< DMA DMA6_CTRL_REG: CIRCULAR (Bit 7)                   */
#define DMA_DMA6_CTRL_REG_CIRCULAR_Msk    (0x80UL)                  /*!< DMA DMA6_CTRL_REG: CIRCULAR (Bitfield-Mask: 0x01)     */
#define DMA_DMA6_CTRL_REG_AINC_Pos        (6UL)                     /*!< DMA DMA6_CTRL_REG: AINC (Bit 6)                       */
#define DMA_DMA6_CTRL_REG_AINC_Msk        (0x40UL)                  /*!< DMA DMA6_CTRL_REG: AINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA6_CTRL_REG_BINC_Pos        (5UL)                     /*!< DMA DMA6_CTRL_REG: BINC (Bit 5)                       */
#define DMA_DMA6_CTRL_REG_BINC_Msk        (0x20UL)                  /*!< DMA DMA6_CTRL_REG: BINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA6_CTRL_REG_DREQ_MODE_Pos   (4UL)                     /*!< DMA DMA6_CTRL_REG: DREQ_MODE (Bit 4)                  */
#define DMA_DMA6_CTRL_REG_DREQ_MODE_Msk   (0x10UL)                  /*!< DMA DMA6_CTRL_REG: DREQ_MODE (Bitfield-Mask: 0x01)    */
#define DMA_DMA6_CTRL_REG_IRQ_ENABLE_Pos  (3UL)                     /*!< DMA DMA6_CTRL_REG: IRQ_ENABLE (Bit 3)                 */
#define DMA_DMA6_CTRL_REG_IRQ_ENABLE_Msk  (0x8UL)                   /*!< DMA DMA6_CTRL_REG: IRQ_ENABLE (Bitfield-Mask: 0x01)   */
#define DMA_DMA6_CTRL_REG_BW_Pos          (1UL)                     /*!< DMA DMA6_CTRL_REG: BW (Bit 1)                         */
#define DMA_DMA6_CTRL_REG_BW_Msk          (0x6UL)                   /*!< DMA DMA6_CTRL_REG: BW (Bitfield-Mask: 0x03)           */
#define DMA_DMA6_CTRL_REG_DMA_ON_Pos      (0UL)                     /*!< DMA DMA6_CTRL_REG: DMA_ON (Bit 0)                     */
#define DMA_DMA6_CTRL_REG_DMA_ON_Msk      (0x1UL)                   /*!< DMA DMA6_CTRL_REG: DMA_ON (Bitfield-Mask: 0x01)       */
/* =====================================================  DMA6_IDX_REG  ====================================================== */
#define DMA_DMA6_IDX_REG_DMA6_IDX_Pos     (0UL)                     /*!< DMA DMA6_IDX_REG: DMA6_IDX (Bit 0)                    */
#define DMA_DMA6_IDX_REG_DMA6_IDX_Msk     (0xffffUL)                /*!< DMA DMA6_IDX_REG: DMA6_IDX (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA6_INT_REG  ====================================================== */
#define DMA_DMA6_INT_REG_DMA6_INT_Pos     (0UL)                     /*!< DMA DMA6_INT_REG: DMA6_INT (Bit 0)                    */
#define DMA_DMA6_INT_REG_DMA6_INT_Msk     (0xffffUL)                /*!< DMA DMA6_INT_REG: DMA6_INT (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA6_LEN_REG  ====================================================== */
#define DMA_DMA6_LEN_REG_DMA6_LEN_Pos     (0UL)                     /*!< DMA DMA6_LEN_REG: DMA6_LEN (Bit 0)                    */
#define DMA_DMA6_LEN_REG_DMA6_LEN_Msk     (0xffffUL)                /*!< DMA DMA6_LEN_REG: DMA6_LEN (Bitfield-Mask: 0xffff)    */
/* ===================================================  DMA7_A_STARTH_REG  =================================================== */
#define DMA_DMA7_A_STARTH_REG_DMA7_A_STARTH_Pos (0UL)               /*!< DMA DMA7_A_STARTH_REG: DMA7_A_STARTH (Bit 0)          */
#define DMA_DMA7_A_STARTH_REG_DMA7_A_STARTH_Msk (0xffffUL)          /*!< DMA DMA7_A_STARTH_REG: DMA7_A_STARTH (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA7_A_STARTL_REG  =================================================== */
#define DMA_DMA7_A_STARTL_REG_DMA7_A_STARTL_Pos (0UL)               /*!< DMA DMA7_A_STARTL_REG: DMA7_A_STARTL (Bit 0)          */
#define DMA_DMA7_A_STARTL_REG_DMA7_A_STARTL_Msk (0xffffUL)          /*!< DMA DMA7_A_STARTL_REG: DMA7_A_STARTL (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA7_B_STARTH_REG  =================================================== */
#define DMA_DMA7_B_STARTH_REG_DMA7_B_STARTH_Pos (0UL)               /*!< DMA DMA7_B_STARTH_REG: DMA7_B_STARTH (Bit 0)          */
#define DMA_DMA7_B_STARTH_REG_DMA7_B_STARTH_Msk (0xffffUL)          /*!< DMA DMA7_B_STARTH_REG: DMA7_B_STARTH (Bitfield-Mask: 0xffff) */
/* ===================================================  DMA7_B_STARTL_REG  =================================================== */
#define DMA_DMA7_B_STARTL_REG_DMA7_B_STARTL_Pos (0UL)               /*!< DMA DMA7_B_STARTL_REG: DMA7_B_STARTL (Bit 0)          */
#define DMA_DMA7_B_STARTL_REG_DMA7_B_STARTL_Msk (0xffffUL)          /*!< DMA DMA7_B_STARTL_REG: DMA7_B_STARTL (Bitfield-Mask: 0xffff) */
/* =====================================================  DMA7_CTRL_REG  ===================================================== */
#define DMA_DMA7_CTRL_REG_DMA_INIT_Pos    (12UL)                    /*!< DMA DMA7_CTRL_REG: DMA_INIT (Bit 12)                  */
#define DMA_DMA7_CTRL_REG_DMA_INIT_Msk    (0x1000UL)                /*!< DMA DMA7_CTRL_REG: DMA_INIT (Bitfield-Mask: 0x01)     */
#define DMA_DMA7_CTRL_REG_DMA_IDLE_Pos    (11UL)                    /*!< DMA DMA7_CTRL_REG: DMA_IDLE (Bit 11)                  */
#define DMA_DMA7_CTRL_REG_DMA_IDLE_Msk    (0x800UL)                 /*!< DMA DMA7_CTRL_REG: DMA_IDLE (Bitfield-Mask: 0x01)     */
#define DMA_DMA7_CTRL_REG_DMA_PRIO_Pos    (8UL)                     /*!< DMA DMA7_CTRL_REG: DMA_PRIO (Bit 8)                   */
#define DMA_DMA7_CTRL_REG_DMA_PRIO_Msk    (0x700UL)                 /*!< DMA DMA7_CTRL_REG: DMA_PRIO (Bitfield-Mask: 0x07)     */
#define DMA_DMA7_CTRL_REG_CIRCULAR_Pos    (7UL)                     /*!< DMA DMA7_CTRL_REG: CIRCULAR (Bit 7)                   */
#define DMA_DMA7_CTRL_REG_CIRCULAR_Msk    (0x80UL)                  /*!< DMA DMA7_CTRL_REG: CIRCULAR (Bitfield-Mask: 0x01)     */
#define DMA_DMA7_CTRL_REG_AINC_Pos        (6UL)                     /*!< DMA DMA7_CTRL_REG: AINC (Bit 6)                       */
#define DMA_DMA7_CTRL_REG_AINC_Msk        (0x40UL)                  /*!< DMA DMA7_CTRL_REG: AINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA7_CTRL_REG_BINC_Pos        (5UL)                     /*!< DMA DMA7_CTRL_REG: BINC (Bit 5)                       */
#define DMA_DMA7_CTRL_REG_BINC_Msk        (0x20UL)                  /*!< DMA DMA7_CTRL_REG: BINC (Bitfield-Mask: 0x01)         */
#define DMA_DMA7_CTRL_REG_DREQ_MODE_Pos   (4UL)                     /*!< DMA DMA7_CTRL_REG: DREQ_MODE (Bit 4)                  */
#define DMA_DMA7_CTRL_REG_DREQ_MODE_Msk   (0x10UL)                  /*!< DMA DMA7_CTRL_REG: DREQ_MODE (Bitfield-Mask: 0x01)    */
#define DMA_DMA7_CTRL_REG_IRQ_ENABLE_Pos  (3UL)                     /*!< DMA DMA7_CTRL_REG: IRQ_ENABLE (Bit 3)                 */
#define DMA_DMA7_CTRL_REG_IRQ_ENABLE_Msk  (0x8UL)                   /*!< DMA DMA7_CTRL_REG: IRQ_ENABLE (Bitfield-Mask: 0x01)   */
#define DMA_DMA7_CTRL_REG_BW_Pos          (1UL)                     /*!< DMA DMA7_CTRL_REG: BW (Bit 1)                         */
#define DMA_DMA7_CTRL_REG_BW_Msk          (0x6UL)                   /*!< DMA DMA7_CTRL_REG: BW (Bitfield-Mask: 0x03)           */
#define DMA_DMA7_CTRL_REG_DMA_ON_Pos      (0UL)                     /*!< DMA DMA7_CTRL_REG: DMA_ON (Bit 0)                     */
#define DMA_DMA7_CTRL_REG_DMA_ON_Msk      (0x1UL)                   /*!< DMA DMA7_CTRL_REG: DMA_ON (Bitfield-Mask: 0x01)       */
/* =====================================================  DMA7_IDX_REG  ====================================================== */
#define DMA_DMA7_IDX_REG_DMA7_IDX_Pos     (0UL)                     /*!< DMA DMA7_IDX_REG: DMA7_IDX (Bit 0)                    */
#define DMA_DMA7_IDX_REG_DMA7_IDX_Msk     (0xffffUL)                /*!< DMA DMA7_IDX_REG: DMA7_IDX (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA7_INT_REG  ====================================================== */
#define DMA_DMA7_INT_REG_DMA7_INT_Pos     (0UL)                     /*!< DMA DMA7_INT_REG: DMA7_INT (Bit 0)                    */
#define DMA_DMA7_INT_REG_DMA7_INT_Msk     (0xffffUL)                /*!< DMA DMA7_INT_REG: DMA7_INT (Bitfield-Mask: 0xffff)    */
/* =====================================================  DMA7_LEN_REG  ====================================================== */
#define DMA_DMA7_LEN_REG_DMA7_LEN_Pos     (0UL)                     /*!< DMA DMA7_LEN_REG: DMA7_LEN (Bit 0)                    */
#define DMA_DMA7_LEN_REG_DMA7_LEN_Msk     (0xffffUL)                /*!< DMA DMA7_LEN_REG: DMA7_LEN (Bitfield-Mask: 0xffff)    */
/* ===================================================  DMA_CLEAR_INT_REG  =================================================== */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH7_Pos (7UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH7 (Bit 7)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH7_Msk (0x80UL)          /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH7 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH6_Pos (6UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH6 (Bit 6)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH6_Msk (0x40UL)          /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH6 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH5_Pos (5UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH5 (Bit 5)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH5_Msk (0x20UL)          /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH5 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH4_Pos (4UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH4 (Bit 4)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH4_Msk (0x10UL)          /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH4 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH3_Pos (3UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH3 (Bit 3)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH3_Msk (0x8UL)           /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH3 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH2_Pos (2UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH2 (Bit 2)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH2_Msk (0x4UL)           /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH2 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH1_Pos (1UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH1 (Bit 1)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH1_Msk (0x2UL)           /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH1 (Bitfield-Mask: 0x01) */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH0_Pos (0UL)             /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH0 (Bit 0)        */
#define DMA_DMA_CLEAR_INT_REG_DMA_RST_IRQ_CH0_Msk (0x1UL)           /*!< DMA DMA_CLEAR_INT_REG: DMA_RST_IRQ_CH0 (Bitfield-Mask: 0x01) */
/* ==================================================  DMA_INT_STATUS_REG  =================================================== */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH7_Pos (7UL)                /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH7 (Bit 7)           */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH7_Msk (0x80UL)             /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH7 (Bitfield-Mask: 0x01) */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH6_Pos (6UL)                /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH6 (Bit 6)           */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH6_Msk (0x40UL)             /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH6 (Bitfield-Mask: 0x01) */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH5_Pos (5UL)                /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH5 (Bit 5)           */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH5_Msk (0x20UL)             /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH5 (Bitfield-Mask: 0x01) */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH4_Pos (4UL)                /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH4 (Bit 4)           */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH4_Msk (0x10UL)             /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH4 (Bitfield-Mask: 0x01) */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH3_Pos (3UL)                /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH3 (Bit 3)           */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH3_Msk (0x8UL)              /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH3 (Bitfield-Mask: 0x01) */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH2_Pos (2UL)                /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH2 (Bit 2)           */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH2_Msk (0x4UL)              /*!< DMA DMA_INT_STATUS_REG: DMA_IRQ_CH2 (Bitfield-Mask: 0x01) */
