S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define FTDF_FTDF_RX_CONTROL_0_REG_MACPASSWAKEUP_Msk (0x2000000UL)  /*!< FTDF FTDF_RX_CONTROL_0_REG: MACPASSWAKEUP (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSWAKEUP_Pos (24UL)   /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSWAKEUP (Bit 24) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSWAKEUP_Msk (0x1000000UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSWAKEUP (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSFRMTYPE_Pos (16UL)  /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSFRMTYPE (Bit 16) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSFRMTYPE_Msk (0xff0000UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSFRMTYPE (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSTOPANCOORDINATOR_Pos (15UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSTOPANCOORDINATOR (Bit 15) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSTOPANCOORDINATOR_Msk (0x8000UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSTOPANCOORDINATOR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSBEACONWRONGPANID_Pos (14UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSBEACONWRONGPANID (Bit 14) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSBEACONWRONGPANID_Msk (0x4000UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSBEACONWRONGPANID (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSWRONGDADDR_Pos (13UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSWRONGDADDR (Bit 13) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSWRONGDADDR_Msk (0x2000UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSWRONGDADDR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSWRONGDPANID_Pos (12UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSWRONGDPANID (Bit 12) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSWRONGDPANID_Msk (0x1000UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSWRONGDPANID (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSRESFRAMEVERSION_Pos (11UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSRESFRAMEVERSION (Bit 11) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSRESFRAMEVERSION_Msk (0x800UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSRESFRAMEVERSION (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DISDATAREQUESTCA_Pos (10UL)      /*!< FTDF FTDF_RX_CONTROL_0_REG: DISDATAREQUESTCA (Bit 10) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DISDATAREQUESTCA_Msk (0x400UL)   /*!< FTDF FTDF_RX_CONTROL_0_REG: DISDATAREQUESTCA (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSCRCERROR_Pos (9UL)  /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSCRCERROR (Bit 9) */
#define FTDF_FTDF_RX_CONTROL_0_REG_MACALWAYSPASSCRCERROR_Msk (0x200UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: MACALWAYSPASSCRCERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DISRXACKREQUESTCA_Pos (8UL)      /*!< FTDF FTDF_RX_CONTROL_0_REG: DISRXACKREQUESTCA (Bit 8) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DISRXACKREQUESTCA_Msk (0x100UL)  /*!< FTDF FTDF_RX_CONTROL_0_REG: DISRXACKREQUESTCA (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DISRXFRMPENDINGCA_Pos (7UL)      /*!< FTDF FTDF_RX_CONTROL_0_REG: DISRXFRMPENDINGCA (Bit 7) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DISRXFRMPENDINGCA_Msk (0x80UL)   /*!< FTDF FTDF_RX_CONTROL_0_REG: DISRXFRMPENDINGCA (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_RX_READ_BUF_PTR_Pos (3UL)        /*!< FTDF FTDF_RX_CONTROL_0_REG: RX_READ_BUF_PTR (Bit 3)   */
#define FTDF_FTDF_RX_CONTROL_0_REG_RX_READ_BUF_PTR_Msk (0x78UL)     /*!< FTDF FTDF_RX_CONTROL_0_REG: RX_READ_BUF_PTR (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_RX_CONTROL_0_REG_RXCOORDREALIGNONLY_Pos (2UL)     /*!< FTDF FTDF_RX_CONTROL_0_REG: RXCOORDREALIGNONLY (Bit 2) */
#define FTDF_FTDF_RX_CONTROL_0_REG_RXCOORDREALIGNONLY_Msk (0x4UL)   /*!< FTDF FTDF_RX_CONTROL_0_REG: RXCOORDREALIGNONLY (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_RXBEACONONLY_Pos (1UL)           /*!< FTDF FTDF_RX_CONTROL_0_REG: RXBEACONONLY (Bit 1)      */
#define FTDF_FTDF_RX_CONTROL_0_REG_RXBEACONONLY_Msk (0x2UL)         /*!< FTDF FTDF_RX_CONTROL_0_REG: RXBEACONONLY (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DBGRXTRANSPARENTMODE_Pos (0UL)   /*!< FTDF FTDF_RX_CONTROL_0_REG: DBGRXTRANSPARENTMODE (Bit 0) */
#define FTDF_FTDF_RX_CONTROL_0_REG_DBGRXTRANSPARENTMODE_Msk (0x1UL) /*!< FTDF FTDF_RX_CONTROL_0_REG: DBGRXTRANSPARENTMODE (Bitfield-Mask: 0x01) */
/* ===================================================  FTDF_RX_EVENT_REG  =================================================== */
#define FTDF_FTDF_RX_EVENT_REG_RXBYTE_E_Pos (3UL)                   /*!< FTDF FTDF_RX_EVENT_REG: RXBYTE_E (Bit 3)              */
#define FTDF_FTDF_RX_EVENT_REG_RXBYTE_E_Msk (0x8UL)                 /*!< FTDF FTDF_RX_EVENT_REG: RXBYTE_E (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_EVENT_REG_RX_BUF_AVAIL_E_Pos (2UL)             /*!< FTDF FTDF_RX_EVENT_REG: RX_BUF_AVAIL_E (Bit 2)        */
#define FTDF_FTDF_RX_EVENT_REG_RX_BUF_AVAIL_E_Msk (0x4UL)           /*!< FTDF FTDF_RX_EVENT_REG: RX_BUF_AVAIL_E (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_EVENT_REG_RX_OVERFLOW_E_Pos (1UL)              /*!< FTDF FTDF_RX_EVENT_REG: RX_OVERFLOW_E (Bit 1)         */
#define FTDF_FTDF_RX_EVENT_REG_RX_OVERFLOW_E_Msk (0x2UL)            /*!< FTDF FTDF_RX_EVENT_REG: RX_OVERFLOW_E (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_EVENT_REG_RXSOF_E_Pos (0UL)                    /*!< FTDF FTDF_RX_EVENT_REG: RXSOF_E (Bit 0)               */
#define FTDF_FTDF_RX_EVENT_REG_RXSOF_E_Msk (0x1UL)                  /*!< FTDF FTDF_RX_EVENT_REG: RXSOF_E (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_FIFO_0_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_0_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_0_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_0_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_0_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_FIFO_1_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_1_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_1_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_1_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_1_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_FIFO_2_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_2_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_2_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_2_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_2_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_FIFO_3_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_3_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_3_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_3_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_3_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_FIFO_4_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_4_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_4_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_4_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_4_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_FIFO_5_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_5_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_5_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_5_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_5_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_FIFO_6_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_6_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_6_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_6_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_6_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_FIFO_7_0_REG  ================================================== */
#define FTDF_FTDF_RX_FIFO_7_0_REG_RX_FIFO_Pos (0UL)                 /*!< FTDF FTDF_RX_FIFO_7_0_REG: RX_FIFO (Bit 0)            */
#define FTDF_FTDF_RX_FIFO_7_0_REG_RX_FIFO_Msk (0xffffffffUL)        /*!< FTDF FTDF_RX_FIFO_7_0_REG: RX_FIFO (Bitfield-Mask: 0xffffffff) */
/* ===================================================  FTDF_RX_MASK_REG  ==================================================== */
#define FTDF_FTDF_RX_MASK_REG_RXBYTE_M_Pos (3UL)                    /*!< FTDF FTDF_RX_MASK_REG: RXBYTE_M (Bit 3)               */
#define FTDF_FTDF_RX_MASK_REG_RXBYTE_M_Msk (0x8UL)                  /*!< FTDF FTDF_RX_MASK_REG: RXBYTE_M (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_MASK_REG_RX_BUF_AVAIL_M_Pos (2UL)              /*!< FTDF FTDF_RX_MASK_REG: RX_BUF_AVAIL_M (Bit 2)         */
#define FTDF_FTDF_RX_MASK_REG_RX_BUF_AVAIL_M_Msk (0x4UL)            /*!< FTDF FTDF_RX_MASK_REG: RX_BUF_AVAIL_M (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_MASK_REG_RX_OVERFLOW_M_Pos (1UL)               /*!< FTDF FTDF_RX_MASK_REG: RX_OVERFLOW_M (Bit 1)          */
#define FTDF_FTDF_RX_MASK_REG_RX_OVERFLOW_M_Msk (0x2UL)             /*!< FTDF FTDF_RX_MASK_REG: RX_OVERFLOW_M (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_MASK_REG_RXSOF_M_Pos (0UL)                     /*!< FTDF FTDF_RX_MASK_REG: RXSOF_M (Bit 0)                */
#define FTDF_FTDF_RX_MASK_REG_RXSOF_M_Msk (0x1UL)                   /*!< FTDF FTDF_RX_MASK_REG: RXSOF_M (Bitfield-Mask: 0x01)  */
/* =================================================  FTDF_RX_META_0_0_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_0_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_0_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_0_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_0_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_0_1_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_1_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_1_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_1_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_1_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_0_2_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_2_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_2_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_2_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_2_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_0_3_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_3_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_3_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_3_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_3_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_0_4_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_4_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_4_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_4_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_4_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_0_5_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_5_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_5_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_5_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_5_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_0_6_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_6_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_6_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_6_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_6_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_0_7_REG  ================================================== */
#define FTDF_FTDF_RX_META_0_7_REG_RX_TIMESTAMP_Pos (0UL)            /*!< FTDF FTDF_RX_META_0_7_REG: RX_TIMESTAMP (Bit 0)       */
#define FTDF_FTDF_RX_META_0_7_REG_RX_TIMESTAMP_Msk (0xffffffffUL)   /*!< FTDF FTDF_RX_META_0_7_REG: RX_TIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =================================================  FTDF_RX_META_1_0_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_0_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_0_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_0_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_0_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_0_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_0_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_0_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_0_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_0_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_0_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_0_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_0_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_0_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_0_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_0_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_0_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_0_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_0_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_0_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_0_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_0_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_0_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_0_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_0_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_0_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_0_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_0_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_0_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_0_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_0_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_0_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_0_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_META_1_1_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_1_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_1_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_1_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_1_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_1_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_1_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_1_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_1_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_1_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_1_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_1_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_1_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_1_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_1_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_1_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_1_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_1_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_1_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_1_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_1_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_1_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_1_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_1_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_1_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_1_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_1_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_1_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_1_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_1_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_1_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_1_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_1_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_META_1_2_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_2_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_2_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_2_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_2_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_2_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_2_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_2_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_2_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_2_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_2_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_2_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_2_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_2_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_2_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_2_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_2_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_2_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_2_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_2_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_2_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_2_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_2_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_2_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_META_1_3_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_3_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_3_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_3_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_3_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_3_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_3_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_3_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_3_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_3_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_3_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_3_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_3_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_3_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_3_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_3_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_3_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_3_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_3_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_3_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_3_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_3_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_3_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_3_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_META_1_4_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_4_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_4_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_4_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_4_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_4_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_4_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_4_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_4_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_4_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_4_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_4_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_4_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_4_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_4_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_4_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_4_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_4_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
