S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_4_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_4_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_4_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_4_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_4_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_4_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_META_1_5_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_5_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_5_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_5_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_5_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_5_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_5_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_5_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_5_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_5_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_5_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_5_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_5_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_5_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_5_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_5_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_5_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_5_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_5_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_5_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_5_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_5_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_5_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_5_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_META_1_6_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_6_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_6_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_6_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_6_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_6_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_6_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_6_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_6_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_6_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_6_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_6_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_6_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_6_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_6_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_6_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_6_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_6_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_6_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_6_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_6_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_6_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_6_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_6_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_RX_META_1_7_REG  ================================================== */
#define FTDF_FTDF_RX_META_1_7_REG_QUALITY_INDICATOR_Pos (8UL)       /*!< FTDF FTDF_RX_META_1_7_REG: QUALITY_INDICATOR (Bit 8)  */
#define FTDF_FTDF_RX_META_1_7_REG_QUALITY_INDICATOR_Msk (0xff00UL)  /*!< FTDF FTDF_RX_META_1_7_REG: QUALITY_INDICATOR (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_RX_META_1_7_REG_ISPANID_COORD_ERROR_Pos (7UL)     /*!< FTDF FTDF_RX_META_1_7_REG: ISPANID_COORD_ERROR (Bit 7) */
#define FTDF_FTDF_RX_META_1_7_REG_ISPANID_COORD_ERROR_Msk (0x80UL)  /*!< FTDF FTDF_RX_META_1_7_REG: ISPANID_COORD_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_SPANID_ERROR_Pos (6UL)            /*!< FTDF FTDF_RX_META_1_7_REG: SPANID_ERROR (Bit 6)       */
#define FTDF_FTDF_RX_META_1_7_REG_SPANID_ERROR_Msk (0x40UL)         /*!< FTDF FTDF_RX_META_1_7_REG: SPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_DADDR_ERROR_Pos (5UL)             /*!< FTDF FTDF_RX_META_1_7_REG: DADDR_ERROR (Bit 5)        */
#define FTDF_FTDF_RX_META_1_7_REG_DADDR_ERROR_Msk (0x20UL)          /*!< FTDF FTDF_RX_META_1_7_REG: DADDR_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_DPANID_ERROR_Pos (4UL)            /*!< FTDF FTDF_RX_META_1_7_REG: DPANID_ERROR (Bit 4)       */
#define FTDF_FTDF_RX_META_1_7_REG_DPANID_ERROR_Msk (0x10UL)         /*!< FTDF FTDF_RX_META_1_7_REG: DPANID_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_VERSION_ERROR_Pos (3UL)   /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_VERSION_ERROR (Bit 3) */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_VERSION_ERROR_Msk (0x8UL) /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_VERSION_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_TYPE_ERROR_Pos (2UL)      /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_TYPE_ERROR (Bit 2) */
#define FTDF_FTDF_RX_META_1_7_REG_RES_FRM_TYPE_ERROR_Msk (0x4UL)    /*!< FTDF FTDF_RX_META_1_7_REG: RES_FRM_TYPE_ERROR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_RX_META_1_7_REG_CRC16_ERROR_Pos (0UL)             /*!< FTDF FTDF_RX_META_1_7_REG: CRC16_ERROR (Bit 0)        */
#define FTDF_FTDF_RX_META_1_7_REG_CRC16_ERROR_Msk (0x1UL)           /*!< FTDF FTDF_RX_META_1_7_REG: CRC16_ERROR (Bitfield-Mask: 0x01) */
/* ===============================================  FTDF_RX_STATUS_DELTA_REG  ================================================ */
#define FTDF_FTDF_RX_STATUS_DELTA_REG_RX_BUFF_IS_FULL_D_Pos (0UL)   /*!< FTDF FTDF_RX_STATUS_DELTA_REG: RX_BUFF_IS_FULL_D (Bit 0) */
#define FTDF_FTDF_RX_STATUS_DELTA_REG_RX_BUFF_IS_FULL_D_Msk (0x1UL) /*!< FTDF FTDF_RX_STATUS_DELTA_REG: RX_BUFF_IS_FULL_D (Bitfield-Mask: 0x01) */
/* ================================================  FTDF_RX_STATUS_MASK_REG  ================================================ */
#define FTDF_FTDF_RX_STATUS_MASK_REG_RX_BUFF_IS_FULL_M_Pos (0UL)    /*!< FTDF FTDF_RX_STATUS_MASK_REG: RX_BUFF_IS_FULL_M (Bit 0) */
#define FTDF_FTDF_RX_STATUS_MASK_REG_RX_BUFF_IS_FULL_M_Msk (0x1UL)  /*!< FTDF FTDF_RX_STATUS_MASK_REG: RX_BUFF_IS_FULL_M (Bitfield-Mask: 0x01) */
/* ==================================================  FTDF_RX_STATUS_REG  =================================================== */
#define FTDF_FTDF_RX_STATUS_REG_RX_WRITE_BUF_PTR_Pos (1UL)          /*!< FTDF FTDF_RX_STATUS_REG: RX_WRITE_BUF_PTR (Bit 1)     */
#define FTDF_FTDF_RX_STATUS_REG_RX_WRITE_BUF_PTR_Msk (0x1eUL)       /*!< FTDF FTDF_RX_STATUS_REG: RX_WRITE_BUF_PTR (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_RX_STATUS_REG_RX_BUFF_IS_FULL_Pos (0UL)           /*!< FTDF FTDF_RX_STATUS_REG: RX_BUFF_IS_FULL (Bit 0)      */
#define FTDF_FTDF_RX_STATUS_REG_RX_BUFF_IS_FULL_Msk (0x1UL)         /*!< FTDF FTDF_RX_STATUS_REG: RX_BUFF_IS_FULL (Bitfield-Mask: 0x01) */
/* ===================================================  FTDF_SECKEY_0_REG  =================================================== */
#define FTDF_FTDF_SECKEY_0_REG_SECKEY_0_Pos (0UL)                   /*!< FTDF FTDF_SECKEY_0_REG: SECKEY_0 (Bit 0)              */
#define FTDF_FTDF_SECKEY_0_REG_SECKEY_0_Msk (0xffffffffUL)          /*!< FTDF FTDF_SECKEY_0_REG: SECKEY_0 (Bitfield-Mask: 0xffffffff) */
/* ===================================================  FTDF_SECKEY_1_REG  =================================================== */
#define FTDF_FTDF_SECKEY_1_REG_SECKEY_1_Pos (0UL)                   /*!< FTDF FTDF_SECKEY_1_REG: SECKEY_1 (Bit 0)              */
#define FTDF_FTDF_SECKEY_1_REG_SECKEY_1_Msk (0xffffffffUL)          /*!< FTDF FTDF_SECKEY_1_REG: SECKEY_1 (Bitfield-Mask: 0xffffffff) */
/* ===================================================  FTDF_SECKEY_2_REG  =================================================== */
#define FTDF_FTDF_SECKEY_2_REG_SECKEY_2_Pos (0UL)                   /*!< FTDF FTDF_SECKEY_2_REG: SECKEY_2 (Bit 0)              */
#define FTDF_FTDF_SECKEY_2_REG_SECKEY_2_Msk (0xffffffffUL)          /*!< FTDF FTDF_SECKEY_2_REG: SECKEY_2 (Bitfield-Mask: 0xffffffff) */
/* ===================================================  FTDF_SECKEY_3_REG  =================================================== */
#define FTDF_FTDF_SECKEY_3_REG_SECKEY_3_Pos (0UL)                   /*!< FTDF FTDF_SECKEY_3_REG: SECKEY_3 (Bit 0)              */
#define FTDF_FTDF_SECKEY_3_REG_SECKEY_3_Msk (0xffffffffUL)          /*!< FTDF FTDF_SECKEY_3_REG: SECKEY_3 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  FTDF_SECNONCE_0_REG  ================================================== */
#define FTDF_FTDF_SECNONCE_0_REG_SECNONCE_0_Pos (0UL)               /*!< FTDF FTDF_SECNONCE_0_REG: SECNONCE_0 (Bit 0)          */
#define FTDF_FTDF_SECNONCE_0_REG_SECNONCE_0_Msk (0xffffffffUL)      /*!< FTDF FTDF_SECNONCE_0_REG: SECNONCE_0 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  FTDF_SECNONCE_1_REG  ================================================== */
#define FTDF_FTDF_SECNONCE_1_REG_SECNONCE_1_Pos (0UL)               /*!< FTDF FTDF_SECNONCE_1_REG: SECNONCE_1 (Bit 0)          */
#define FTDF_FTDF_SECNONCE_1_REG_SECNONCE_1_Msk (0xffffffffUL)      /*!< FTDF FTDF_SECNONCE_1_REG: SECNONCE_1 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  FTDF_SECNONCE_2_REG  ================================================== */
#define FTDF_FTDF_SECNONCE_2_REG_SECNONCE_2_Pos (0UL)               /*!< FTDF FTDF_SECNONCE_2_REG: SECNONCE_2 (Bit 0)          */
#define FTDF_FTDF_SECNONCE_2_REG_SECNONCE_2_Msk (0xffffffffUL)      /*!< FTDF FTDF_SECNONCE_2_REG: SECNONCE_2 (Bitfield-Mask: 0xffffffff) */
/* ==================================================  FTDF_SECNONCE_3_REG  ================================================== */
#define FTDF_FTDF_SECNONCE_3_REG_SECNONCE_3_Pos (0UL)               /*!< FTDF FTDF_SECNONCE_3_REG: SECNONCE_3 (Bit 0)          */
#define FTDF_FTDF_SECNONCE_3_REG_SECNONCE_3_Msk (0xffUL)            /*!< FTDF FTDF_SECNONCE_3_REG: SECNONCE_3 (Bitfield-Mask: 0xff) */
/* ==================================================  FTDF_SECURITY_0_REG  ================================================== */
#define FTDF_FTDF_SECURITY_0_REG_SECENCDECN_Pos (31UL)              /*!< FTDF FTDF_SECURITY_0_REG: SECENCDECN (Bit 31)         */
#define FTDF_FTDF_SECURITY_0_REG_SECENCDECN_Msk (0x80000000UL)      /*!< FTDF FTDF_SECURITY_0_REG: SECENCDECN (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_SECURITY_0_REG_SECMLENGTH_Pos (24UL)              /*!< FTDF FTDF_SECURITY_0_REG: SECMLENGTH (Bit 24)         */
#define FTDF_FTDF_SECURITY_0_REG_SECMLENGTH_Msk (0x7f000000UL)      /*!< FTDF FTDF_SECURITY_0_REG: SECMLENGTH (Bitfield-Mask: 0x7f) */
#define FTDF_FTDF_SECURITY_0_REG_SECALENGTH_Pos (16UL)              /*!< FTDF FTDF_SECURITY_0_REG: SECALENGTH (Bit 16)         */
#define FTDF_FTDF_SECURITY_0_REG_SECALENGTH_Msk (0x7f0000UL)        /*!< FTDF FTDF_SECURITY_0_REG: SECALENGTH (Bitfield-Mask: 0x7f) */
#define FTDF_FTDF_SECURITY_0_REG_SECENTRY_Pos (8UL)                 /*!< FTDF FTDF_SECURITY_0_REG: SECENTRY (Bit 8)            */
#define FTDF_FTDF_SECURITY_0_REG_SECENTRY_Msk (0xf00UL)             /*!< FTDF FTDF_SECURITY_0_REG: SECENTRY (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_SECURITY_0_REG_SECTXRXN_Pos (1UL)                 /*!< FTDF FTDF_SECURITY_0_REG: SECTXRXN (Bit 1)            */
#define FTDF_FTDF_SECURITY_0_REG_SECTXRXN_Msk (0x2UL)               /*!< FTDF FTDF_SECURITY_0_REG: SECTXRXN (Bitfield-Mask: 0x01) */
/* ==================================================  FTDF_SECURITY_1_REG  ================================================== */
#define FTDF_FTDF_SECURITY_1_REG_SECENCRFLAGS_Pos (8UL)             /*!< FTDF FTDF_SECURITY_1_REG: SECENCRFLAGS (Bit 8)        */
#define FTDF_FTDF_SECURITY_1_REG_SECENCRFLAGS_Msk (0xff00UL)        /*!< FTDF FTDF_SECURITY_1_REG: SECENCRFLAGS (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_SECURITY_1_REG_SECAUTHFLAGS_Pos (0UL)             /*!< FTDF FTDF_SECURITY_1_REG: SECAUTHFLAGS (Bit 0)        */
#define FTDF_FTDF_SECURITY_1_REG_SECAUTHFLAGS_Msk (0xffUL)          /*!< FTDF FTDF_SECURITY_1_REG: SECAUTHFLAGS (Bitfield-Mask: 0xff) */
/* ==============================================  FTDF_SECURITY_EVENTMASK_REG  ============================================== */
#define FTDF_FTDF_SECURITY_EVENTMASK_REG_SECREADY_M_Pos (0UL)       /*!< FTDF FTDF_SECURITY_EVENTMASK_REG: SECREADY_M (Bit 0)  */
#define FTDF_FTDF_SECURITY_EVENTMASK_REG_SECREADY_M_Msk (0x1UL)     /*!< FTDF FTDF_SECURITY_EVENTMASK_REG: SECREADY_M (Bitfield-Mask: 0x01) */
/* ================================================  FTDF_SECURITY_EVENT_REG  ================================================ */
#define FTDF_FTDF_SECURITY_EVENT_REG_SECREADY_E_Pos (0UL)           /*!< FTDF FTDF_SECURITY_EVENT_REG: SECREADY_E (Bit 0)      */
#define FTDF_FTDF_SECURITY_EVENT_REG_SECREADY_E_Msk (0x1UL)         /*!< FTDF FTDF_SECURITY_EVENT_REG: SECREADY_E (Bitfield-Mask: 0x01) */
/* =================================================  FTDF_SECURITY_OS_REG  ================================================== */
#define FTDF_FTDF_SECURITY_OS_REG_SECSTART_Pos (1UL)                /*!< FTDF FTDF_SECURITY_OS_REG: SECSTART (Bit 1)           */
#define FTDF_FTDF_SECURITY_OS_REG_SECSTART_Msk (0x2UL)              /*!< FTDF FTDF_SECURITY_OS_REG: SECSTART (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_SECURITY_OS_REG_SECABORT_Pos (0UL)                /*!< FTDF FTDF_SECURITY_OS_REG: SECABORT (Bit 0)           */
#define FTDF_FTDF_SECURITY_OS_REG_SECABORT_Msk (0x1UL)              /*!< FTDF FTDF_SECURITY_OS_REG: SECABORT (Bitfield-Mask: 0x01) */
/* ===============================================  FTDF_SECURITY_STATUS_REG  ================================================ */
#define FTDF_FTDF_SECURITY_STATUS_REG_SECAUTHFAIL_Pos (1UL)         /*!< FTDF FTDF_SECURITY_STATUS_REG: SECAUTHFAIL (Bit 1)    */
#define FTDF_FTDF_SECURITY_STATUS_REG_SECAUTHFAIL_Msk (0x2UL)       /*!< FTDF FTDF_SECURITY_STATUS_REG: SECAUTHFAIL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_SECURITY_STATUS_REG_SECBUSY_Pos (0UL)             /*!< FTDF FTDF_SECURITY_STATUS_REG: SECBUSY (Bit 0)        */
#define FTDF_FTDF_SECURITY_STATUS_REG_SECBUSY_Msk (0x1UL)           /*!< FTDF FTDF_SECURITY_STATUS_REG: SECBUSY (Bitfield-Mask: 0x01) */
/* ================================================  FTDF_SYMBOLTIME2THR_REG  ================================================ */
#define FTDF_FTDF_SYMBOLTIME2THR_REG_SYMBOLTIME2THR_Pos (0UL)       /*!< FTDF FTDF_SYMBOLTIME2THR_REG: SYMBOLTIME2THR (Bit 0)  */
#define FTDF_FTDF_SYMBOLTIME2THR_REG_SYMBOLTIME2THR_Msk (0xffffffffUL) /*!< FTDF FTDF_SYMBOLTIME2THR_REG: SYMBOLTIME2THR (Bitfield-Mask: 0xffffffff) */
/* ============================================  FTDF_SYMBOLTIMESNAPSHOTVAL_REG  ============================================= */
#define FTDF_FTDF_SYMBOLTIMESNAPSHOTVAL_REG_SYMBOLTIMESNAPSHOTVAL_Pos (0UL) /*!< FTDF FTDF_SYMBOLTIMESNAPSHOTVAL_REG: SYMBOLTIMESNAPSHOTVAL (Bit 0) */
#define FTDF_FTDF_SYMBOLTIMESNAPSHOTVAL_REG_SYMBOLTIMESNAPSHOTVAL_Msk (0xffffffffUL) /*!< FTDF FTDF_SYMBOLTIMESNAPSHOTVAL_REG: SYMBOLTIMESNAPSHOTVAL (Bitfield-Mask: 0xffffffff) */
/* ================================================  FTDF_SYMBOLTIMETHR_REG  ================================================= */
#define FTDF_FTDF_SYMBOLTIMETHR_REG_SYMBOLTIMETHR_Pos (0UL)         /*!< FTDF FTDF_SYMBOLTIMETHR_REG: SYMBOLTIMETHR (Bit 0)    */
#define FTDF_FTDF_SYMBOLTIMETHR_REG_SYMBOLTIMETHR_Msk (0xffffffffUL) /*!< FTDF FTDF_SYMBOLTIMETHR_REG: SYMBOLTIMETHR (Bitfield-Mask: 0xffffffff) */
/* ============================================  FTDF_SYNCTIMESTAMPPHASEVAL_REG  ============================================= */
#define FTDF_FTDF_SYNCTIMESTAMPPHASEVAL_REG_SYNCTIMESTAMPPHASEVAL_Pos (0UL) /*!< FTDF FTDF_SYNCTIMESTAMPPHASEVAL_REG: SYNCTIMESTAMPPHASEVAL (Bit 0) */
#define FTDF_FTDF_SYNCTIMESTAMPPHASEVAL_REG_SYNCTIMESTAMPPHASEVAL_Msk (0xffUL) /*!< FTDF FTDF_SYNCTIMESTAMPPHASEVAL_REG: SYNCTIMESTAMPPHASEVAL (Bitfield-Mask: 0xff) */
/* ===============================================  FTDF_SYNCTIMESTAMPTHR_REG  =============================================== */
#define FTDF_FTDF_SYNCTIMESTAMPTHR_REG_SYNCTIMESTAMPTHR_Pos (0UL)   /*!< FTDF FTDF_SYNCTIMESTAMPTHR_REG: SYNCTIMESTAMPTHR (Bit 0) */
#define FTDF_FTDF_SYNCTIMESTAMPTHR_REG_SYNCTIMESTAMPTHR_Msk (0xffffffffUL) /*!< FTDF FTDF_SYNCTIMESTAMPTHR_REG: SYNCTIMESTAMPTHR (Bitfield-Mask: 0xffffffff) */
/* ===============================================  FTDF_SYNCTIMESTAMPVAL_REG  =============================================== */
#define FTDF_FTDF_SYNCTIMESTAMPVAL_REG_SYNCTIMESTAMPVAL_Pos (0UL)   /*!< FTDF FTDF_SYNCTIMESTAMPVAL_REG: SYNCTIMESTAMPVAL (Bit 0) */
#define FTDF_FTDF_SYNCTIMESTAMPVAL_REG_SYNCTIMESTAMPVAL_Msk (0xffffffffUL) /*!< FTDF FTDF_SYNCTIMESTAMPVAL_REG: SYNCTIMESTAMPVAL (Bitfield-Mask: 0xffffffff) */
/* ===============================================  FTDF_TIMER_CONTROL_1_REG  ================================================ */
#define FTDF_FTDF_TIMER_CONTROL_1_REG_SYNCTIMESTAMPENA_Pos (1UL)    /*!< FTDF FTDF_TIMER_CONTROL_1_REG: SYNCTIMESTAMPENA (Bit 1) */
#define FTDF_FTDF_TIMER_CONTROL_1_REG_SYNCTIMESTAMPENA_Msk (0x2UL)  /*!< FTDF FTDF_TIMER_CONTROL_1_REG: SYNCTIMESTAMPENA (Bitfield-Mask: 0x01) */
/* ============================================  FTDF_TIMESTAMPCURRPHASEVAL_REG  ============================================= */
#define FTDF_FTDF_TIMESTAMPCURRPHASEVAL_REG_TIMESTAMPCURRPHASEVAL_Pos (0UL) /*!< FTDF FTDF_TIMESTAMPCURRPHASEVAL_REG: TIMESTAMPCURRPHASEVAL (Bit 0) */
#define FTDF_FTDF_TIMESTAMPCURRPHASEVAL_REG_TIMESTAMPCURRPHASEVAL_Msk (0xffUL) /*!< FTDF FTDF_TIMESTAMPCURRPHASEVAL_REG: TIMESTAMPCURRPHASEVAL (Bitfield-Mask: 0xff) */
/* ===============================================  FTDF_TIMESTAMPCURRVAL_REG  =============================================== */
#define FTDF_FTDF_TIMESTAMPCURRVAL_REG_TIMESTAMPCURRVAL_Pos (0UL)   /*!< FTDF FTDF_TIMESTAMPCURRVAL_REG: TIMESTAMPCURRVAL (Bit 0) */
#define FTDF_FTDF_TIMESTAMPCURRVAL_REG_TIMESTAMPCURRVAL_Msk (0xffffffffUL) /*!< FTDF FTDF_TIMESTAMPCURRVAL_REG: TIMESTAMPCURRVAL (Bitfield-Mask: 0xffffffff) */
/* ================================================  FTDF_TSCH_CONTROL_0_REG  ================================================ */
#define FTDF_FTDF_TSCH_CONTROL_0_REG_MACTSRXWAIT_Pos (16UL)         /*!< FTDF FTDF_TSCH_CONTROL_0_REG: MACTSRXWAIT (Bit 16)    */
#define FTDF_FTDF_TSCH_CONTROL_0_REG_MACTSRXWAIT_Msk (0xffff0000UL) /*!< FTDF FTDF_TSCH_CONTROL_0_REG: MACTSRXWAIT (Bitfield-Mask: 0xffff) */
#define FTDF_FTDF_TSCH_CONTROL_0_REG_MACTSTXACKDELAY_Pos (0UL)      /*!< FTDF FTDF_TSCH_CONTROL_0_REG: MACTSTXACKDELAY (Bit 0) */
#define FTDF_FTDF_TSCH_CONTROL_0_REG_MACTSTXACKDELAY_Msk (0xffffUL) /*!< FTDF FTDF_TSCH_CONTROL_0_REG: MACTSTXACKDELAY (Bitfield-Mask: 0xffff) */
/* ================================================  FTDF_TSCH_CONTROL_1_REG  ================================================ */
#define FTDF_FTDF_TSCH_CONTROL_1_REG_MACTSRXTX_Pos (0UL)            /*!< FTDF FTDF_TSCH_CONTROL_1_REG: MACTSRXTX (Bit 0)       */
#define FTDF_FTDF_TSCH_CONTROL_1_REG_MACTSRXTX_Msk (0xffffUL)       /*!< FTDF FTDF_TSCH_CONTROL_1_REG: MACTSRXTX (Bitfield-Mask: 0xffff) */
/* ================================================  FTDF_TSCH_CONTROL_2_REG  ================================================ */
#define FTDF_FTDF_TSCH_CONTROL_2_REG_MACTSACKWAIT_Pos (16UL)        /*!< FTDF FTDF_TSCH_CONTROL_2_REG: MACTSACKWAIT (Bit 16)   */
#define FTDF_FTDF_TSCH_CONTROL_2_REG_MACTSACKWAIT_Msk (0xffff0000UL) /*!< FTDF FTDF_TSCH_CONTROL_2_REG: MACTSACKWAIT (Bitfield-Mask: 0xffff) */
#define FTDF_FTDF_TSCH_CONTROL_2_REG_MACTSRXACKDELAY_Pos (0UL)      /*!< FTDF FTDF_TSCH_CONTROL_2_REG: MACTSRXACKDELAY (Bit 0) */
#define FTDF_FTDF_TSCH_CONTROL_2_REG_MACTSRXACKDELAY_Msk (0xffffUL) /*!< FTDF FTDF_TSCH_CONTROL_2_REG: MACTSRXACKDELAY (Bitfield-Mask: 0xffff) */
/* ===================================================  FTDF_TXBYTE_E_REG  =================================================== */
#define FTDF_FTDF_TXBYTE_E_REG_TX_LAST_SYMBOL_E_Pos (1UL)           /*!< FTDF FTDF_TXBYTE_E_REG: TX_LAST_SYMBOL_E (Bit 1)      */
#define FTDF_FTDF_TXBYTE_E_REG_TX_LAST_SYMBOL_E_Msk (0x2UL)         /*!< FTDF FTDF_TXBYTE_E_REG: TX_LAST_SYMBOL_E (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TXBYTE_E_REG_TXBYTE_E_Pos (0UL)                   /*!< FTDF FTDF_TXBYTE_E_REG: TXBYTE_E (Bit 0)              */
#define FTDF_FTDF_TXBYTE_E_REG_TXBYTE_E_Msk (0x1UL)                 /*!< FTDF FTDF_TXBYTE_E_REG: TXBYTE_E (Bitfield-Mask: 0x01) */
/* ===================================================  FTDF_TXBYTE_M_REG  =================================================== */
#define FTDF_FTDF_TXBYTE_M_REG_TX_LAST_SYMBOL_M_Pos (1UL)           /*!< FTDF FTDF_TXBYTE_M_REG: TX_LAST_SYMBOL_M (Bit 1)      */
#define FTDF_FTDF_TXBYTE_M_REG_TX_LAST_SYMBOL_M_Msk (0x2UL)         /*!< FTDF FTDF_TXBYTE_M_REG: TX_LAST_SYMBOL_M (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TXBYTE_M_REG_TXBYTE_M_Pos (0UL)                   /*!< FTDF FTDF_TXBYTE_M_REG: TXBYTE_M (Bit 0)              */
#define FTDF_FTDF_TXBYTE_M_REG_TXBYTE_M_Msk (0x1UL)                 /*!< FTDF FTDF_TXBYTE_M_REG: TXBYTE_M (Bitfield-Mask: 0x01) */
/* ===============================================  FTDF_TXPIPEPROPDELAY_REG  ================================================ */
#define FTDF_FTDF_TXPIPEPROPDELAY_REG_TXPIPEPROPDELAY_Pos (0UL)     /*!< FTDF FTDF_TXPIPEPROPDELAY_REG: TXPIPEPROPDELAY (Bit 0) */
#define FTDF_FTDF_TXPIPEPROPDELAY_REG_TXPIPEPROPDELAY_Msk (0xffUL)  /*!< FTDF FTDF_TXPIPEPROPDELAY_REG: TXPIPEPROPDELAY (Bitfield-Mask: 0xff) */
