S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* =============================================  FTDF_TX_RETURN_STATUS_0_0_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_0_0_REG_TXTIMESTAMP_Pos (0UL)    /*!< FTDF FTDF_TX_RETURN_STATUS_0_0_REG: TXTIMESTAMP (Bit 0) */
#define FTDF_FTDF_TX_RETURN_STATUS_0_0_REG_TXTIMESTAMP_Msk (0xffffffffUL) /*!< FTDF FTDF_TX_RETURN_STATUS_0_0_REG: TXTIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =============================================  FTDF_TX_RETURN_STATUS_0_1_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_0_1_REG_TXTIMESTAMP_Pos (0UL)    /*!< FTDF FTDF_TX_RETURN_STATUS_0_1_REG: TXTIMESTAMP (Bit 0) */
#define FTDF_FTDF_TX_RETURN_STATUS_0_1_REG_TXTIMESTAMP_Msk (0xffffffffUL) /*!< FTDF FTDF_TX_RETURN_STATUS_0_1_REG: TXTIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =============================================  FTDF_TX_RETURN_STATUS_0_2_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_0_2_REG_TXTIMESTAMP_Pos (0UL)    /*!< FTDF FTDF_TX_RETURN_STATUS_0_2_REG: TXTIMESTAMP (Bit 0) */
#define FTDF_FTDF_TX_RETURN_STATUS_0_2_REG_TXTIMESTAMP_Msk (0xffffffffUL) /*!< FTDF FTDF_TX_RETURN_STATUS_0_2_REG: TXTIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =============================================  FTDF_TX_RETURN_STATUS_0_3_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_0_3_REG_TXTIMESTAMP_Pos (0UL)    /*!< FTDF FTDF_TX_RETURN_STATUS_0_3_REG: TXTIMESTAMP (Bit 0) */
#define FTDF_FTDF_TX_RETURN_STATUS_0_3_REG_TXTIMESTAMP_Msk (0xffffffffUL) /*!< FTDF FTDF_TX_RETURN_STATUS_0_3_REG: TXTIMESTAMP (Bitfield-Mask: 0xffffffff) */
/* =============================================  FTDF_TX_RETURN_STATUS_1_0_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_1_0_REG_CSMACANRRETRIES_Pos (2UL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_0_REG: CSMACANRRETRIES (Bit 2) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_0_REG_CSMACANRRETRIES_Msk (0x1cUL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_0_REG: CSMACANRRETRIES (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_0_REG_CSMACAFAIL_Pos (1UL)     /*!< FTDF FTDF_TX_RETURN_STATUS_1_0_REG: CSMACAFAIL (Bit 1) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_0_REG_CSMACAFAIL_Msk (0x2UL)   /*!< FTDF FTDF_TX_RETURN_STATUS_1_0_REG: CSMACAFAIL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_0_REG_ACKFAIL_Pos (0UL)        /*!< FTDF FTDF_TX_RETURN_STATUS_1_0_REG: ACKFAIL (Bit 0)   */
#define FTDF_FTDF_TX_RETURN_STATUS_1_0_REG_ACKFAIL_Msk (0x1UL)      /*!< FTDF FTDF_TX_RETURN_STATUS_1_0_REG: ACKFAIL (Bitfield-Mask: 0x01) */
/* =============================================  FTDF_TX_RETURN_STATUS_1_1_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_1_1_REG_CSMACANRRETRIES_Pos (2UL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_1_REG: CSMACANRRETRIES (Bit 2) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_1_REG_CSMACANRRETRIES_Msk (0x1cUL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_1_REG: CSMACANRRETRIES (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_1_REG_CSMACAFAIL_Pos (1UL)     /*!< FTDF FTDF_TX_RETURN_STATUS_1_1_REG: CSMACAFAIL (Bit 1) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_1_REG_CSMACAFAIL_Msk (0x2UL)   /*!< FTDF FTDF_TX_RETURN_STATUS_1_1_REG: CSMACAFAIL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_1_REG_ACKFAIL_Pos (0UL)        /*!< FTDF FTDF_TX_RETURN_STATUS_1_1_REG: ACKFAIL (Bit 0)   */
#define FTDF_FTDF_TX_RETURN_STATUS_1_1_REG_ACKFAIL_Msk (0x1UL)      /*!< FTDF FTDF_TX_RETURN_STATUS_1_1_REG: ACKFAIL (Bitfield-Mask: 0x01) */
/* =============================================  FTDF_TX_RETURN_STATUS_1_2_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_1_2_REG_CSMACANRRETRIES_Pos (2UL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_2_REG: CSMACANRRETRIES (Bit 2) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_2_REG_CSMACANRRETRIES_Msk (0x1cUL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_2_REG: CSMACANRRETRIES (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_2_REG_CSMACAFAIL_Pos (1UL)     /*!< FTDF FTDF_TX_RETURN_STATUS_1_2_REG: CSMACAFAIL (Bit 1) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_2_REG_CSMACAFAIL_Msk (0x2UL)   /*!< FTDF FTDF_TX_RETURN_STATUS_1_2_REG: CSMACAFAIL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_2_REG_ACKFAIL_Pos (0UL)        /*!< FTDF FTDF_TX_RETURN_STATUS_1_2_REG: ACKFAIL (Bit 0)   */
#define FTDF_FTDF_TX_RETURN_STATUS_1_2_REG_ACKFAIL_Msk (0x1UL)      /*!< FTDF FTDF_TX_RETURN_STATUS_1_2_REG: ACKFAIL (Bitfield-Mask: 0x01) */
/* =============================================  FTDF_TX_RETURN_STATUS_1_3_REG  ============================================= */
#define FTDF_FTDF_TX_RETURN_STATUS_1_3_REG_CSMACANRRETRIES_Pos (2UL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_3_REG: CSMACANRRETRIES (Bit 2) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_3_REG_CSMACANRRETRIES_Msk (0x1cUL) /*!< FTDF FTDF_TX_RETURN_STATUS_1_3_REG: CSMACANRRETRIES (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_3_REG_CSMACAFAIL_Pos (1UL)     /*!< FTDF FTDF_TX_RETURN_STATUS_1_3_REG: CSMACAFAIL (Bit 1) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_3_REG_CSMACAFAIL_Msk (0x2UL)   /*!< FTDF FTDF_TX_RETURN_STATUS_1_3_REG: CSMACAFAIL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_TX_RETURN_STATUS_1_3_REG_ACKFAIL_Pos (0UL)        /*!< FTDF FTDF_TX_RETURN_STATUS_1_3_REG: ACKFAIL (Bit 0)   */
#define FTDF_FTDF_TX_RETURN_STATUS_1_3_REG_ACKFAIL_Msk (0x1UL)      /*!< FTDF FTDF_TX_RETURN_STATUS_1_3_REG: ACKFAIL (Bitfield-Mask: 0x01) */
/* ==================================================  FTDF_TX_SET_OS_REG  =================================================== */
#define FTDF_FTDF_TX_SET_OS_REG_TX_FLAG_SET_Pos (0UL)               /*!< FTDF FTDF_TX_SET_OS_REG: TX_FLAG_SET (Bit 0)          */
#define FTDF_FTDF_TX_SET_OS_REG_TX_FLAG_SET_Msk (0xfUL)             /*!< FTDF FTDF_TX_SET_OS_REG: TX_FLAG_SET (Bitfield-Mask: 0x0f) */
/* =================================================  FTDF_WAKEUPINTTHR_REG  ================================================= */
#define FTDF_FTDF_WAKEUPINTTHR_REG_WAKEUPINTTHR_Pos (0UL)           /*!< FTDF FTDF_WAKEUPINTTHR_REG: WAKEUPINTTHR (Bit 0)      */
#define FTDF_FTDF_WAKEUPINTTHR_REG_WAKEUPINTTHR_Msk (0xffffffffUL)  /*!< FTDF FTDF_WAKEUPINTTHR_REG: WAKEUPINTTHR (Bitfield-Mask: 0xffffffff) */
/* ================================================  FTDF_WAKEUP_CONTROL_REG  ================================================ */
#define FTDF_FTDF_WAKEUP_CONTROL_REG_WAKEUPENABLE_Pos (1UL)         /*!< FTDF FTDF_WAKEUP_CONTROL_REG: WAKEUPENABLE (Bit 1)    */
#define FTDF_FTDF_WAKEUP_CONTROL_REG_WAKEUPENABLE_Msk (0x2UL)       /*!< FTDF FTDF_WAKEUP_CONTROL_REG: WAKEUPENABLE (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_WAKEUP_CONTROL_REG_WAKEUPTIMERENABLE_Pos (0UL)    /*!< FTDF FTDF_WAKEUP_CONTROL_REG: WAKEUPTIMERENABLE (Bit 0) */
#define FTDF_FTDF_WAKEUP_CONTROL_REG_WAKEUPTIMERENABLE_Msk (0x1UL)  /*!< FTDF FTDF_WAKEUP_CONTROL_REG: WAKEUPTIMERENABLE (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                         GP_TIMERS                                         ================ */
/* =========================================================================================================================== */

/* ====================================================  BREATH_CFG_REG  ===================================================== */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_STEP_Pos (8UL)                /*!< GP_TIMERS BREATH_CFG_REG: BRTH_STEP (Bit 8)           */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_STEP_Msk (0xff00UL)           /*!< GP_TIMERS BREATH_CFG_REG: BRTH_STEP (Bitfield-Mask: 0xff) */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_DIV_Pos (0UL)                 /*!< GP_TIMERS BREATH_CFG_REG: BRTH_DIV (Bit 0)            */
#define GP_TIMERS_BREATH_CFG_REG_BRTH_DIV_Msk (0xffUL)              /*!< GP_TIMERS BREATH_CFG_REG: BRTH_DIV (Bitfield-Mask: 0xff) */
/* ====================================================  BREATH_CTRL_REG  ==================================================== */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_PWM_POL_Pos (1UL)            /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_PWM_POL (Bit 1)       */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_PWM_POL_Msk (0x2UL)          /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_PWM_POL (Bitfield-Mask: 0x01) */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_EN_Pos (0UL)                 /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_EN (Bit 0)            */
#define GP_TIMERS_BREATH_CTRL_REG_BRTH_EN_Msk (0x1UL)               /*!< GP_TIMERS BREATH_CTRL_REG: BRTH_EN (Bitfield-Mask: 0x01) */
/* ==================================================  BREATH_DUTY_MAX_REG  ================================================== */
#define GP_TIMERS_BREATH_DUTY_MAX_REG_BRTH_DUTY_MAX_Pos (0UL)       /*!< GP_TIMERS BREATH_DUTY_MAX_REG: BRTH_DUTY_MAX (Bit 0)  */
#define GP_TIMERS_BREATH_DUTY_MAX_REG_BRTH_DUTY_MAX_Msk (0xffUL)    /*!< GP_TIMERS BREATH_DUTY_MAX_REG: BRTH_DUTY_MAX (Bitfield-Mask: 0xff) */
/* ==================================================  BREATH_DUTY_MIN_REG  ================================================== */
#define GP_TIMERS_BREATH_DUTY_MIN_REG_BRTH_DUTY_MIN_Pos (0UL)       /*!< GP_TIMERS BREATH_DUTY_MIN_REG: BRTH_DUTY_MIN (Bit 0)  */
#define GP_TIMERS_BREATH_DUTY_MIN_REG_BRTH_DUTY_MIN_Msk (0xffUL)    /*!< GP_TIMERS BREATH_DUTY_MIN_REG: BRTH_DUTY_MIN (Bitfield-Mask: 0xff) */
/* ====================================================  PWM2_END_CYCLE  ===================================================== */
#define GP_TIMERS_PWM2_END_CYCLE_END_CYCLE_Pos (0UL)                /*!< GP_TIMERS PWM2_END_CYCLE: END_CYCLE (Bit 0)           */
#define GP_TIMERS_PWM2_END_CYCLE_END_CYCLE_Msk (0x3fffUL)           /*!< GP_TIMERS PWM2_END_CYCLE: END_CYCLE (Bitfield-Mask: 0x3fff) */
/* ===================================================  PWM2_START_CYCLE  ==================================================== */
#define GP_TIMERS_PWM2_START_CYCLE_START_CYCLE_Pos (0UL)            /*!< GP_TIMERS PWM2_START_CYCLE: START_CYCLE (Bit 0)       */
#define GP_TIMERS_PWM2_START_CYCLE_START_CYCLE_Msk (0x3fffUL)       /*!< GP_TIMERS PWM2_START_CYCLE: START_CYCLE (Bitfield-Mask: 0x3fff) */
/* ====================================================  PWM3_END_CYCLE  ===================================================== */
#define GP_TIMERS_PWM3_END_CYCLE_END_CYCLE_Pos (0UL)                /*!< GP_TIMERS PWM3_END_CYCLE: END_CYCLE (Bit 0)           */
#define GP_TIMERS_PWM3_END_CYCLE_END_CYCLE_Msk (0x3fffUL)           /*!< GP_TIMERS PWM3_END_CYCLE: END_CYCLE (Bitfield-Mask: 0x3fff) */
/* ===================================================  PWM3_START_CYCLE  ==================================================== */
#define GP_TIMERS_PWM3_START_CYCLE_START_CYCLE_Pos (0UL)            /*!< GP_TIMERS PWM3_START_CYCLE: START_CYCLE (Bit 0)       */
#define GP_TIMERS_PWM3_START_CYCLE_START_CYCLE_Msk (0x3fffUL)       /*!< GP_TIMERS PWM3_START_CYCLE: START_CYCLE (Bitfield-Mask: 0x3fff) */
/* ====================================================  PWM4_END_CYCLE  ===================================================== */
#define GP_TIMERS_PWM4_END_CYCLE_END_CYCLE_Pos (0UL)                /*!< GP_TIMERS PWM4_END_CYCLE: END_CYCLE (Bit 0)           */
#define GP_TIMERS_PWM4_END_CYCLE_END_CYCLE_Msk (0x3fffUL)           /*!< GP_TIMERS PWM4_END_CYCLE: END_CYCLE (Bitfield-Mask: 0x3fff) */
/* ===================================================  PWM4_START_CYCLE  ==================================================== */
#define GP_TIMERS_PWM4_START_CYCLE_START_CYCLE_Pos (0UL)            /*!< GP_TIMERS PWM4_START_CYCLE: START_CYCLE (Bit 0)       */
#define GP_TIMERS_PWM4_START_CYCLE_START_CYCLE_Msk (0x3fffUL)       /*!< GP_TIMERS PWM4_START_CYCLE: START_CYCLE (Bitfield-Mask: 0x3fff) */
/* ====================================================  TIMER0_CTRL_REG  ==================================================== */
#define GP_TIMERS_TIMER0_CTRL_REG_PWM_MODE_Pos (3UL)                /*!< GP_TIMERS TIMER0_CTRL_REG: PWM_MODE (Bit 3)           */
#define GP_TIMERS_TIMER0_CTRL_REG_PWM_MODE_Msk (0x8UL)              /*!< GP_TIMERS TIMER0_CTRL_REG: PWM_MODE (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_DIV_Pos (2UL)            /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_DIV (Bit 2)       */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_DIV_Msk (0x4UL)          /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_DIV (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_SEL_Pos (1UL)            /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_SEL (Bit 1)       */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CLK_SEL_Msk (0x2UL)          /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CLK_SEL (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CTRL_Pos (0UL)               /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CTRL (Bit 0)          */
#define GP_TIMERS_TIMER0_CTRL_REG_TIM0_CTRL_Msk (0x1UL)             /*!< GP_TIMERS TIMER0_CTRL_REG: TIM0_CTRL (Bitfield-Mask: 0x01) */
/* =====================================================  TIMER0_ON_REG  ===================================================== */
#define GP_TIMERS_TIMER0_ON_REG_TIM0_ON_Pos (0UL)                   /*!< GP_TIMERS TIMER0_ON_REG: TIM0_ON (Bit 0)              */
#define GP_TIMERS_TIMER0_ON_REG_TIM0_ON_Msk (0xffffUL)              /*!< GP_TIMERS TIMER0_ON_REG: TIM0_ON (Bitfield-Mask: 0xffff) */
/* ==================================================  TIMER0_RELOAD_M_REG  ================================================== */
#define GP_TIMERS_TIMER0_RELOAD_M_REG_TIM0_M_Pos (0UL)              /*!< GP_TIMERS TIMER0_RELOAD_M_REG: TIM0_M (Bit 0)         */
#define GP_TIMERS_TIMER0_RELOAD_M_REG_TIM0_M_Msk (0xffffUL)         /*!< GP_TIMERS TIMER0_RELOAD_M_REG: TIM0_M (Bitfield-Mask: 0xffff) */
/* ==================================================  TIMER0_RELOAD_N_REG  ================================================== */
#define GP_TIMERS_TIMER0_RELOAD_N_REG_TIM0_N_Pos (0UL)              /*!< GP_TIMERS TIMER0_RELOAD_N_REG: TIM0_N (Bit 0)         */
#define GP_TIMERS_TIMER0_RELOAD_N_REG_TIM0_N_Msk (0xffffUL)         /*!< GP_TIMERS TIMER0_RELOAD_N_REG: TIM0_N (Bitfield-Mask: 0xffff) */
/* ==================================================  TRIPLE_PWM_CTRL_REG  ================================================== */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_HW_PAUSE_EN_Pos (2UL)         /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: HW_PAUSE_EN (Bit 2)    */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_HW_PAUSE_EN_Msk (0x4UL)       /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: HW_PAUSE_EN (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_SW_PAUSE_EN_Pos (1UL)         /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: SW_PAUSE_EN (Bit 1)    */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_SW_PAUSE_EN_Msk (0x2UL)       /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: SW_PAUSE_EN (Bitfield-Mask: 0x01) */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_TRIPLE_PWM_ENABLE_Pos (0UL)   /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: TRIPLE_PWM_ENABLE (Bit 0) */
#define GP_TIMERS_TRIPLE_PWM_CTRL_REG_TRIPLE_PWM_ENABLE_Msk (0x1UL) /*!< GP_TIMERS TRIPLE_PWM_CTRL_REG: TRIPLE_PWM_ENABLE (Bitfield-Mask: 0x01) */
/* =================================================  TRIPLE_PWM_FREQUENCY  ================================================== */
#define GP_TIMERS_TRIPLE_PWM_FREQUENCY_FREQ_Pos (0UL)               /*!< GP_TIMERS TRIPLE_PWM_FREQUENCY: FREQ (Bit 0)          */
#define GP_TIMERS_TRIPLE_PWM_FREQUENCY_FREQ_Msk (0x3fffUL)          /*!< GP_TIMERS TRIPLE_PWM_FREQUENCY: FREQ (Bitfield-Mask: 0x3fff) */


/* =========================================================================================================================== */
/* ================                                           GPADC                                           ================ */
/* =========================================================================================================================== */

