S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* =====================================================  BIST_CTRL_REG  ===================================================== */
#define GPIO_BIST_CTRL_REG_SHOW_BIST_Pos  (7UL)                     /*!< GPIO BIST_CTRL_REG: SHOW_BIST (Bit 7)                 */
#define GPIO_BIST_CTRL_REG_SHOW_BIST_Msk  (0x80UL)                  /*!< GPIO BIST_CTRL_REG: SHOW_BIST (Bitfield-Mask: 0x01)   */
#define GPIO_BIST_CTRL_REG_SYSRAMBIST_ENABLE_Pos (6UL)              /*!< GPIO BIST_CTRL_REG: SYSRAMBIST_ENABLE (Bit 6)         */
#define GPIO_BIST_CTRL_REG_SYSRAMBIST_ENABLE_Msk (0x40UL)           /*!< GPIO BIST_CTRL_REG: SYSRAMBIST_ENABLE (Bitfield-Mask: 0x01) */
#define GPIO_BIST_CTRL_REG_RAMBIST_ENABLE_Pos (5UL)                 /*!< GPIO BIST_CTRL_REG: RAMBIST_ENABLE (Bit 5)            */
#define GPIO_BIST_CTRL_REG_RAMBIST_ENABLE_Msk (0x20UL)              /*!< GPIO BIST_CTRL_REG: RAMBIST_ENABLE (Bitfield-Mask: 0x01) */
#define GPIO_BIST_CTRL_REG_ROMBIST_ENABLE_Pos (4UL)                 /*!< GPIO BIST_CTRL_REG: ROMBIST_ENABLE (Bit 4)            */
#define GPIO_BIST_CTRL_REG_ROMBIST_ENABLE_Msk (0x10UL)              /*!< GPIO BIST_CTRL_REG: ROMBIST_ENABLE (Bitfield-Mask: 0x01) */
#define GPIO_BIST_CTRL_REG_RAM_BIST_PATTERN_Pos (2UL)               /*!< GPIO BIST_CTRL_REG: RAM_BIST_PATTERN (Bit 2)          */
#define GPIO_BIST_CTRL_REG_RAM_BIST_PATTERN_Msk (0xcUL)             /*!< GPIO BIST_CTRL_REG: RAM_BIST_PATTERN (Bitfield-Mask: 0x03) */
#define GPIO_BIST_CTRL_REG_RAM_BIST_CONFIG_Pos (0UL)                /*!< GPIO BIST_CTRL_REG: RAM_BIST_CONFIG (Bit 0)           */
#define GPIO_BIST_CTRL_REG_RAM_BIST_CONFIG_Msk (0x3UL)              /*!< GPIO BIST_CTRL_REG: RAM_BIST_CONFIG (Bitfield-Mask: 0x03) */
/* =====================================================  GPIO_CLK_SEL  ====================================================== */
#define GPIO_GPIO_CLK_SEL_FUNC_CLOCK_SEL_Pos (0UL)                  /*!< GPIO GPIO_CLK_SEL: FUNC_CLOCK_SEL (Bit 0)             */
#define GPIO_GPIO_CLK_SEL_FUNC_CLOCK_SEL_Msk (0x7UL)                /*!< GPIO GPIO_CLK_SEL: FUNC_CLOCK_SEL (Bitfield-Mask: 0x07) */
/* =====================================================  P00_MODE_REG  ====================================================== */
#define GPIO_P00_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P00_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P00_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P00_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P00_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P00_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P00_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P00_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P00_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P00_MODE_REG: PID (Bit 0)                        */
#define GPIO_P00_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P00_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P01_MODE_REG  ====================================================== */
#define GPIO_P01_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P01_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P01_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P01_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P01_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P01_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P01_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P01_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P01_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P01_MODE_REG: PID (Bit 0)                        */
#define GPIO_P01_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P01_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P02_MODE_REG  ====================================================== */
#define GPIO_P02_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P02_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P02_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P02_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P02_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P02_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P02_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P02_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P02_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P02_MODE_REG: PID (Bit 0)                        */
#define GPIO_P02_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P02_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P03_MODE_REG  ====================================================== */
#define GPIO_P03_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P03_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P03_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P03_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P03_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P03_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P03_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P03_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P03_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P03_MODE_REG: PID (Bit 0)                        */
#define GPIO_P03_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P03_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P04_MODE_REG  ====================================================== */
#define GPIO_P04_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P04_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P04_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P04_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P04_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P04_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P04_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P04_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P04_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P04_MODE_REG: PID (Bit 0)                        */
#define GPIO_P04_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P04_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P05_MODE_REG  ====================================================== */
#define GPIO_P05_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P05_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P05_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P05_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P05_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P05_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P05_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P05_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P05_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P05_MODE_REG: PID (Bit 0)                        */
#define GPIO_P05_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P05_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P06_MODE_REG  ====================================================== */
#define GPIO_P06_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P06_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P06_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P06_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P06_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P06_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P06_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P06_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P06_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P06_MODE_REG: PID (Bit 0)                        */
#define GPIO_P06_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P06_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P07_MODE_REG  ====================================================== */
#define GPIO_P07_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P07_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P07_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P07_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P07_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P07_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P07_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P07_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P07_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P07_MODE_REG: PID (Bit 0)                        */
#define GPIO_P07_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P07_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* ======================================================  P0_DATA_REG  ====================================================== */
#define GPIO_P0_DATA_REG_P0_DATA_Pos      (0UL)                     /*!< GPIO P0_DATA_REG: P0_DATA (Bit 0)                     */
#define GPIO_P0_DATA_REG_P0_DATA_Msk      (0xffUL)                  /*!< GPIO P0_DATA_REG: P0_DATA (Bitfield-Mask: 0xff)       */
/* ==================================================  P0_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P0_PADPWR_CTRL_REG_P0_OUT_CTRL_Pos (6UL)               /*!< GPIO P0_PADPWR_CTRL_REG: P0_OUT_CTRL (Bit 6)          */
#define GPIO_P0_PADPWR_CTRL_REG_P0_OUT_CTRL_Msk (0xc0UL)            /*!< GPIO P0_PADPWR_CTRL_REG: P0_OUT_CTRL (Bitfield-Mask: 0x03) */
/* ===================================================  P0_RESET_DATA_REG  =================================================== */
#define GPIO_P0_RESET_DATA_REG_P0_RESET_Pos (0UL)                   /*!< GPIO P0_RESET_DATA_REG: P0_RESET (Bit 0)              */
#define GPIO_P0_RESET_DATA_REG_P0_RESET_Msk (0xffUL)                /*!< GPIO P0_RESET_DATA_REG: P0_RESET (Bitfield-Mask: 0xff) */
/* ====================================================  P0_SET_DATA_REG  ==================================================== */
#define GPIO_P0_SET_DATA_REG_P0_SET_Pos   (0UL)                     /*!< GPIO P0_SET_DATA_REG: P0_SET (Bit 0)                  */
#define GPIO_P0_SET_DATA_REG_P0_SET_Msk   (0xffUL)                  /*!< GPIO P0_SET_DATA_REG: P0_SET (Bitfield-Mask: 0xff)    */
/* =====================================================  P10_MODE_REG  ====================================================== */
#define GPIO_P10_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P10_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P10_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P10_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P10_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P10_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P10_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P10_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P10_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P10_MODE_REG: PID (Bit 0)                        */
#define GPIO_P10_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P10_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P11_MODE_REG  ====================================================== */
#define GPIO_P11_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P11_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P11_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P11_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P11_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P11_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P11_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P11_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P11_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P11_MODE_REG: PID (Bit 0)                        */
#define GPIO_P11_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P11_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P12_MODE_REG  ====================================================== */
#define GPIO_P12_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P12_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P12_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P12_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P12_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P12_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P12_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P12_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P12_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P12_MODE_REG: PID (Bit 0)                        */
#define GPIO_P12_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P12_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P13_MODE_REG  ====================================================== */
#define GPIO_P13_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P13_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P13_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P13_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P13_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P13_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P13_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P13_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P13_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P13_MODE_REG: PID (Bit 0)                        */
#define GPIO_P13_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P13_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P14_MODE_REG  ====================================================== */
#define GPIO_P14_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P14_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P14_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P14_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P14_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P14_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P14_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P14_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P14_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P14_MODE_REG: PID (Bit 0)                        */
#define GPIO_P14_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P14_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P15_MODE_REG  ====================================================== */
#define GPIO_P15_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P15_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P15_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P15_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P15_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P15_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P15_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P15_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P15_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P15_MODE_REG: PID (Bit 0)                        */
#define GPIO_P15_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P15_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P16_MODE_REG  ====================================================== */
#define GPIO_P16_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P16_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P16_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P16_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P16_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P16_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P16_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P16_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P16_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P16_MODE_REG: PID (Bit 0)                        */
#define GPIO_P16_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P16_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P17_MODE_REG  ====================================================== */
#define GPIO_P17_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P17_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P17_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P17_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P17_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P17_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P17_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P17_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P17_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P17_MODE_REG: PID (Bit 0)                        */
#define GPIO_P17_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P17_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* ======================================================  P1_DATA_REG  ====================================================== */
#define GPIO_P1_DATA_REG_P1_DATA_Pos      (0UL)                     /*!< GPIO P1_DATA_REG: P1_DATA (Bit 0)                     */
#define GPIO_P1_DATA_REG_P1_DATA_Msk      (0xffUL)                  /*!< GPIO P1_DATA_REG: P1_DATA (Bitfield-Mask: 0xff)       */
/* ==================================================  P1_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P1_PADPWR_CTRL_REG_P1_OUT_CTRL_Pos (0UL)               /*!< GPIO P1_PADPWR_CTRL_REG: P1_OUT_CTRL (Bit 0)          */
#define GPIO_P1_PADPWR_CTRL_REG_P1_OUT_CTRL_Msk (0xffUL)            /*!< GPIO P1_PADPWR_CTRL_REG: P1_OUT_CTRL (Bitfield-Mask: 0xff) */
/* ===================================================  P1_RESET_DATA_REG  =================================================== */
#define GPIO_P1_RESET_DATA_REG_P1_RESET_Pos (0UL)                   /*!< GPIO P1_RESET_DATA_REG: P1_RESET (Bit 0)              */
#define GPIO_P1_RESET_DATA_REG_P1_RESET_Msk (0xffUL)                /*!< GPIO P1_RESET_DATA_REG: P1_RESET (Bitfield-Mask: 0xff) */
/* ====================================================  P1_SET_DATA_REG  ==================================================== */
#define GPIO_P1_SET_DATA_REG_P1_SET_Pos   (0UL)                     /*!< GPIO P1_SET_DATA_REG: P1_SET (Bit 0)                  */
#define GPIO_P1_SET_DATA_REG_P1_SET_Msk   (0xffUL)                  /*!< GPIO P1_SET_DATA_REG: P1_SET (Bitfield-Mask: 0xff)    */
/* =====================================================  P20_MODE_REG  ====================================================== */
#define GPIO_P20_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P20_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P20_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P20_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P20_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P20_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P20_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P20_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P20_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P20_MODE_REG: PID (Bit 0)                        */
#define GPIO_P20_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P20_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P21_MODE_REG  ====================================================== */
#define GPIO_P21_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P21_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P21_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P21_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P21_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P21_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P21_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P21_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P21_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P21_MODE_REG: PID (Bit 0)                        */
#define GPIO_P21_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P21_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P22_MODE_REG  ====================================================== */
#define GPIO_P22_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P22_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P22_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P22_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P22_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P22_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P22_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P22_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P22_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P22_MODE_REG: PID (Bit 0)                        */
#define GPIO_P22_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P22_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P23_MODE_REG  ====================================================== */
#define GPIO_P23_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P23_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P23_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P23_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P23_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P23_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P23_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P23_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P23_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P23_MODE_REG: PID (Bit 0)                        */
#define GPIO_P23_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P23_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P24_MODE_REG  ====================================================== */
#define GPIO_P24_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P24_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P24_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P24_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P24_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P24_MODE_REG: PUPD (Bit 8)                       */
