S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define GPIO_P24_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P24_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P24_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P24_MODE_REG: PID (Bit 0)                        */
#define GPIO_P24_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P24_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* ======================================================  P2_DATA_REG  ====================================================== */
#define GPIO_P2_DATA_REG_P2_DATA_Pos      (0UL)                     /*!< GPIO P2_DATA_REG: P2_DATA (Bit 0)                     */
#define GPIO_P2_DATA_REG_P2_DATA_Msk      (0x1fUL)                  /*!< GPIO P2_DATA_REG: P2_DATA (Bitfield-Mask: 0x1f)       */
/* ==================================================  P2_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P2_PADPWR_CTRL_REG_P2_OUT_CTRL_Pos (0UL)               /*!< GPIO P2_PADPWR_CTRL_REG: P2_OUT_CTRL (Bit 0)          */
#define GPIO_P2_PADPWR_CTRL_REG_P2_OUT_CTRL_Msk (0x1fUL)            /*!< GPIO P2_PADPWR_CTRL_REG: P2_OUT_CTRL (Bitfield-Mask: 0x1f) */
/* ===================================================  P2_RESET_DATA_REG  =================================================== */
#define GPIO_P2_RESET_DATA_REG_P2_RESET_Pos (0UL)                   /*!< GPIO P2_RESET_DATA_REG: P2_RESET (Bit 0)              */
#define GPIO_P2_RESET_DATA_REG_P2_RESET_Msk (0x1fUL)                /*!< GPIO P2_RESET_DATA_REG: P2_RESET (Bitfield-Mask: 0x1f) */
/* ====================================================  P2_SET_DATA_REG  ==================================================== */
#define GPIO_P2_SET_DATA_REG_P2_SET_Pos   (0UL)                     /*!< GPIO P2_SET_DATA_REG: P2_SET (Bit 0)                  */
#define GPIO_P2_SET_DATA_REG_P2_SET_Msk   (0x1fUL)                  /*!< GPIO P2_SET_DATA_REG: P2_SET (Bitfield-Mask: 0x1f)    */
/* =====================================================  P30_MODE_REG  ====================================================== */
#define GPIO_P30_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P30_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P30_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P30_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P30_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P30_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P30_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P30_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P30_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P30_MODE_REG: PID (Bit 0)                        */
#define GPIO_P30_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P30_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P31_MODE_REG  ====================================================== */
#define GPIO_P31_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P31_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P31_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P31_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P31_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P31_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P31_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P31_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P31_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P31_MODE_REG: PID (Bit 0)                        */
#define GPIO_P31_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P31_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P32_MODE_REG  ====================================================== */
#define GPIO_P32_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P32_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P32_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P32_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P32_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P32_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P32_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P32_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P32_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P32_MODE_REG: PID (Bit 0)                        */
#define GPIO_P32_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P32_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P33_MODE_REG  ====================================================== */
#define GPIO_P33_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P33_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P33_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P33_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P33_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P33_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P33_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P33_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P33_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P33_MODE_REG: PID (Bit 0)                        */
#define GPIO_P33_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P33_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P34_MODE_REG  ====================================================== */
#define GPIO_P34_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P34_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P34_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P34_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P34_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P34_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P34_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P34_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P34_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P34_MODE_REG: PID (Bit 0)                        */
#define GPIO_P34_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P34_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P35_MODE_REG  ====================================================== */
#define GPIO_P35_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P35_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P35_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P35_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P35_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P35_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P35_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P35_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P35_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P35_MODE_REG: PID (Bit 0)                        */
#define GPIO_P35_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P35_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P36_MODE_REG  ====================================================== */
#define GPIO_P36_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P36_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P36_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P36_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P36_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P36_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P36_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P36_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P36_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P36_MODE_REG: PID (Bit 0)                        */
#define GPIO_P36_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P36_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P37_MODE_REG  ====================================================== */
#define GPIO_P37_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P37_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P37_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P37_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P37_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P37_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P37_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P37_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P37_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P37_MODE_REG: PID (Bit 0)                        */
#define GPIO_P37_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P37_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* ======================================================  P3_DATA_REG  ====================================================== */
#define GPIO_P3_DATA_REG_P3_DATA_Pos      (0UL)                     /*!< GPIO P3_DATA_REG: P3_DATA (Bit 0)                     */
#define GPIO_P3_DATA_REG_P3_DATA_Msk      (0xffUL)                  /*!< GPIO P3_DATA_REG: P3_DATA (Bitfield-Mask: 0xff)       */
/* ==================================================  P3_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P3_PADPWR_CTRL_REG_P3_OUT_CTRL_Pos (0UL)               /*!< GPIO P3_PADPWR_CTRL_REG: P3_OUT_CTRL (Bit 0)          */
#define GPIO_P3_PADPWR_CTRL_REG_P3_OUT_CTRL_Msk (0xffUL)            /*!< GPIO P3_PADPWR_CTRL_REG: P3_OUT_CTRL (Bitfield-Mask: 0xff) */
/* ===================================================  P3_RESET_DATA_REG  =================================================== */
#define GPIO_P3_RESET_DATA_REG_P3_RESET_Pos (0UL)                   /*!< GPIO P3_RESET_DATA_REG: P3_RESET (Bit 0)              */
#define GPIO_P3_RESET_DATA_REG_P3_RESET_Msk (0xffUL)                /*!< GPIO P3_RESET_DATA_REG: P3_RESET (Bitfield-Mask: 0xff) */
/* ====================================================  P3_SET_DATA_REG  ==================================================== */
#define GPIO_P3_SET_DATA_REG_P3_SET_Pos   (0UL)                     /*!< GPIO P3_SET_DATA_REG: P3_SET (Bit 0)                  */
#define GPIO_P3_SET_DATA_REG_P3_SET_Msk   (0xffUL)                  /*!< GPIO P3_SET_DATA_REG: P3_SET (Bitfield-Mask: 0xff)    */
/* =====================================================  P40_MODE_REG  ====================================================== */
#define GPIO_P40_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P40_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P40_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P40_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P40_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P40_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P40_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P40_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P40_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P40_MODE_REG: PID (Bit 0)                        */
#define GPIO_P40_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P40_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P41_MODE_REG  ====================================================== */
#define GPIO_P41_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P41_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P41_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P41_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P41_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P41_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P41_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P41_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P41_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P41_MODE_REG: PID (Bit 0)                        */
#define GPIO_P41_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P41_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P42_MODE_REG  ====================================================== */
#define GPIO_P42_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P42_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P42_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P42_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P42_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P42_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P42_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P42_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P42_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P42_MODE_REG: PID (Bit 0)                        */
#define GPIO_P42_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P42_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P43_MODE_REG  ====================================================== */
#define GPIO_P43_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P43_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P43_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P43_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P43_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P43_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P43_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P43_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P43_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P43_MODE_REG: PID (Bit 0)                        */
#define GPIO_P43_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P43_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P44_MODE_REG  ====================================================== */
#define GPIO_P44_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P44_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P44_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P44_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P44_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P44_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P44_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P44_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P44_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P44_MODE_REG: PID (Bit 0)                        */
#define GPIO_P44_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P44_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P45_MODE_REG  ====================================================== */
#define GPIO_P45_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P45_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P45_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P45_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P45_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P45_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P45_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P45_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P45_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P45_MODE_REG: PID (Bit 0)                        */
#define GPIO_P45_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P45_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P46_MODE_REG  ====================================================== */
#define GPIO_P46_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P46_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P46_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P46_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P46_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P46_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P46_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P46_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P46_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P46_MODE_REG: PID (Bit 0)                        */
#define GPIO_P46_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P46_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* =====================================================  P47_MODE_REG  ====================================================== */
#define GPIO_P47_MODE_REG_PPOD_Pos        (10UL)                    /*!< GPIO P47_MODE_REG: PPOD (Bit 10)                      */
#define GPIO_P47_MODE_REG_PPOD_Msk        (0x400UL)                 /*!< GPIO P47_MODE_REG: PPOD (Bitfield-Mask: 0x01)         */
#define GPIO_P47_MODE_REG_PUPD_Pos        (8UL)                     /*!< GPIO P47_MODE_REG: PUPD (Bit 8)                       */
#define GPIO_P47_MODE_REG_PUPD_Msk        (0x300UL)                 /*!< GPIO P47_MODE_REG: PUPD (Bitfield-Mask: 0x03)         */
#define GPIO_P47_MODE_REG_PID_Pos         (0UL)                     /*!< GPIO P47_MODE_REG: PID (Bit 0)                        */
#define GPIO_P47_MODE_REG_PID_Msk         (0x3fUL)                  /*!< GPIO P47_MODE_REG: PID (Bitfield-Mask: 0x3f)          */
/* ======================================================  P4_DATA_REG  ====================================================== */
#define GPIO_P4_DATA_REG_P4_DATA_Pos      (0UL)                     /*!< GPIO P4_DATA_REG: P4_DATA (Bit 0)                     */
#define GPIO_P4_DATA_REG_P4_DATA_Msk      (0xffUL)                  /*!< GPIO P4_DATA_REG: P4_DATA (Bitfield-Mask: 0xff)       */
/* ==================================================  P4_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P4_PADPWR_CTRL_REG_P4_OUT_CTRL_Pos (0UL)               /*!< GPIO P4_PADPWR_CTRL_REG: P4_OUT_CTRL (Bit 0)          */
#define GPIO_P4_PADPWR_CTRL_REG_P4_OUT_CTRL_Msk (0xffUL)            /*!< GPIO P4_PADPWR_CTRL_REG: P4_OUT_CTRL (Bitfield-Mask: 0xff) */
/* ===================================================  P4_RESET_DATA_REG  =================================================== */
#define GPIO_P4_RESET_DATA_REG_P4_RESET_Pos (0UL)                   /*!< GPIO P4_RESET_DATA_REG: P4_RESET (Bit 0)              */
#define GPIO_P4_RESET_DATA_REG_P4_RESET_Msk (0xffUL)                /*!< GPIO P4_RESET_DATA_REG: P4_RESET (Bitfield-Mask: 0xff) */
/* ====================================================  P4_SET_DATA_REG  ==================================================== */
#define GPIO_P4_SET_DATA_REG_P4_SET_Pos   (0UL)                     /*!< GPIO P4_SET_DATA_REG: P4_SET (Bit 0)                  */
#define GPIO_P4_SET_DATA_REG_P4_SET_Msk   (0xffUL)                  /*!< GPIO P4_SET_DATA_REG: P4_SET (Bitfield-Mask: 0xff)    */
/* ==================================================  RAMBIST_STATUS1_REG  ================================================== */
#define GPIO_RAMBIST_STATUS1_REG_ROM_BIST_BUSY_Pos (15UL)           /*!< GPIO RAMBIST_STATUS1_REG: ROM_BIST_BUSY (Bit 15)      */
#define GPIO_RAMBIST_STATUS1_REG_ROM_BIST_BUSY_Msk (0x8000UL)       /*!< GPIO RAMBIST_STATUS1_REG: ROM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_BUSY_Pos (14UL)       /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_BUSY (Bit 14)  */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_BUSY_Msk (0x4000UL)   /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_FAIL_Pos (13UL)       /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_FAIL (Bit 13)  */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_FAIL_Msk (0x2000UL)   /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_LINE_FAIL_Pos (12UL)  /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_LINE_FAIL (Bit 12) */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_LINE_FAIL_Msk (0x1000UL) /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_BUSY_Pos (11UL)        /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_BUSY (Bit 11)   */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_BUSY_Msk (0x800UL)     /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_FAIL_Pos (10UL)        /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_FAIL (Bit 10)   */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_FAIL_Msk (0x400UL)     /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_LINE_FAIL_Pos (9UL)    /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_LINE_FAIL (Bit 9) */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_LINE_FAIL_Msk (0x200UL) /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_BUSY_Pos (8UL)          /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_BUSY (Bit 8)     */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_BUSY_Msk (0x100UL)      /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_FAIL_Pos (7UL)          /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_FAIL (Bit 7)     */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_FAIL_Msk (0x80UL)       /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_LINE_FAIL_Pos (6UL)     /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_LINE_FAIL (Bit 6) */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_LINE_FAIL_Msk (0x40UL)  /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_BUSY_Pos (5UL)          /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_BUSY (Bit 5)     */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_BUSY_Msk (0x20UL)       /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_FAIL_Pos (4UL)          /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_FAIL (Bit 4)     */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_FAIL_Msk (0x10UL)       /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_LINE_FAIL_Pos (3UL)     /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_LINE_FAIL (Bit 3) */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_LINE_FAIL_Msk (0x8UL)   /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_BUSY_Pos (2UL)         /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_BUSY (Bit 2)    */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_BUSY_Msk (0x4UL)       /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_FAIL_Pos (1UL)         /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_FAIL (Bit 1)    */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_FAIL_Msk (0x2UL)       /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
