S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_LINE_FAIL_Pos (0UL)    /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_LINE_FAIL (Bit 0) */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_LINE_FAIL_Msk (0x1UL)  /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
/* ==================================================  RAMBIST_STATUS2_REG  ================================================== */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_BUSY_Pos (14UL)     /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_BUSY (Bit 14) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_BUSY_Msk (0x4000UL) /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_FAIL_Pos (13UL)     /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_FAIL (Bit 13) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_FAIL_Msk (0x2000UL) /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_LINE_FAIL_Pos (12UL) /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_LINE_FAIL (Bit 12) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_LINE_FAIL_Msk (0x1000UL) /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_BUSY_Pos (11UL)    /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_BUSY (Bit 11) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_BUSY_Msk (0x800UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_FAIL_Pos (10UL)    /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_FAIL (Bit 10) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_FAIL_Msk (0x400UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_LINE_FAIL_Pos (9UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_LINE_FAIL (Bit 9) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_LINE_FAIL_Msk (0x200UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_BUSY_Pos (8UL)    /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_BUSY (Bit 8) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_BUSY_Msk (0x100UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_FAIL_Pos (7UL)    /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_FAIL (Bit 7) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_FAIL_Msk (0x80UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_LINE_FAIL_Pos (6UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_LINE_FAIL (Bit 6) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_LINE_FAIL_Msk (0x40UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_BUSY_Pos (5UL)     /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_BUSY (Bit 5) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_BUSY_Msk (0x20UL)  /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_FAIL_Pos (4UL)     /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_FAIL (Bit 4) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_FAIL_Msk (0x10UL)  /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_LINE_FAIL_Pos (3UL) /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_LINE_FAIL (Bit 3) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_LINE_FAIL_Msk (0x8UL) /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_BUSY_Pos (2UL)     /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_BUSY (Bit 2) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_BUSY_Msk (0x4UL)   /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_FAIL_Pos (1UL)     /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_FAIL (Bit 1) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_FAIL_Msk (0x2UL)   /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_LINE_FAIL_Pos (0UL) /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_LINE_FAIL (Bit 0) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_LINE_FAIL_Msk (0x1UL) /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
/* ==================================================  ROMBIST_RESULTH_REG  ================================================== */
#define GPIO_ROMBIST_RESULTH_REG_ROMBIST_RESULTH_Pos (0UL)          /*!< GPIO ROMBIST_RESULTH_REG: ROMBIST_RESULTH (Bit 0)     */
#define GPIO_ROMBIST_RESULTH_REG_ROMBIST_RESULTH_Msk (0xffffUL)     /*!< GPIO ROMBIST_RESULTH_REG: ROMBIST_RESULTH (Bitfield-Mask: 0xffff) */
/* ==================================================  ROMBIST_RESULTL_REG  ================================================== */
#define GPIO_ROMBIST_RESULTL_REG_ROMBIST_RESULTL_Pos (0UL)          /*!< GPIO ROMBIST_RESULTL_REG: ROMBIST_RESULTL (Bit 0)     */
#define GPIO_ROMBIST_RESULTL_REG_ROMBIST_RESULTL_Msk (0xffffUL)     /*!< GPIO ROMBIST_RESULTL_REG: ROMBIST_RESULTL (Bitfield-Mask: 0xffff) */
/* ====================================================  TEST_CTRL2_REG  ===================================================== */
#define GPIO_TEST_CTRL2_REG_RF_IN_TESTMUX_CTRL_Pos (8UL)            /*!< GPIO TEST_CTRL2_REG: RF_IN_TESTMUX_CTRL (Bit 8)       */
#define GPIO_TEST_CTRL2_REG_RF_IN_TESTMUX_CTRL_Msk (0x300UL)        /*!< GPIO TEST_CTRL2_REG: RF_IN_TESTMUX_CTRL (Bitfield-Mask: 0x03) */
#define GPIO_TEST_CTRL2_REG_ANA_TESTMUX_CTRL_Pos (0UL)              /*!< GPIO TEST_CTRL2_REG: ANA_TESTMUX_CTRL (Bit 0)         */
#define GPIO_TEST_CTRL2_REG_ANA_TESTMUX_CTRL_Msk (0xfUL)            /*!< GPIO TEST_CTRL2_REG: ANA_TESTMUX_CTRL (Bitfield-Mask: 0x0f) */
/* ====================================================  TEST_CTRL3_REG  ===================================================== */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_PARAM_Pos (8UL)             /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_PARAM (Bit 8)        */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_PARAM_Msk (0xff00UL)        /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_PARAM (Bitfield-Mask: 0xff) */
#define GPIO_TEST_CTRL3_REG_USBCOMP_TEST_Pos (6UL)                  /*!< GPIO TEST_CTRL3_REG: USBCOMP_TEST (Bit 6)             */
#define GPIO_TEST_CTRL3_REG_USBCOMP_TEST_Msk (0x40UL)               /*!< GPIO TEST_CTRL3_REG: USBCOMP_TEST (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_SEL_Pos (0UL)               /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_SEL (Bit 0)          */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_SEL_Msk (0x3fUL)            /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_SEL (Bitfield-Mask: 0x3f) */
/* ====================================================  TEST_CTRL4_REG  ===================================================== */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_PARAM_Pos (8UL)              /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_PARAM (Bit 8)         */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_PARAM_Msk (0xff00UL)         /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_PARAM (Bitfield-Mask: 0xff) */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_SEL_Pos (0UL)                /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_SEL (Bit 0)           */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_SEL_Msk (0x7UL)              /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_SEL (Bitfield-Mask: 0x07) */
/* ====================================================  TEST_CTRL5_REG  ===================================================== */
#define GPIO_TEST_CTRL5_REG_TEST_VREF_1V2_A_Pos (13UL)              /*!< GPIO TEST_CTRL5_REG: TEST_VREF_1V2_A (Bit 13)         */
#define GPIO_TEST_CTRL5_REG_TEST_VREF_1V2_A_Msk (0x2000UL)          /*!< GPIO TEST_CTRL5_REG: TEST_VREF_1V2_A (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_VCONT_A_Pos (12UL)                 /*!< GPIO TEST_CTRL5_REG: TEST_VCONT_A (Bit 12)            */
#define GPIO_TEST_CTRL5_REG_TEST_VCONT_A_Msk (0x1000UL)             /*!< GPIO TEST_CTRL5_REG: TEST_VCONT_A (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_I_DCDC_FILT_Pos (11UL)             /*!< GPIO TEST_CTRL5_REG: TEST_I_DCDC_FILT (Bit 11)        */
#define GPIO_TEST_CTRL5_REG_TEST_I_DCDC_FILT_Msk (0x800UL)          /*!< GPIO TEST_CTRL5_REG: TEST_I_DCDC_FILT (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_IN_Pos (10UL)             /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_IN (Bit 10)        */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_IN_Msk (0x400UL)          /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_IN (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_OUT_Pos (9UL)             /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_OUT (Bit 9)        */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_OUT_Msk (0x200UL)         /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_OUT (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_SIMO_BUCK_Pos (8UL)                /*!< GPIO TEST_CTRL5_REG: TEST_SIMO_BUCK (Bit 8)           */
#define GPIO_TEST_CTRL5_REG_TEST_SIMO_BUCK_Msk (0x100UL)            /*!< GPIO TEST_CTRL5_REG: TEST_SIMO_BUCK (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_BANDGAP_I_TEST_Pos (7UL)           /*!< GPIO TEST_CTRL5_REG: TEST_BANDGAP_I_TEST (Bit 7)      */
#define GPIO_TEST_CTRL5_REG_TEST_BANDGAP_I_TEST_Msk (0x80UL)        /*!< GPIO TEST_CTRL5_REG: TEST_BANDGAP_I_TEST (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_PLL_Pos (6UL)                  /*!< GPIO TEST_CTRL5_REG: TEST_LDO_PLL (Bit 6)             */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_PLL_Msk (0x40UL)               /*!< GPIO TEST_CTRL5_REG: TEST_LDO_PLL (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_ADC_Pos (5UL)                  /*!< GPIO TEST_CTRL5_REG: TEST_LDO_ADC (Bit 5)             */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_ADC_Msk (0x20UL)               /*!< GPIO TEST_CTRL5_REG: TEST_LDO_ADC (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_PA_Pos (4UL)               /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_PA (Bit 4)          */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_PA_Msk (0x10UL)            /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_PA (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_CORE_Pos (3UL)                 /*!< GPIO TEST_CTRL5_REG: TEST_LDO_CORE (Bit 3)            */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_CORE_Msk (0x8UL)               /*!< GPIO TEST_CTRL5_REG: TEST_LDO_CORE (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_FLASH_Pos (2UL)            /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_FLASH (Bit 2)       */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_FLASH_Msk (0x4UL)          /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_FLASH (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V4_Pos (1UL)                  /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V4 (Bit 1)             */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V4_Msk (0x2UL)                /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V4 (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_BUS_TO_AVS_Pos (0UL)               /*!< GPIO TEST_CTRL5_REG: TEST_BUS_TO_AVS (Bit 0)          */
#define GPIO_TEST_CTRL5_REG_TEST_BUS_TO_AVS_Msk (0x1UL)             /*!< GPIO TEST_CTRL5_REG: TEST_BUS_TO_AVS (Bitfield-Mask: 0x01) */
/* =====================================================  TEST_CTRL_REG  ===================================================== */
#define GPIO_TEST_CTRL_REG_SHOW_PWR_TST_OUT_Pos (8UL)               /*!< GPIO TEST_CTRL_REG: SHOW_PWR_TST_OUT (Bit 8)          */
#define GPIO_TEST_CTRL_REG_SHOW_PWR_TST_OUT_Msk (0x700UL)           /*!< GPIO TEST_CTRL_REG: SHOW_PWR_TST_OUT (Bitfield-Mask: 0x07) */
#define GPIO_TEST_CTRL_REG_SHOW_TXDAC_MOD_Pos (7UL)                 /*!< GPIO TEST_CTRL_REG: SHOW_TXDAC_MOD (Bit 7)            */
#define GPIO_TEST_CTRL_REG_SHOW_TXDAC_MOD_Msk (0x80UL)              /*!< GPIO TEST_CTRL_REG: SHOW_TXDAC_MOD (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_PLL_TST_MODE_Pos (6UL)                   /*!< GPIO TEST_CTRL_REG: PLL_TST_MODE (Bit 6)              */
#define GPIO_TEST_CTRL_REG_PLL_TST_MODE_Msk (0x40UL)                /*!< GPIO TEST_CTRL_REG: PLL_TST_MODE (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_SHOW_IF_RO_Pos (5UL)                     /*!< GPIO TEST_CTRL_REG: SHOW_IF_RO (Bit 5)                */
#define GPIO_TEST_CTRL_REG_SHOW_IF_RO_Msk (0x20UL)                  /*!< GPIO TEST_CTRL_REG: SHOW_IF_RO (Bitfield-Mask: 0x01)  */
#define GPIO_TEST_CTRL_REG_XTAL16M_CAP_TEST_EN_Pos (4UL)            /*!< GPIO TEST_CTRL_REG: XTAL16M_CAP_TEST_EN (Bit 4)       */
#define GPIO_TEST_CTRL_REG_XTAL16M_CAP_TEST_EN_Msk (0x10UL)         /*!< GPIO TEST_CTRL_REG: XTAL16M_CAP_TEST_EN (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_SHOW_DCDC_TESTBUS_Pos (3UL)              /*!< GPIO TEST_CTRL_REG: SHOW_DCDC_TESTBUS (Bit 3)         */
#define GPIO_TEST_CTRL_REG_SHOW_DCDC_TESTBUS_Msk (0x8UL)            /*!< GPIO TEST_CTRL_REG: SHOW_DCDC_TESTBUS (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_SHOW_PLL_TEST_OUT_Pos (2UL)              /*!< GPIO TEST_CTRL_REG: SHOW_PLL_TEST_OUT (Bit 2)         */
#define GPIO_TEST_CTRL_REG_SHOW_PLL_TEST_OUT_Msk (0x4UL)            /*!< GPIO TEST_CTRL_REG: SHOW_PLL_TEST_OUT (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_ENABLE_RFPT_Pos (1UL)                    /*!< GPIO TEST_CTRL_REG: ENABLE_RFPT (Bit 1)               */
#define GPIO_TEST_CTRL_REG_ENABLE_RFPT_Msk (0x2UL)                  /*!< GPIO TEST_CTRL_REG: ENABLE_RFPT (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_SHOW_CLOCKS_Pos (0UL)                    /*!< GPIO TEST_CTRL_REG: SHOW_CLOCKS (Bit 0)               */
#define GPIO_TEST_CTRL_REG_SHOW_CLOCKS_Msk (0x1UL)                  /*!< GPIO TEST_CTRL_REG: SHOW_CLOCKS (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                           GPREG                                           ================ */
/* =========================================================================================================================== */

