S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* =======================================================  DEBUG_REG  ======================================================= */
#define GPREG_DEBUG_REG_DEBUGS_FREEZE_EN_Pos (0UL)                  /*!< GPREG DEBUG_REG: DEBUGS_FREEZE_EN (Bit 0)             */
#define GPREG_DEBUG_REG_DEBUGS_FREEZE_EN_Msk (0x1UL)                /*!< GPREG DEBUG_REG: DEBUGS_FREEZE_EN (Bitfield-Mask: 0x01) */
/* ===================================================  ECC_BASE_ADDR_REG  =================================================== */
#define GPREG_ECC_BASE_ADDR_REG_ECC_BASE_ADDR_Pos (0UL)             /*!< GPREG ECC_BASE_ADDR_REG: ECC_BASE_ADDR (Bit 0)        */
#define GPREG_ECC_BASE_ADDR_REG_ECC_BASE_ADDR_Msk (0x7fUL)          /*!< GPREG ECC_BASE_ADDR_REG: ECC_BASE_ADDR (Bitfield-Mask: 0x7f) */
/* ====================================================  GP_CONTROL_REG  ===================================================== */
#define GPREG_GP_CONTROL_REG_BLE_DEEPSLDUR_MONITOR_Pos (8UL)        /*!< GPREG GP_CONTROL_REG: BLE_DEEPSLDUR_MONITOR (Bit 8)   */
#define GPREG_GP_CONTROL_REG_BLE_DEEPSLDUR_MONITOR_Msk (0xff00UL)   /*!< GPREG GP_CONTROL_REG: BLE_DEEPSLDUR_MONITOR (Bitfield-Mask: 0xff) */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_LP_IRQ_Pos (2UL)            /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_LP_IRQ (Bit 2)       */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_LP_IRQ_Msk (0x4UL)          /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_LP_IRQ (Bitfield-Mask: 0x01) */
#define GPREG_GP_CONTROL_REG_BLE_H2H_BRIDGE_BYPASS_Pos (1UL)        /*!< GPREG GP_CONTROL_REG: BLE_H2H_BRIDGE_BYPASS (Bit 1)   */
#define GPREG_GP_CONTROL_REG_BLE_H2H_BRIDGE_BYPASS_Msk (0x2UL)      /*!< GPREG GP_CONTROL_REG: BLE_H2H_BRIDGE_BYPASS (Bitfield-Mask: 0x01) */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_REQ_Pos (0UL)               /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_REQ (Bit 0)          */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_REQ_Msk (0x1UL)             /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_REQ (Bitfield-Mask: 0x01) */
/* =====================================================  GP_STATUS_REG  ===================================================== */
#define GPREG_GP_STATUS_REG_CAL_PHASE_Pos (0UL)                     /*!< GPREG GP_STATUS_REG: CAL_PHASE (Bit 0)                */
#define GPREG_GP_STATUS_REG_CAL_PHASE_Msk (0x1UL)                   /*!< GPREG GP_STATUS_REG: CAL_PHASE (Bitfield-Mask: 0x01)  */
/* ====================================================  LED_CONTROL_REG  ==================================================== */
#define GPREG_LED_CONTROL_REG_LED3_EN_Pos (5UL)                     /*!< GPREG LED_CONTROL_REG: LED3_EN (Bit 5)                */
#define GPREG_LED_CONTROL_REG_LED3_EN_Msk (0x20UL)                  /*!< GPREG LED_CONTROL_REG: LED3_EN (Bitfield-Mask: 0x01)  */
#define GPREG_LED_CONTROL_REG_LED2_EN_Pos (4UL)                     /*!< GPREG LED_CONTROL_REG: LED2_EN (Bit 4)                */
#define GPREG_LED_CONTROL_REG_LED2_EN_Msk (0x10UL)                  /*!< GPREG LED_CONTROL_REG: LED2_EN (Bitfield-Mask: 0x01)  */
#define GPREG_LED_CONTROL_REG_LED1_EN_Pos (3UL)                     /*!< GPREG LED_CONTROL_REG: LED1_EN (Bit 3)                */
#define GPREG_LED_CONTROL_REG_LED1_EN_Msk (0x8UL)                   /*!< GPREG LED_CONTROL_REG: LED1_EN (Bitfield-Mask: 0x01)  */
#define GPREG_LED_CONTROL_REG_LED3_SRC_SEL_Pos (2UL)                /*!< GPREG LED_CONTROL_REG: LED3_SRC_SEL (Bit 2)           */
#define GPREG_LED_CONTROL_REG_LED3_SRC_SEL_Msk (0x4UL)              /*!< GPREG LED_CONTROL_REG: LED3_SRC_SEL (Bitfield-Mask: 0x01) */
#define GPREG_LED_CONTROL_REG_LED2_SRC_SEL_Pos (1UL)                /*!< GPREG LED_CONTROL_REG: LED2_SRC_SEL (Bit 1)           */
#define GPREG_LED_CONTROL_REG_LED2_SRC_SEL_Msk (0x2UL)              /*!< GPREG LED_CONTROL_REG: LED2_SRC_SEL (Bitfield-Mask: 0x01) */
#define GPREG_LED_CONTROL_REG_LED1_SRC_SEL_Pos (0UL)                /*!< GPREG LED_CONTROL_REG: LED1_SRC_SEL (Bit 0)           */
#define GPREG_LED_CONTROL_REG_LED1_SRC_SEL_Msk (0x1UL)              /*!< GPREG LED_CONTROL_REG: LED1_SRC_SEL (Bitfield-Mask: 0x01) */
/* ===================================================  PLL_SYS_CTRL1_REG  =================================================== */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_R_DIV_Pos (8UL)                 /*!< GPREG PLL_SYS_CTRL1_REG: PLL_R_DIV (Bit 8)            */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_R_DIV_Msk (0x7f00UL)            /*!< GPREG PLL_SYS_CTRL1_REG: PLL_R_DIV (Bitfield-Mask: 0x7f) */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_VREF_HOLD_Pos (2UL)         /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_VREF_HOLD (Bit 2)    */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_VREF_HOLD_Msk (0x4UL)       /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_VREF_HOLD (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_ENABLE_Pos (1UL)            /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_ENABLE (Bit 1)       */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_ENABLE_Msk (0x2UL)          /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_ENABLE (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_EN_Pos (0UL)                    /*!< GPREG PLL_SYS_CTRL1_REG: PLL_EN (Bit 0)               */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_EN_Msk (0x1UL)                  /*!< GPREG PLL_SYS_CTRL1_REG: PLL_EN (Bitfield-Mask: 0x01) */
/* ===================================================  PLL_SYS_CTRL2_REG  =================================================== */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_SEL_MIN_CUR_INT_Pos (14UL)      /*!< GPREG PLL_SYS_CTRL2_REG: PLL_SEL_MIN_CUR_INT (Bit 14) */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_SEL_MIN_CUR_INT_Msk (0x4000UL)  /*!< GPREG PLL_SYS_CTRL2_REG: PLL_SEL_MIN_CUR_INT (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_DEL_SEL_Pos (12UL)              /*!< GPREG PLL_SYS_CTRL2_REG: PLL_DEL_SEL (Bit 12)         */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_DEL_SEL_Msk (0x3000UL)          /*!< GPREG PLL_SYS_CTRL2_REG: PLL_DEL_SEL (Bitfield-Mask: 0x03) */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_N_DIV_Pos (0UL)                 /*!< GPREG PLL_SYS_CTRL2_REG: PLL_N_DIV (Bit 0)            */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_N_DIV_Msk (0x7fUL)              /*!< GPREG PLL_SYS_CTRL2_REG: PLL_N_DIV (Bitfield-Mask: 0x7f) */
/* ===================================================  PLL_SYS_CTRL3_REG  =================================================== */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_RECALIB_Pos (15UL)              /*!< GPREG PLL_SYS_CTRL3_REG: PLL_RECALIB (Bit 15)         */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_RECALIB_Msk (0x8000UL)          /*!< GPREG PLL_SYS_CTRL3_REG: PLL_RECALIB (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_START_DEL_Pos (10UL)            /*!< GPREG PLL_SYS_CTRL3_REG: PLL_START_DEL (Bit 10)       */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_START_DEL_Msk (0x7c00UL)        /*!< GPREG PLL_SYS_CTRL3_REG: PLL_START_DEL (Bitfield-Mask: 0x1f) */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_ICP_SEL_Pos (0UL)               /*!< GPREG PLL_SYS_CTRL3_REG: PLL_ICP_SEL (Bit 0)          */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_ICP_SEL_Msk (0x1fUL)            /*!< GPREG PLL_SYS_CTRL3_REG: PLL_ICP_SEL (Bitfield-Mask: 0x1f) */
/* ==================================================  PLL_SYS_STATUS_REG  =================================================== */
#define GPREG_PLL_SYS_STATUS_REG_PLL_CALIBR_END_Pos (11UL)          /*!< GPREG PLL_SYS_STATUS_REG: PLL_CALIBR_END (Bit 11)     */
#define GPREG_PLL_SYS_STATUS_REG_PLL_CALIBR_END_Msk (0x800UL)       /*!< GPREG PLL_SYS_STATUS_REG: PLL_CALIBR_END (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_STATUS_REG_PLL_PLL_BEST_MIN_CUR_Pos (5UL)     /*!< GPREG PLL_SYS_STATUS_REG: PLL_PLL_BEST_MIN_CUR (Bit 5) */
#define GPREG_PLL_SYS_STATUS_REG_PLL_PLL_BEST_MIN_CUR_Msk (0x7e0UL) /*!< GPREG PLL_SYS_STATUS_REG: PLL_PLL_BEST_MIN_CUR (Bitfield-Mask: 0x3f) */
#define GPREG_PLL_SYS_STATUS_REG_LDO_PLL_OK_Pos (1UL)               /*!< GPREG PLL_SYS_STATUS_REG: LDO_PLL_OK (Bit 1)          */
#define GPREG_PLL_SYS_STATUS_REG_LDO_PLL_OK_Msk (0x2UL)             /*!< GPREG PLL_SYS_STATUS_REG: LDO_PLL_OK (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_STATUS_REG_PLL_LOCK_FINE_Pos (0UL)            /*!< GPREG PLL_SYS_STATUS_REG: PLL_LOCK_FINE (Bit 0)       */
#define GPREG_PLL_SYS_STATUS_REG_PLL_LOCK_FINE_Msk (0x1UL)          /*!< GPREG PLL_SYS_STATUS_REG: PLL_LOCK_FINE (Bitfield-Mask: 0x01) */
/* ===================================================  PLL_SYS_TEST_REG  ==================================================== */
#define GPREG_PLL_SYS_TEST_REG_PLL_LOCK_DET_RES_CNT_Pos (13UL)      /*!< GPREG PLL_SYS_TEST_REG: PLL_LOCK_DET_RES_CNT (Bit 13) */
#define GPREG_PLL_SYS_TEST_REG_PLL_LOCK_DET_RES_CNT_Msk (0xe000UL)  /*!< GPREG PLL_SYS_TEST_REG: PLL_LOCK_DET_RES_CNT (Bitfield-Mask: 0x07) */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_R_DIV_TEST_Pos (11UL)        /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_R_DIV_TEST (Bit 11)   */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_R_DIV_TEST_Msk (0x800UL)     /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_R_DIV_TEST (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_N_DIV_TEST_Pos (10UL)        /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_N_DIV_TEST (Bit 10)   */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_N_DIV_TEST_Msk (0x400UL)     /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_N_DIV_TEST (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_CHANGE_Pos (9UL)                 /*!< GPREG PLL_SYS_TEST_REG: PLL_CHANGE (Bit 9)            */
#define GPREG_PLL_SYS_TEST_REG_PLL_CHANGE_Msk (0x200UL)             /*!< GPREG PLL_SYS_TEST_REG: PLL_CHANGE (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_OPEN_LOOP_Pos (8UL)              /*!< GPREG PLL_SYS_TEST_REG: PLL_OPEN_LOOP (Bit 8)         */
#define GPREG_PLL_SYS_TEST_REG_PLL_OPEN_LOOP_Msk (0x100UL)          /*!< GPREG PLL_SYS_TEST_REG: PLL_OPEN_LOOP (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_TEST_VCTR_Pos (7UL)              /*!< GPREG PLL_SYS_TEST_REG: PLL_TEST_VCTR (Bit 7)         */
#define GPREG_PLL_SYS_TEST_REG_PLL_TEST_VCTR_Msk (0x80UL)           /*!< GPREG PLL_SYS_TEST_REG: PLL_TEST_VCTR (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_MIN_CURRENT_Pos (1UL)            /*!< GPREG PLL_SYS_TEST_REG: PLL_MIN_CURRENT (Bit 1)       */
#define GPREG_PLL_SYS_TEST_REG_PLL_MIN_CURRENT_Msk (0x7eUL)         /*!< GPREG PLL_SYS_TEST_REG: PLL_MIN_CURRENT (Bitfield-Mask: 0x3f) */
#define GPREG_PLL_SYS_TEST_REG_PLL_DIS_LOOPFILT_Pos (0UL)           /*!< GPREG PLL_SYS_TEST_REG: PLL_DIS_LOOPFILT (Bit 0)      */
#define GPREG_PLL_SYS_TEST_REG_PLL_DIS_LOOPFILT_Msk (0x1UL)         /*!< GPREG PLL_SYS_TEST_REG: PLL_DIS_LOOPFILT (Bitfield-Mask: 0x01) */
/* ===================================================  RESET_FREEZE_REG  ==================================================== */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM2_Pos (7UL)                 /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM2 (Bit 7)            */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM2_Msk (0x80UL)              /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM2 (Bitfield-Mask: 0x01) */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM1_Pos (6UL)                 /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM1 (Bit 6)            */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM1_Msk (0x40UL)              /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM1 (Bitfield-Mask: 0x01) */
#define GPREG_RESET_FREEZE_REG_FRZ_DMA_Pos (5UL)                    /*!< GPREG RESET_FREEZE_REG: FRZ_DMA (Bit 5)               */
#define GPREG_RESET_FREEZE_REG_FRZ_DMA_Msk (0x20UL)                 /*!< GPREG RESET_FREEZE_REG: FRZ_DMA (Bitfield-Mask: 0x01) */
#define GPREG_RESET_FREEZE_REG_FRZ_USB_Pos (4UL)                    /*!< GPREG RESET_FREEZE_REG: FRZ_USB (Bit 4)               */
#define GPREG_RESET_FREEZE_REG_FRZ_USB_Msk (0x10UL)                 /*!< GPREG RESET_FREEZE_REG: FRZ_USB (Bitfield-Mask: 0x01) */
#define GPREG_RESET_FREEZE_REG_FRZ_WDOG_Pos (3UL)                   /*!< GPREG RESET_FREEZE_REG: FRZ_WDOG (Bit 3)              */
#define GPREG_RESET_FREEZE_REG_FRZ_WDOG_Msk (0x8UL)                 /*!< GPREG RESET_FREEZE_REG: FRZ_WDOG (Bitfield-Mask: 0x01) */
#define GPREG_RESET_FREEZE_REG_FRZ_BLETIM_Pos (2UL)                 /*!< GPREG RESET_FREEZE_REG: FRZ_BLETIM (Bit 2)            */
#define GPREG_RESET_FREEZE_REG_FRZ_BLETIM_Msk (0x4UL)               /*!< GPREG RESET_FREEZE_REG: FRZ_BLETIM (Bitfield-Mask: 0x01) */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM0_Pos (1UL)                 /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM0 (Bit 1)            */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM0_Msk (0x2UL)               /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM0 (Bitfield-Mask: 0x01) */
#define GPREG_RESET_FREEZE_REG_FRZ_WKUPTIM_Pos (0UL)                /*!< GPREG RESET_FREEZE_REG: FRZ_WKUPTIM (Bit 0)           */
#define GPREG_RESET_FREEZE_REG_FRZ_WKUPTIM_Msk (0x1UL)              /*!< GPREG RESET_FREEZE_REG: FRZ_WKUPTIM (Bitfield-Mask: 0x01) */
/* ====================================================  SET_FREEZE_REG  ===================================================== */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM2_Pos (7UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM2 (Bit 7)              */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM2_Msk (0x80UL)                /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM2 (Bitfield-Mask: 0x01) */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM1_Pos (6UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM1 (Bit 6)              */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM1_Msk (0x40UL)                /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM1 (Bitfield-Mask: 0x01) */
#define GPREG_SET_FREEZE_REG_FRZ_DMA_Pos  (5UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_DMA (Bit 5)                 */
#define GPREG_SET_FREEZE_REG_FRZ_DMA_Msk  (0x20UL)                  /*!< GPREG SET_FREEZE_REG: FRZ_DMA (Bitfield-Mask: 0x01)   */
#define GPREG_SET_FREEZE_REG_FRZ_USB_Pos  (4UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_USB (Bit 4)                 */
#define GPREG_SET_FREEZE_REG_FRZ_USB_Msk  (0x10UL)                  /*!< GPREG SET_FREEZE_REG: FRZ_USB (Bitfield-Mask: 0x01)   */
#define GPREG_SET_FREEZE_REG_FRZ_WDOG_Pos (3UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_WDOG (Bit 3)                */
#define GPREG_SET_FREEZE_REG_FRZ_WDOG_Msk (0x8UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_WDOG (Bitfield-Mask: 0x01)  */
#define GPREG_SET_FREEZE_REG_FRZ_BLETIM_Pos (2UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_BLETIM (Bit 2)              */
#define GPREG_SET_FREEZE_REG_FRZ_BLETIM_Msk (0x4UL)                 /*!< GPREG SET_FREEZE_REG: FRZ_BLETIM (Bitfield-Mask: 0x01) */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM0_Pos (1UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM0 (Bit 1)              */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM0_Msk (0x2UL)                 /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM0 (Bitfield-Mask: 0x01) */
#define GPREG_SET_FREEZE_REG_FRZ_WKUPTIM_Pos (0UL)                  /*!< GPREG SET_FREEZE_REG: FRZ_WKUPTIM (Bit 0)             */
#define GPREG_SET_FREEZE_REG_FRZ_WKUPTIM_Msk (0x1UL)                /*!< GPREG SET_FREEZE_REG: FRZ_WKUPTIM (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

