S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ===============================================  I2C_ACK_GENERAL_CALL_REG  ================================================ */
#define I2C_I2C_ACK_GENERAL_CALL_REG_ACK_GEN_CALL_Pos (0UL)         /*!< I2C I2C_ACK_GENERAL_CALL_REG: ACK_GEN_CALL (Bit 0)    */
#define I2C_I2C_ACK_GENERAL_CALL_REG_ACK_GEN_CALL_Msk (0x1UL)       /*!< I2C I2C_ACK_GENERAL_CALL_REG: ACK_GEN_CALL (Bitfield-Mask: 0x01) */
/* =================================================  I2C_CLR_ACTIVITY_REG  ================================================== */
#define I2C_I2C_CLR_ACTIVITY_REG_CLR_ACTIVITY_Pos (0UL)             /*!< I2C I2C_CLR_ACTIVITY_REG: CLR_ACTIVITY (Bit 0)        */
#define I2C_I2C_CLR_ACTIVITY_REG_CLR_ACTIVITY_Msk (0x1UL)           /*!< I2C I2C_CLR_ACTIVITY_REG: CLR_ACTIVITY (Bitfield-Mask: 0x01) */
/* =================================================  I2C_CLR_GEN_CALL_REG  ================================================== */
#define I2C_I2C_CLR_GEN_CALL_REG_CLR_GEN_CALL_Pos (0UL)             /*!< I2C I2C_CLR_GEN_CALL_REG: CLR_GEN_CALL (Bit 0)        */
#define I2C_I2C_CLR_GEN_CALL_REG_CLR_GEN_CALL_Msk (0x1UL)           /*!< I2C I2C_CLR_GEN_CALL_REG: CLR_GEN_CALL (Bitfield-Mask: 0x01) */
/* ===================================================  I2C_CLR_INTR_REG  ==================================================== */
#define I2C_I2C_CLR_INTR_REG_CLR_INTR_Pos (0UL)                     /*!< I2C I2C_CLR_INTR_REG: CLR_INTR (Bit 0)                */
#define I2C_I2C_CLR_INTR_REG_CLR_INTR_Msk (0x1UL)                   /*!< I2C I2C_CLR_INTR_REG: CLR_INTR (Bitfield-Mask: 0x01)  */
/* ==================================================  I2C_CLR_RD_REQ_REG  =================================================== */
#define I2C_I2C_CLR_RD_REQ_REG_CLR_RD_REQ_Pos (0UL)                 /*!< I2C I2C_CLR_RD_REQ_REG: CLR_RD_REQ (Bit 0)            */
#define I2C_I2C_CLR_RD_REQ_REG_CLR_RD_REQ_Msk (0x1UL)               /*!< I2C I2C_CLR_RD_REQ_REG: CLR_RD_REQ (Bitfield-Mask: 0x01) */
/* ==================================================  I2C_CLR_RX_DONE_REG  ================================================== */
#define I2C_I2C_CLR_RX_DONE_REG_CLR_RX_DONE_Pos (0UL)               /*!< I2C I2C_CLR_RX_DONE_REG: CLR_RX_DONE (Bit 0)          */
#define I2C_I2C_CLR_RX_DONE_REG_CLR_RX_DONE_Msk (0x1UL)             /*!< I2C I2C_CLR_RX_DONE_REG: CLR_RX_DONE (Bitfield-Mask: 0x01) */
/* ==================================================  I2C_CLR_RX_OVER_REG  ================================================== */
#define I2C_I2C_CLR_RX_OVER_REG_CLR_RX_OVER_Pos (0UL)               /*!< I2C I2C_CLR_RX_OVER_REG: CLR_RX_OVER (Bit 0)          */
#define I2C_I2C_CLR_RX_OVER_REG_CLR_RX_OVER_Msk (0x1UL)             /*!< I2C I2C_CLR_RX_OVER_REG: CLR_RX_OVER (Bitfield-Mask: 0x01) */
/* =================================================  I2C_CLR_RX_UNDER_REG  ================================================== */
#define I2C_I2C_CLR_RX_UNDER_REG_CLR_RX_UNDER_Pos (0UL)             /*!< I2C I2C_CLR_RX_UNDER_REG: CLR_RX_UNDER (Bit 0)        */
#define I2C_I2C_CLR_RX_UNDER_REG_CLR_RX_UNDER_Msk (0x1UL)           /*!< I2C I2C_CLR_RX_UNDER_REG: CLR_RX_UNDER (Bitfield-Mask: 0x01) */
/* =================================================  I2C_CLR_START_DET_REG  ================================================= */
#define I2C_I2C_CLR_START_DET_REG_CLR_START_DET_Pos (0UL)           /*!< I2C I2C_CLR_START_DET_REG: CLR_START_DET (Bit 0)      */
#define I2C_I2C_CLR_START_DET_REG_CLR_START_DET_Msk (0x1UL)         /*!< I2C I2C_CLR_START_DET_REG: CLR_START_DET (Bitfield-Mask: 0x01) */
/* =================================================  I2C_CLR_STOP_DET_REG  ================================================== */
#define I2C_I2C_CLR_STOP_DET_REG_CLR_ACTIVITY_Pos (0UL)             /*!< I2C I2C_CLR_STOP_DET_REG: CLR_ACTIVITY (Bit 0)        */
#define I2C_I2C_CLR_STOP_DET_REG_CLR_ACTIVITY_Msk (0x1UL)           /*!< I2C I2C_CLR_STOP_DET_REG: CLR_ACTIVITY (Bitfield-Mask: 0x01) */
/* ==================================================  I2C_CLR_TX_ABRT_REG  ================================================== */
#define I2C_I2C_CLR_TX_ABRT_REG_CLR_TX_ABRT_Pos (0UL)               /*!< I2C I2C_CLR_TX_ABRT_REG: CLR_TX_ABRT (Bit 0)          */
#define I2C_I2C_CLR_TX_ABRT_REG_CLR_TX_ABRT_Msk (0x1UL)             /*!< I2C I2C_CLR_TX_ABRT_REG: CLR_TX_ABRT (Bitfield-Mask: 0x01) */
/* ==================================================  I2C_CLR_TX_OVER_REG  ================================================== */
#define I2C_I2C_CLR_TX_OVER_REG_CLR_TX_OVER_Pos (0UL)               /*!< I2C I2C_CLR_TX_OVER_REG: CLR_TX_OVER (Bit 0)          */
#define I2C_I2C_CLR_TX_OVER_REG_CLR_TX_OVER_Msk (0x1UL)             /*!< I2C I2C_CLR_TX_OVER_REG: CLR_TX_OVER (Bitfield-Mask: 0x01) */
/* ===================================================  I2C_COMP2_VERSION  =================================================== */
#define I2C_I2C_COMP2_VERSION_IC_COMP2_VERSION_Pos (0UL)            /*!< I2C I2C_COMP2_VERSION: IC_COMP2_VERSION (Bit 0)       */
#define I2C_I2C_COMP2_VERSION_IC_COMP2_VERSION_Msk (0xffffUL)       /*!< I2C I2C_COMP2_VERSION: IC_COMP2_VERSION (Bitfield-Mask: 0xffff) */
/* ==================================================  I2C_COMP_PARAM1_REG  ================================================== */
#define I2C_I2C_COMP_PARAM1_REG_IC_COMP_PARAM1_Pos (0UL)            /*!< I2C I2C_COMP_PARAM1_REG: IC_COMP_PARAM1 (Bit 0)       */
#define I2C_I2C_COMP_PARAM1_REG_IC_COMP_PARAM1_Msk (0xffffUL)       /*!< I2C I2C_COMP_PARAM1_REG: IC_COMP_PARAM1 (Bitfield-Mask: 0xffff) */
/* ==================================================  I2C_COMP_PARAM2_REG  ================================================== */
#define I2C_I2C_COMP_PARAM2_REG_IC_COMP_PARAM2_Pos (0UL)            /*!< I2C I2C_COMP_PARAM2_REG: IC_COMP_PARAM2 (Bit 0)       */
#define I2C_I2C_COMP_PARAM2_REG_IC_COMP_PARAM2_Msk (0xffffUL)       /*!< I2C I2C_COMP_PARAM2_REG: IC_COMP_PARAM2 (Bitfield-Mask: 0xffff) */
/* ==================================================  I2C_COMP_TYPE2_REG  =================================================== */
#define I2C_I2C_COMP_TYPE2_REG_IC_COMP2_TYPE_Pos (0UL)              /*!< I2C I2C_COMP_TYPE2_REG: IC_COMP2_TYPE (Bit 0)         */
#define I2C_I2C_COMP_TYPE2_REG_IC_COMP2_TYPE_Msk (0xffffUL)         /*!< I2C I2C_COMP_TYPE2_REG: IC_COMP2_TYPE (Bitfield-Mask: 0xffff) */
/* ===================================================  I2C_COMP_TYPE_REG  =================================================== */
#define I2C_I2C_COMP_TYPE_REG_IC_COMP_TYPE_Pos (0UL)                /*!< I2C I2C_COMP_TYPE_REG: IC_COMP_TYPE (Bit 0)           */
#define I2C_I2C_COMP_TYPE_REG_IC_COMP_TYPE_Msk (0xffffUL)           /*!< I2C I2C_COMP_TYPE_REG: IC_COMP_TYPE (Bitfield-Mask: 0xffff) */
/* =================================================  I2C_COMP_VERSION_REG  ================================================== */
#define I2C_I2C_COMP_VERSION_REG_IC_COMP_VERSION_Pos (0UL)          /*!< I2C I2C_COMP_VERSION_REG: IC_COMP_VERSION (Bit 0)     */
#define I2C_I2C_COMP_VERSION_REG_IC_COMP_VERSION_Msk (0xffffUL)     /*!< I2C I2C_COMP_VERSION_REG: IC_COMP_VERSION (Bitfield-Mask: 0xffff) */
/* ======================================================  I2C_CON_REG  ====================================================== */
#define I2C_I2C_CON_REG_I2C_SLAVE_DISABLE_Pos (6UL)                 /*!< I2C I2C_CON_REG: I2C_SLAVE_DISABLE (Bit 6)            */
#define I2C_I2C_CON_REG_I2C_SLAVE_DISABLE_Msk (0x40UL)              /*!< I2C I2C_CON_REG: I2C_SLAVE_DISABLE (Bitfield-Mask: 0x01) */
#define I2C_I2C_CON_REG_I2C_RESTART_EN_Pos (5UL)                    /*!< I2C I2C_CON_REG: I2C_RESTART_EN (Bit 5)               */
#define I2C_I2C_CON_REG_I2C_RESTART_EN_Msk (0x20UL)                 /*!< I2C I2C_CON_REG: I2C_RESTART_EN (Bitfield-Mask: 0x01) */
#define I2C_I2C_CON_REG_I2C_10BITADDR_MASTER_Pos (4UL)              /*!< I2C I2C_CON_REG: I2C_10BITADDR_MASTER (Bit 4)         */
#define I2C_I2C_CON_REG_I2C_10BITADDR_MASTER_Msk (0x10UL)           /*!< I2C I2C_CON_REG: I2C_10BITADDR_MASTER (Bitfield-Mask: 0x01) */
#define I2C_I2C_CON_REG_I2C_10BITADDR_SLAVE_Pos (3UL)               /*!< I2C I2C_CON_REG: I2C_10BITADDR_SLAVE (Bit 3)          */
#define I2C_I2C_CON_REG_I2C_10BITADDR_SLAVE_Msk (0x8UL)             /*!< I2C I2C_CON_REG: I2C_10BITADDR_SLAVE (Bitfield-Mask: 0x01) */
#define I2C_I2C_CON_REG_I2C_SPEED_Pos     (1UL)                     /*!< I2C I2C_CON_REG: I2C_SPEED (Bit 1)                    */
#define I2C_I2C_CON_REG_I2C_SPEED_Msk     (0x6UL)                   /*!< I2C I2C_CON_REG: I2C_SPEED (Bitfield-Mask: 0x03)      */
#define I2C_I2C_CON_REG_I2C_MASTER_MODE_Pos (0UL)                   /*!< I2C I2C_CON_REG: I2C_MASTER_MODE (Bit 0)              */
#define I2C_I2C_CON_REG_I2C_MASTER_MODE_Msk (0x1UL)                 /*!< I2C I2C_CON_REG: I2C_MASTER_MODE (Bitfield-Mask: 0x01) */
/* ===================================================  I2C_DATA_CMD_REG  ==================================================== */
#define I2C_I2C_DATA_CMD_REG_CMD_Pos      (8UL)                     /*!< I2C I2C_DATA_CMD_REG: CMD (Bit 8)                     */
#define I2C_I2C_DATA_CMD_REG_CMD_Msk      (0x100UL)                 /*!< I2C I2C_DATA_CMD_REG: CMD (Bitfield-Mask: 0x01)       */
#define I2C_I2C_DATA_CMD_REG_DAT_Pos      (0UL)                     /*!< I2C I2C_DATA_CMD_REG: DAT (Bit 0)                     */
#define I2C_I2C_DATA_CMD_REG_DAT_Msk      (0xffUL)                  /*!< I2C I2C_DATA_CMD_REG: DAT (Bitfield-Mask: 0xff)       */
/* ====================================================  I2C_DMA_CR_REG  ===================================================== */
#define I2C_I2C_DMA_CR_REG_TDMAE_Pos      (1UL)                     /*!< I2C I2C_DMA_CR_REG: TDMAE (Bit 1)                     */
#define I2C_I2C_DMA_CR_REG_TDMAE_Msk      (0x2UL)                   /*!< I2C I2C_DMA_CR_REG: TDMAE (Bitfield-Mask: 0x01)       */
#define I2C_I2C_DMA_CR_REG_RDMAE_Pos      (0UL)                     /*!< I2C I2C_DMA_CR_REG: RDMAE (Bit 0)                     */
#define I2C_I2C_DMA_CR_REG_RDMAE_Msk      (0x1UL)                   /*!< I2C I2C_DMA_CR_REG: RDMAE (Bitfield-Mask: 0x01)       */
/* ===================================================  I2C_DMA_RDLR_REG  ==================================================== */
#define I2C_I2C_DMA_RDLR_REG_DMARDL_Pos   (0UL)                     /*!< I2C I2C_DMA_RDLR_REG: DMARDL (Bit 0)                  */
#define I2C_I2C_DMA_RDLR_REG_DMARDL_Msk   (0x1fUL)                  /*!< I2C I2C_DMA_RDLR_REG: DMARDL (Bitfield-Mask: 0x1f)    */
/* ===================================================  I2C_DMA_TDLR_REG  ==================================================== */
#define I2C_I2C_DMA_TDLR_REG_DMATDL_Pos   (0UL)                     /*!< I2C I2C_DMA_TDLR_REG: DMATDL (Bit 0)                  */
#define I2C_I2C_DMA_TDLR_REG_DMATDL_Msk   (0x1fUL)                  /*!< I2C I2C_DMA_TDLR_REG: DMATDL (Bitfield-Mask: 0x1f)    */
/* ====================================================  I2C_ENABLE_REG  ===================================================== */
#define I2C_I2C_ENABLE_REG_CTRL_ENABLE_Pos (0UL)                    /*!< I2C I2C_ENABLE_REG: CTRL_ENABLE (Bit 0)               */
#define I2C_I2C_ENABLE_REG_CTRL_ENABLE_Msk (0x1UL)                  /*!< I2C I2C_ENABLE_REG: CTRL_ENABLE (Bitfield-Mask: 0x01) */
/* =================================================  I2C_ENABLE_STATUS_REG  ================================================= */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_RX_DATA_LOST_Pos (2UL)        /*!< I2C I2C_ENABLE_STATUS_REG: SLV_RX_DATA_LOST (Bit 2)   */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_RX_DATA_LOST_Msk (0x4UL)      /*!< I2C I2C_ENABLE_STATUS_REG: SLV_RX_DATA_LOST (Bitfield-Mask: 0x01) */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_DISABLED_WHILE_BUSY_Pos (1UL) /*!< I2C I2C_ENABLE_STATUS_REG: SLV_DISABLED_WHILE_BUSY (Bit 1) */
#define I2C_I2C_ENABLE_STATUS_REG_SLV_DISABLED_WHILE_BUSY_Msk (0x2UL) /*!< I2C I2C_ENABLE_STATUS_REG: SLV_DISABLED_WHILE_BUSY (Bitfield-Mask: 0x01) */
#define I2C_I2C_ENABLE_STATUS_REG_IC_EN_Pos (0UL)                   /*!< I2C I2C_ENABLE_STATUS_REG: IC_EN (Bit 0)              */
#define I2C_I2C_ENABLE_STATUS_REG_IC_EN_Msk (0x1UL)                 /*!< I2C I2C_ENABLE_STATUS_REG: IC_EN (Bitfield-Mask: 0x01) */
/* ==================================================  I2C_FS_SCL_HCNT_REG  ================================================== */
#define I2C_I2C_FS_SCL_HCNT_REG_IC_FS_SCL_HCNT_Pos (0UL)            /*!< I2C I2C_FS_SCL_HCNT_REG: IC_FS_SCL_HCNT (Bit 0)       */
#define I2C_I2C_FS_SCL_HCNT_REG_IC_FS_SCL_HCNT_Msk (0xffffUL)       /*!< I2C I2C_FS_SCL_HCNT_REG: IC_FS_SCL_HCNT (Bitfield-Mask: 0xffff) */
/* ==================================================  I2C_FS_SCL_LCNT_REG  ================================================== */
#define I2C_I2C_FS_SCL_LCNT_REG_IC_FS_SCL_LCNT_Pos (0UL)            /*!< I2C I2C_FS_SCL_LCNT_REG: IC_FS_SCL_LCNT (Bit 0)       */
#define I2C_I2C_FS_SCL_LCNT_REG_IC_FS_SCL_LCNT_Msk (0xffffUL)       /*!< I2C I2C_FS_SCL_LCNT_REG: IC_FS_SCL_LCNT (Bitfield-Mask: 0xffff) */
/* ===================================================  I2C_HS_MADDR_REG  ==================================================== */
#define I2C_I2C_HS_MADDR_REG_IIC_HS_MAR_Pos (0UL)                   /*!< I2C I2C_HS_MADDR_REG: IIC_HS_MAR (Bit 0)              */
#define I2C_I2C_HS_MADDR_REG_IIC_HS_MAR_Msk (0x7UL)                 /*!< I2C I2C_HS_MADDR_REG: IIC_HS_MAR (Bitfield-Mask: 0x07) */
/* =================================================  I2C_IC_FS_SPKLEN_REG  ================================================== */
#define I2C_I2C_IC_FS_SPKLEN_REG_IC_FS_SPKLEN_Pos (0UL)             /*!< I2C I2C_IC_FS_SPKLEN_REG: IC_FS_SPKLEN (Bit 0)        */
#define I2C_I2C_IC_FS_SPKLEN_REG_IC_FS_SPKLEN_Msk (0xffUL)          /*!< I2C I2C_IC_FS_SPKLEN_REG: IC_FS_SPKLEN (Bitfield-Mask: 0xff) */
/* ===================================================  I2C_INTR_MASK_REG  =================================================== */
#define I2C_I2C_INTR_MASK_REG_M_GEN_CALL_Pos (11UL)                 /*!< I2C I2C_INTR_MASK_REG: M_GEN_CALL (Bit 11)            */
#define I2C_I2C_INTR_MASK_REG_M_GEN_CALL_Msk (0x800UL)              /*!< I2C I2C_INTR_MASK_REG: M_GEN_CALL (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_START_DET_Pos (10UL)                /*!< I2C I2C_INTR_MASK_REG: M_START_DET (Bit 10)           */
#define I2C_I2C_INTR_MASK_REG_M_START_DET_Msk (0x400UL)             /*!< I2C I2C_INTR_MASK_REG: M_START_DET (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_STOP_DET_Pos (9UL)                  /*!< I2C I2C_INTR_MASK_REG: M_STOP_DET (Bit 9)             */
#define I2C_I2C_INTR_MASK_REG_M_STOP_DET_Msk (0x200UL)              /*!< I2C I2C_INTR_MASK_REG: M_STOP_DET (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_ACTIVITY_Pos (8UL)                  /*!< I2C I2C_INTR_MASK_REG: M_ACTIVITY (Bit 8)             */
#define I2C_I2C_INTR_MASK_REG_M_ACTIVITY_Msk (0x100UL)              /*!< I2C I2C_INTR_MASK_REG: M_ACTIVITY (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_RX_DONE_Pos (7UL)                   /*!< I2C I2C_INTR_MASK_REG: M_RX_DONE (Bit 7)              */
#define I2C_I2C_INTR_MASK_REG_M_RX_DONE_Msk (0x80UL)                /*!< I2C I2C_INTR_MASK_REG: M_RX_DONE (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_TX_ABRT_Pos (6UL)                   /*!< I2C I2C_INTR_MASK_REG: M_TX_ABRT (Bit 6)              */
#define I2C_I2C_INTR_MASK_REG_M_TX_ABRT_Msk (0x40UL)                /*!< I2C I2C_INTR_MASK_REG: M_TX_ABRT (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_RD_REQ_Pos (5UL)                    /*!< I2C I2C_INTR_MASK_REG: M_RD_REQ (Bit 5)               */
#define I2C_I2C_INTR_MASK_REG_M_RD_REQ_Msk (0x20UL)                 /*!< I2C I2C_INTR_MASK_REG: M_RD_REQ (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_TX_EMPTY_Pos (4UL)                  /*!< I2C I2C_INTR_MASK_REG: M_TX_EMPTY (Bit 4)             */
#define I2C_I2C_INTR_MASK_REG_M_TX_EMPTY_Msk (0x10UL)               /*!< I2C I2C_INTR_MASK_REG: M_TX_EMPTY (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_TX_OVER_Pos (3UL)                   /*!< I2C I2C_INTR_MASK_REG: M_TX_OVER (Bit 3)              */
#define I2C_I2C_INTR_MASK_REG_M_TX_OVER_Msk (0x8UL)                 /*!< I2C I2C_INTR_MASK_REG: M_TX_OVER (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_RX_FULL_Pos (2UL)                   /*!< I2C I2C_INTR_MASK_REG: M_RX_FULL (Bit 2)              */
#define I2C_I2C_INTR_MASK_REG_M_RX_FULL_Msk (0x4UL)                 /*!< I2C I2C_INTR_MASK_REG: M_RX_FULL (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_RX_OVER_Pos (1UL)                   /*!< I2C I2C_INTR_MASK_REG: M_RX_OVER (Bit 1)              */
#define I2C_I2C_INTR_MASK_REG_M_RX_OVER_Msk (0x2UL)                 /*!< I2C I2C_INTR_MASK_REG: M_RX_OVER (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_MASK_REG_M_RX_UNDER_Pos (0UL)                  /*!< I2C I2C_INTR_MASK_REG: M_RX_UNDER (Bit 0)             */
#define I2C_I2C_INTR_MASK_REG_M_RX_UNDER_Msk (0x1UL)                /*!< I2C I2C_INTR_MASK_REG: M_RX_UNDER (Bitfield-Mask: 0x01) */
/* ===================================================  I2C_INTR_STAT_REG  =================================================== */
#define I2C_I2C_INTR_STAT_REG_R_GEN_CALL_Pos (11UL)                 /*!< I2C I2C_INTR_STAT_REG: R_GEN_CALL (Bit 11)            */
#define I2C_I2C_INTR_STAT_REG_R_GEN_CALL_Msk (0x800UL)              /*!< I2C I2C_INTR_STAT_REG: R_GEN_CALL (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_START_DET_Pos (10UL)                /*!< I2C I2C_INTR_STAT_REG: R_START_DET (Bit 10)           */
#define I2C_I2C_INTR_STAT_REG_R_START_DET_Msk (0x400UL)             /*!< I2C I2C_INTR_STAT_REG: R_START_DET (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_STOP_DET_Pos (9UL)                  /*!< I2C I2C_INTR_STAT_REG: R_STOP_DET (Bit 9)             */
#define I2C_I2C_INTR_STAT_REG_R_STOP_DET_Msk (0x200UL)              /*!< I2C I2C_INTR_STAT_REG: R_STOP_DET (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_ACTIVITY_Pos (8UL)                  /*!< I2C I2C_INTR_STAT_REG: R_ACTIVITY (Bit 8)             */
#define I2C_I2C_INTR_STAT_REG_R_ACTIVITY_Msk (0x100UL)              /*!< I2C I2C_INTR_STAT_REG: R_ACTIVITY (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_RX_DONE_Pos (7UL)                   /*!< I2C I2C_INTR_STAT_REG: R_RX_DONE (Bit 7)              */
#define I2C_I2C_INTR_STAT_REG_R_RX_DONE_Msk (0x80UL)                /*!< I2C I2C_INTR_STAT_REG: R_RX_DONE (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_TX_ABRT_Pos (6UL)                   /*!< I2C I2C_INTR_STAT_REG: R_TX_ABRT (Bit 6)              */
#define I2C_I2C_INTR_STAT_REG_R_TX_ABRT_Msk (0x40UL)                /*!< I2C I2C_INTR_STAT_REG: R_TX_ABRT (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_RD_REQ_Pos (5UL)                    /*!< I2C I2C_INTR_STAT_REG: R_RD_REQ (Bit 5)               */
#define I2C_I2C_INTR_STAT_REG_R_RD_REQ_Msk (0x20UL)                 /*!< I2C I2C_INTR_STAT_REG: R_RD_REQ (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_TX_EMPTY_Pos (4UL)                  /*!< I2C I2C_INTR_STAT_REG: R_TX_EMPTY (Bit 4)             */
#define I2C_I2C_INTR_STAT_REG_R_TX_EMPTY_Msk (0x10UL)               /*!< I2C I2C_INTR_STAT_REG: R_TX_EMPTY (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_TX_OVER_Pos (3UL)                   /*!< I2C I2C_INTR_STAT_REG: R_TX_OVER (Bit 3)              */
#define I2C_I2C_INTR_STAT_REG_R_TX_OVER_Msk (0x8UL)                 /*!< I2C I2C_INTR_STAT_REG: R_TX_OVER (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_RX_FULL_Pos (2UL)                   /*!< I2C I2C_INTR_STAT_REG: R_RX_FULL (Bit 2)              */
#define I2C_I2C_INTR_STAT_REG_R_RX_FULL_Msk (0x4UL)                 /*!< I2C I2C_INTR_STAT_REG: R_RX_FULL (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_RX_OVER_Pos (1UL)                   /*!< I2C I2C_INTR_STAT_REG: R_RX_OVER (Bit 1)              */
#define I2C_I2C_INTR_STAT_REG_R_RX_OVER_Msk (0x2UL)                 /*!< I2C I2C_INTR_STAT_REG: R_RX_OVER (Bitfield-Mask: 0x01) */
#define I2C_I2C_INTR_STAT_REG_R_RX_UNDER_Pos (0UL)                  /*!< I2C I2C_INTR_STAT_REG: R_RX_UNDER (Bit 0)             */
#define I2C_I2C_INTR_STAT_REG_R_RX_UNDER_Msk (0x1UL)                /*!< I2C I2C_INTR_STAT_REG: R_RX_UNDER (Bitfield-Mask: 0x01) */
/* =================================================  I2C_RAW_INTR_STAT_REG  ================================================= */
#define I2C_I2C_RAW_INTR_STAT_REG_GEN_CALL_Pos (11UL)               /*!< I2C I2C_RAW_INTR_STAT_REG: GEN_CALL (Bit 11)          */
#define I2C_I2C_RAW_INTR_STAT_REG_GEN_CALL_Msk (0x800UL)            /*!< I2C I2C_RAW_INTR_STAT_REG: GEN_CALL (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_START_DET_Pos (10UL)              /*!< I2C I2C_RAW_INTR_STAT_REG: START_DET (Bit 10)         */
#define I2C_I2C_RAW_INTR_STAT_REG_START_DET_Msk (0x400UL)           /*!< I2C I2C_RAW_INTR_STAT_REG: START_DET (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_STOP_DET_Pos (9UL)                /*!< I2C I2C_RAW_INTR_STAT_REG: STOP_DET (Bit 9)           */
#define I2C_I2C_RAW_INTR_STAT_REG_STOP_DET_Msk (0x200UL)            /*!< I2C I2C_RAW_INTR_STAT_REG: STOP_DET (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_ACTIVITY_Pos (8UL)                /*!< I2C I2C_RAW_INTR_STAT_REG: ACTIVITY (Bit 8)           */
#define I2C_I2C_RAW_INTR_STAT_REG_ACTIVITY_Msk (0x100UL)            /*!< I2C I2C_RAW_INTR_STAT_REG: ACTIVITY (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_DONE_Pos (7UL)                 /*!< I2C I2C_RAW_INTR_STAT_REG: RX_DONE (Bit 7)            */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_DONE_Msk (0x80UL)              /*!< I2C I2C_RAW_INTR_STAT_REG: RX_DONE (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_ABRT_Pos (6UL)                 /*!< I2C I2C_RAW_INTR_STAT_REG: TX_ABRT (Bit 6)            */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_ABRT_Msk (0x40UL)              /*!< I2C I2C_RAW_INTR_STAT_REG: TX_ABRT (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_RD_REQ_Pos (5UL)                  /*!< I2C I2C_RAW_INTR_STAT_REG: RD_REQ (Bit 5)             */
#define I2C_I2C_RAW_INTR_STAT_REG_RD_REQ_Msk (0x20UL)               /*!< I2C I2C_RAW_INTR_STAT_REG: RD_REQ (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_EMPTY_Pos (4UL)                /*!< I2C I2C_RAW_INTR_STAT_REG: TX_EMPTY (Bit 4)           */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_EMPTY_Msk (0x10UL)             /*!< I2C I2C_RAW_INTR_STAT_REG: TX_EMPTY (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_OVER_Pos (3UL)                 /*!< I2C I2C_RAW_INTR_STAT_REG: TX_OVER (Bit 3)            */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_OVER_Msk (0x8UL)               /*!< I2C I2C_RAW_INTR_STAT_REG: TX_OVER (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_FULL_Pos (2UL)                 /*!< I2C I2C_RAW_INTR_STAT_REG: RX_FULL (Bit 2)            */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_FULL_Msk (0x4UL)               /*!< I2C I2C_RAW_INTR_STAT_REG: RX_FULL (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_OVER_Pos (1UL)                 /*!< I2C I2C_RAW_INTR_STAT_REG: RX_OVER (Bit 1)            */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_OVER_Msk (0x2UL)               /*!< I2C I2C_RAW_INTR_STAT_REG: RX_OVER (Bitfield-Mask: 0x01) */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_UNDER_Pos (0UL)                /*!< I2C I2C_RAW_INTR_STAT_REG: RX_UNDER (Bit 0)           */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_UNDER_Msk (0x1UL)              /*!< I2C I2C_RAW_INTR_STAT_REG: RX_UNDER (Bitfield-Mask: 0x01) */
/* =====================================================  I2C_RXFLR_REG  ===================================================== */
#define I2C_I2C_RXFLR_REG_RXFLR_Pos       (0UL)                     /*!< I2C I2C_RXFLR_REG: RXFLR (Bit 0)                      */
