S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ======================================================  IR_CTRL_REG  ====================================================== */
#define IR_IR_CTRL_REG_IR_IRQ_EN_Pos      (8UL)                     /*!< IR IR_CTRL_REG: IR_IRQ_EN (Bit 8)                     */
#define IR_IR_CTRL_REG_IR_IRQ_EN_Msk      (0x100UL)                 /*!< IR IR_CTRL_REG: IR_IRQ_EN (Bitfield-Mask: 0x01)       */
#define IR_IR_CTRL_REG_IR_LOGIC_ONE_FORMAT_Pos (7UL)                /*!< IR IR_CTRL_REG: IR_LOGIC_ONE_FORMAT (Bit 7)           */
#define IR_IR_CTRL_REG_IR_LOGIC_ONE_FORMAT_Msk (0x80UL)             /*!< IR IR_CTRL_REG: IR_LOGIC_ONE_FORMAT (Bitfield-Mask: 0x01) */
#define IR_IR_CTRL_REG_IR_LOGIC_ZERO_FORMAT_Pos (6UL)               /*!< IR IR_CTRL_REG: IR_LOGIC_ZERO_FORMAT (Bit 6)          */
#define IR_IR_CTRL_REG_IR_LOGIC_ZERO_FORMAT_Msk (0x40UL)            /*!< IR IR_CTRL_REG: IR_LOGIC_ZERO_FORMAT (Bitfield-Mask: 0x01) */
#define IR_IR_CTRL_REG_IR_INVERT_OUTPUT_Pos (5UL)                   /*!< IR IR_CTRL_REG: IR_INVERT_OUTPUT (Bit 5)              */
#define IR_IR_CTRL_REG_IR_INVERT_OUTPUT_Msk (0x20UL)                /*!< IR IR_CTRL_REG: IR_INVERT_OUTPUT (Bitfield-Mask: 0x01) */
#define IR_IR_CTRL_REG_IR_REPEAT_TYPE_Pos (4UL)                     /*!< IR IR_CTRL_REG: IR_REPEAT_TYPE (Bit 4)                */
#define IR_IR_CTRL_REG_IR_REPEAT_TYPE_Msk (0x10UL)                  /*!< IR IR_CTRL_REG: IR_REPEAT_TYPE (Bitfield-Mask: 0x01)  */
#define IR_IR_CTRL_REG_IR_TX_START_Pos    (3UL)                     /*!< IR IR_CTRL_REG: IR_TX_START (Bit 3)                   */
#define IR_IR_CTRL_REG_IR_TX_START_Msk    (0x8UL)                   /*!< IR IR_CTRL_REG: IR_TX_START (Bitfield-Mask: 0x01)     */
#define IR_IR_CTRL_REG_IR_ENABLE_Pos      (2UL)                     /*!< IR IR_CTRL_REG: IR_ENABLE (Bit 2)                     */
#define IR_IR_CTRL_REG_IR_ENABLE_Msk      (0x4UL)                   /*!< IR IR_CTRL_REG: IR_ENABLE (Bitfield-Mask: 0x01)       */
#define IR_IR_CTRL_REG_IR_REP_FIFO_RESET_Pos (1UL)                  /*!< IR IR_CTRL_REG: IR_REP_FIFO_RESET (Bit 1)             */
#define IR_IR_CTRL_REG_IR_REP_FIFO_RESET_Msk (0x2UL)                /*!< IR IR_CTRL_REG: IR_REP_FIFO_RESET (Bitfield-Mask: 0x01) */
#define IR_IR_CTRL_REG_IR_CODE_FIFO_RESET_Pos (0UL)                 /*!< IR IR_CTRL_REG: IR_CODE_FIFO_RESET (Bit 0)            */
#define IR_IR_CTRL_REG_IR_CODE_FIFO_RESET_Msk (0x1UL)               /*!< IR IR_CTRL_REG: IR_CODE_FIFO_RESET (Bitfield-Mask: 0x01) */
/* ================================================  IR_FREQ_CARRIER_OFF_REG  ================================================ */
#define IR_IR_FREQ_CARRIER_OFF_REG_IR_FREQ_CARRIER_OFF_Pos (0UL)    /*!< IR IR_FREQ_CARRIER_OFF_REG: IR_FREQ_CARRIER_OFF (Bit 0) */
#define IR_IR_FREQ_CARRIER_OFF_REG_IR_FREQ_CARRIER_OFF_Msk (0x3ffUL) /*!< IR IR_FREQ_CARRIER_OFF_REG: IR_FREQ_CARRIER_OFF (Bitfield-Mask: 0x3ff) */
/* ================================================  IR_FREQ_CARRIER_ON_REG  ================================================= */
#define IR_IR_FREQ_CARRIER_ON_REG_IR_FREQ_CARRIER_ON_Pos (0UL)      /*!< IR IR_FREQ_CARRIER_ON_REG: IR_FREQ_CARRIER_ON (Bit 0) */
#define IR_IR_FREQ_CARRIER_ON_REG_IR_FREQ_CARRIER_ON_Msk (0x3ffUL)  /*!< IR IR_FREQ_CARRIER_ON_REG: IR_FREQ_CARRIER_ON (Bitfield-Mask: 0x3ff) */
/* ===================================================  IR_IRQ_STATUS_REG  =================================================== */
#define IR_IR_IRQ_STATUS_REG_IR_IRQ_ACK_Pos (0UL)                   /*!< IR IR_IRQ_STATUS_REG: IR_IRQ_ACK (Bit 0)              */
#define IR_IR_IRQ_STATUS_REG_IR_IRQ_ACK_Msk (0x1UL)                 /*!< IR IR_IRQ_STATUS_REG: IR_IRQ_ACK (Bitfield-Mask: 0x01) */
/* =================================================  IR_LOGIC_ONE_TIME_REG  ================================================= */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_MARK_Pos (8UL)        /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_MARK (Bit 8)   */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_MARK_Msk (0xff00UL)   /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_MARK (Bitfield-Mask: 0xff) */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_SPACE_Pos (0UL)       /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_SPACE (Bit 0)  */
#define IR_IR_LOGIC_ONE_TIME_REG_IR_LOGIC_ONE_SPACE_Msk (0xffUL)    /*!< IR IR_LOGIC_ONE_TIME_REG: IR_LOGIC_ONE_SPACE (Bitfield-Mask: 0xff) */
/* ================================================  IR_LOGIC_ZERO_TIME_REG  ================================================= */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_MARK_Pos (8UL)      /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_MARK (Bit 8) */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_MARK_Msk (0xff00UL) /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_MARK (Bitfield-Mask: 0xff) */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_SPACE_Pos (0UL)     /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_SPACE (Bit 0) */
#define IR_IR_LOGIC_ZERO_TIME_REG_IR_LOGIC_ZERO_SPACE_Msk (0xffUL)  /*!< IR IR_LOGIC_ZERO_TIME_REG: IR_LOGIC_ZERO_SPACE (Bitfield-Mask: 0xff) */
/* ===================================================  IR_MAIN_FIFO_REG  ==================================================== */
#define IR_IR_MAIN_FIFO_REG_IR_CODE_FIFO_DATA_Pos (0UL)             /*!< IR IR_MAIN_FIFO_REG: IR_CODE_FIFO_DATA (Bit 0)        */
#define IR_IR_MAIN_FIFO_REG_IR_CODE_FIFO_DATA_Msk (0xffffUL)        /*!< IR IR_MAIN_FIFO_REG: IR_CODE_FIFO_DATA (Bitfield-Mask: 0xffff) */
/* ==================================================  IR_REPEAT_FIFO_REG  =================================================== */
#define IR_IR_REPEAT_FIFO_REG_IR_REPEAT_FIFO_DATA_Pos (0UL)         /*!< IR IR_REPEAT_FIFO_REG: IR_REPEAT_FIFO_DATA (Bit 0)    */
#define IR_IR_REPEAT_FIFO_REG_IR_REPEAT_FIFO_DATA_Msk (0xffffUL)    /*!< IR IR_REPEAT_FIFO_REG: IR_REPEAT_FIFO_DATA (Bitfield-Mask: 0xffff) */
/* ==================================================  IR_REPEAT_TIME_REG  =================================================== */
#define IR_IR_REPEAT_TIME_REG_IR_REPEAT_TIME_Pos (0UL)              /*!< IR IR_REPEAT_TIME_REG: IR_REPEAT_TIME (Bit 0)         */
#define IR_IR_REPEAT_TIME_REG_IR_REPEAT_TIME_Msk (0xffffUL)         /*!< IR IR_REPEAT_TIME_REG: IR_REPEAT_TIME (Bitfield-Mask: 0xffff) */
/* =====================================================  IR_STATUS_REG  ===================================================== */
#define IR_IR_STATUS_REG_IR_BUSY_Pos      (10UL)                    /*!< IR IR_STATUS_REG: IR_BUSY (Bit 10)                    */
#define IR_IR_STATUS_REG_IR_BUSY_Msk      (0x400UL)                 /*!< IR IR_STATUS_REG: IR_BUSY (Bitfield-Mask: 0x01)       */
#define IR_IR_STATUS_REG_IR_REP_FIFO_WRDS_Pos (6UL)                 /*!< IR IR_STATUS_REG: IR_REP_FIFO_WRDS (Bit 6)            */
#define IR_IR_STATUS_REG_IR_REP_FIFO_WRDS_Msk (0x3c0UL)             /*!< IR IR_STATUS_REG: IR_REP_FIFO_WRDS (Bitfield-Mask: 0x0f) */
#define IR_IR_STATUS_REG_IR_CODE_FIFO_WRDS_Pos (0UL)                /*!< IR IR_STATUS_REG: IR_CODE_FIFO_WRDS (Bit 0)           */
#define IR_IR_STATUS_REG_IR_CODE_FIFO_WRDS_Msk (0x3fUL)             /*!< IR IR_STATUS_REG: IR_CODE_FIFO_WRDS (Bitfield-Mask: 0x3f) */


/* =========================================================================================================================== */
/* ================                                          KBSCAN                                           ================ */
/* =========================================================================================================================== */

