S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ====================================================  KBSCN_CTRL2_REG  ==================================================== */
#define KBSCAN_KBSCN_CTRL2_REG_KBSCN_ROW_ACTIVE_TIME_Pos (0UL)      /*!< KBSCAN KBSCN_CTRL2_REG: KBSCN_ROW_ACTIVE_TIME (Bit 0) */
#define KBSCAN_KBSCN_CTRL2_REG_KBSCN_ROW_ACTIVE_TIME_Msk (0xffffUL) /*!< KBSCAN KBSCN_CTRL2_REG: KBSCN_ROW_ACTIVE_TIME (Bitfield-Mask: 0xffff) */
/* ====================================================  KBSCN_CTRL_REG  ===================================================== */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_RESET_FIFO_Pos (14UL)           /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_RESET_FIFO (Bit 14)      */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_RESET_FIFO_Msk (0x4000UL)       /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_RESET_FIFO (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_CLKDIV_Pos (12UL)               /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_CLKDIV (Bit 12)          */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_CLKDIV_Msk (0x3000UL)           /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_CLKDIV (Bitfield-Mask: 0x03) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_EN_Pos (11UL)          /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_EN (Bit 11)     */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_EN_Msk (0x800UL)       /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_TIME_Pos (4UL)         /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_TIME (Bit 4)    */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_TIME_Msk (0x7f0UL)     /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_TIME (Bitfield-Mask: 0x7f) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_FIFO_MASK_Pos (3UL)         /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_FIFO_MASK (Bit 3)    */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_FIFO_MASK_Msk (0x8UL)       /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_FIFO_MASK (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_INACTIVE_MASK_Pos (2UL)     /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_INACTIVE_MASK (Bit 2) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_INACTIVE_MASK_Msk (0x4UL)   /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_INACTIVE_MASK (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_MESSAGE_MASK_Pos (1UL)      /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_MESSAGE_MASK (Bit 1) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_MESSAGE_MASK_Msk (0x2UL)    /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_MESSAGE_MASK (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_EN_Pos (0UL)                    /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_EN (Bit 0)               */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_EN_Msk (0x1UL)                  /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_EN (Bitfield-Mask: 0x01) */
/* ==================================================  KBSCN_DEBOUNCE_REG  =================================================== */
#define KBSCAN_KBSCN_DEBOUNCE_REG_KBSCN_DEBOUNCE_PRESS_TIME_Pos (6UL) /*!< KBSCAN KBSCN_DEBOUNCE_REG: KBSCN_DEBOUNCE_PRESS_TIME (Bit 6) */
#define KBSCAN_KBSCN_DEBOUNCE_REG_KBSCN_DEBOUNCE_PRESS_TIME_Msk (0xfc0UL) /*!< KBSCAN KBSCN_DEBOUNCE_REG: KBSCN_DEBOUNCE_PRESS_TIME (Bitfield-Mask: 0x3f) */
#define KBSCAN_KBSCN_DEBOUNCE_REG_KBSCN_DEBOUNCE_RELEASE_TIME_Pos (0UL) /*!< KBSCAN KBSCN_DEBOUNCE_REG: KBSCN_DEBOUNCE_RELEASE_TIME (Bit 0) */
#define KBSCAN_KBSCN_DEBOUNCE_REG_KBSCN_DEBOUNCE_RELEASE_TIME_Msk (0x3fUL) /*!< KBSCAN KBSCN_DEBOUNCE_REG: KBSCN_DEBOUNCE_RELEASE_TIME (Bitfield-Mask: 0x3f) */
/* =================================================  KBSCN_MATRIX_SIZE_REG  ================================================= */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_COLUMN_Pos (4UL)  /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_COLUMN (Bit 4) */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_COLUMN_Msk (0x1f0UL) /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_COLUMN (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_ROW_Pos (0UL)     /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_ROW (Bit 0) */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_ROW_Msk (0xfUL)   /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_ROW (Bitfield-Mask: 0x0f) */
/* =================================================  KBSCN_MESSAGE_KEY_REG  ================================================= */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_LAST_ENTRY_Pos (10UL)    /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_LAST_ENTRY (Bit 10) */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_LAST_ENTRY_Msk (0x400UL) /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_LAST_ENTRY (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_KEY_STATE_Pos (9UL)      /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_KEY_STATE (Bit 9) */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_KEY_STATE_Msk (0x200UL)  /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_KEY_STATE (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_KEYID_COLUMN_Pos (4UL)   /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_KEYID_COLUMN (Bit 4) */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_KEYID_COLUMN_Msk (0x1f0UL) /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_KEYID_COLUMN (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_KEYID_ROW_Pos (0UL)      /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_KEYID_ROW (Bit 0) */
#define KBSCAN_KBSCN_MESSAGE_KEY_REG_KBSCN_KEYID_ROW_Msk (0xfUL)    /*!< KBSCAN KBSCN_MESSAGE_KEY_REG: KBSCN_KEYID_ROW (Bitfield-Mask: 0x0f) */
/* ==================================================  KBSCN_P00_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P00_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P00_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P00_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P00_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P00_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P00_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P00_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P00_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P00_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P00_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P00_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P00_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P01_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P01_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P01_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P01_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P01_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P01_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P01_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P01_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P01_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P01_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P01_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P01_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P01_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P02_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P02_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P02_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P02_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P02_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P02_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P02_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P02_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P02_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P02_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P02_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P02_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P02_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P03_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P03_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P03_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P03_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P03_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P03_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P03_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P03_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P03_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P03_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P03_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P03_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P03_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P04_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P04_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P04_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P04_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P04_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P04_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P04_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P04_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P04_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P04_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P04_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P04_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P04_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P05_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P05_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P05_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P05_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P05_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P05_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P05_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P05_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P05_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P05_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P05_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P05_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P05_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P06_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P06_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P06_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P06_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P06_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P06_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P06_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P06_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P06_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P06_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P06_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P06_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P06_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P07_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P07_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P07_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P07_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P07_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P07_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P07_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P07_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P07_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P07_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P07_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P07_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P07_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P10_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P10_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P10_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P10_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P10_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P10_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P10_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P10_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P10_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P10_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P10_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P10_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P10_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P11_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P12_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P13_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P14_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P15_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P16_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P17_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P20_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P21_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P22_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P23_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
