S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ==================================================  KBSCN_P24_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P30_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P30_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P30_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P30_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P30_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P30_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P30_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P30_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P30_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P30_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P30_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P30_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P30_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P31_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P31_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P31_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P31_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P31_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P31_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P31_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P31_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P31_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P31_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P31_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P31_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P31_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P32_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P32_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P32_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P32_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P32_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P32_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P32_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P32_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P32_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P32_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P32_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P32_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P32_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P33_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P33_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P33_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P33_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P33_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P33_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P33_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P33_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P33_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P33_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P33_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P33_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P33_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P34_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P34_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P34_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P34_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P34_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P34_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P34_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P34_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P34_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P34_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P34_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P34_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P34_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P35_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P35_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P35_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P35_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P35_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P35_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P35_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P35_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P35_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P35_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P35_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P35_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P35_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P36_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P36_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P36_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P36_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P36_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P36_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P36_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P36_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P36_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P36_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P36_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P36_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P36_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P37_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P37_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P37_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P37_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P37_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P37_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P37_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P37_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P37_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P37_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P37_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P37_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P37_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P40_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P40_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P40_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P41_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P41_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P41_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P42_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P42_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P42_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P43_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P43_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P43_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P44_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P44_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P44_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P45_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P45_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P45_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P46_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P46_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P46_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ==================================================  KBSCN_P47_MODE_REG  =================================================== */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)           /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_GPIO_EN (Bit 6)      */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)        /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_ROW_Pos (5UL)               /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_ROW (Bit 5)          */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_ROW_Msk (0x20UL)            /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_MODE_Pos (0UL)              /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_MODE (Bit 0)         */
#define KBSCAN_KBSCN_P47_MODE_REG_KBSCN_MODE_Msk (0x1fUL)           /*!< KBSCAN KBSCN_P47_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
/* ===================================================  KBSCN_STATUS_REG  ==================================================== */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_FIFO_UNDERFL_Pos (8UL)        /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_FIFO_UNDERFL (Bit 8)   */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_FIFO_UNDERFL_Msk (0x100UL)    /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_FIFO_UNDERFL (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_FIFO_OVERFL_Pos (7UL)         /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_FIFO_OVERFL (Bit 7)    */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_FIFO_OVERFL_Msk (0x80UL)      /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_FIFO_OVERFL (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_NUM_MESSAGE_Pos (2UL)         /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_NUM_MESSAGE (Bit 2)    */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_NUM_MESSAGE_Msk (0x7cUL)      /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_NUM_MESSAGE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_INACTIVE_IRQ_STATUS_Pos (1UL) /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_INACTIVE_IRQ_STATUS (Bit 1) */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_INACTIVE_IRQ_STATUS_Msk (0x2UL) /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_INACTIVE_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_MES_IRQ_STATUS_Pos (0UL)      /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_MES_IRQ_STATUS (Bit 0) */
#define KBSCAN_KBSCN_STATUS_REG_KBSCN_MES_IRQ_STATUS_Msk (0x1UL)    /*!< KBSCAN KBSCN_STATUS_REG: KBSCN_MES_IRQ_STATUS (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                           OTPC                                            ================ */
/* =========================================================================================================================== */

