S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ====================================================  PATCH_ADDR0_REG  ==================================================== */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR10_REG  ==================================================== */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR10_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR10_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR11_REG  ==================================================== */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR11_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR11_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR12_REG  ==================================================== */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR12_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR12_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR13_REG  ==================================================== */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR13_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR13_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR14_REG  ==================================================== */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR14_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR14_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR15_REG  ==================================================== */
#define PATCH_PATCH_ADDR15_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR15_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR15_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR15_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR15_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR15_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR15_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR15_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR16_REG  ==================================================== */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR17_REG  ==================================================== */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR18_REG  ==================================================== */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR19_REG  ==================================================== */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_C_Pos (1UL)               /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_C (Bit 1)          */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_C_Msk (0x1fffeUL)         /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR1_REG  ==================================================== */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_ADDR20_REG  ==================================================== */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ===================================================  PATCH_ADDR21_REG  ==================================================== */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ===================================================  PATCH_ADDR22_REG  ==================================================== */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ===================================================  PATCH_ADDR23_REG  ==================================================== */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ===================================================  PATCH_ADDR24_REG  ==================================================== */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ===================================================  PATCH_ADDR25_REG  ==================================================== */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ===================================================  PATCH_ADDR26_REG  ==================================================== */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ===================================================  PATCH_ADDR27_REG  ==================================================== */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_19_Pos (19UL)             /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_19 (Bit 19)        */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_19_Msk (0x80000UL)        /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_D_Pos (2UL)               /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_D (Bit 2)          */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_D_Msk (0x1fffcUL)         /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
/* ====================================================  PATCH_ADDR2_REG  ==================================================== */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR3_REG  ==================================================== */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR4_REG  ==================================================== */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR5_REG  ==================================================== */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR6_REG  ==================================================== */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR6_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR6_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR7_REG  ==================================================== */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR7_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR7_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR8_REG  ==================================================== */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR8_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR8_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ====================================================  PATCH_ADDR9_REG  ==================================================== */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_19_Pos (19UL)              /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_19 (Bit 19)         */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_19_Msk (0x80000UL)         /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_C_Pos (1UL)                /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_C (Bit 1)           */
#define PATCH_PATCH_ADDR9_REG_PATCH_ADDR_C_Msk (0x1fffeUL)          /*!< PATCH PATCH_ADDR9_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
/* ===================================================  PATCH_DATA20_REG  ==================================================== */
#define PATCH_PATCH_DATA20_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA20_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA20_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA20_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ===================================================  PATCH_DATA21_REG  ==================================================== */
#define PATCH_PATCH_DATA21_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA21_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA21_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA21_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ===================================================  PATCH_DATA22_REG  ==================================================== */
#define PATCH_PATCH_DATA22_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA22_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA22_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA22_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ===================================================  PATCH_DATA23_REG  ==================================================== */
#define PATCH_PATCH_DATA23_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA23_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA23_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA23_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ===================================================  PATCH_DATA24_REG  ==================================================== */
#define PATCH_PATCH_DATA24_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA24_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA24_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA24_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ===================================================  PATCH_DATA25_REG  ==================================================== */
#define PATCH_PATCH_DATA25_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA25_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA25_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA25_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ===================================================  PATCH_DATA26_REG  ==================================================== */
#define PATCH_PATCH_DATA26_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA26_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA26_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA26_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ===================================================  PATCH_DATA27_REG  ==================================================== */
#define PATCH_PATCH_DATA27_REG_PATCH_DATA_Pos (0UL)                 /*!< PATCH PATCH_DATA27_REG: PATCH_DATA (Bit 0)            */
#define PATCH_PATCH_DATA27_REG_PATCH_DATA_Msk (0xffffffffUL)        /*!< PATCH PATCH_DATA27_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */
/* ====================================================  PATCH_VALID_REG  ==================================================== */
#define PATCH_PATCH_VALID_REG_PATCH_VALID_Pos (0UL)                 /*!< PATCH PATCH_VALID_REG: PATCH_VALID (Bit 0)            */
#define PATCH_PATCH_VALID_REG_PATCH_VALID_Msk (0xfffffffUL)         /*!< PATCH PATCH_VALID_REG: PATCH_VALID (Bitfield-Mask: 0xfffffff) */
/* =================================================  PATCH_VALID_RESET_REG  ================================================= */
#define PATCH_PATCH_VALID_RESET_REG_PATCH_VALID_Pos (0UL)           /*!< PATCH PATCH_VALID_RESET_REG: PATCH_VALID (Bit 0)      */
#define PATCH_PATCH_VALID_RESET_REG_PATCH_VALID_Msk (0xfffffffUL)   /*!< PATCH PATCH_VALID_RESET_REG: PATCH_VALID (Bitfield-Mask: 0xfffffff) */
/* ==================================================  PATCH_VALID_SET_REG  ================================================== */
#define PATCH_PATCH_VALID_SET_REG_PATCH_VALID_Pos (0UL)             /*!< PATCH PATCH_VALID_SET_REG: PATCH_VALID (Bit 0)        */
#define PATCH_PATCH_VALID_SET_REG_PATCH_VALID_Msk (0xfffffffUL)     /*!< PATCH PATCH_VALID_SET_REG: PATCH_VALID (Bitfield-Mask: 0xfffffff) */


/* =========================================================================================================================== */
/* ================                                          PLLDIG                                           ================ */
/* =========================================================================================================================== */

