S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ======================================================  RF_BMCW_REG  ====================================================== */
#define PLLDIG_RF_BMCW_REG_HSI_SEL_Pos    (8UL)                     /*!< PLLDIG RF_BMCW_REG: HSI_SEL (Bit 8)                   */
#define PLLDIG_RF_BMCW_REG_HSI_SEL_Msk    (0x100UL)                 /*!< PLLDIG RF_BMCW_REG: HSI_SEL (Bitfield-Mask: 0x01)     */
#define PLLDIG_RF_BMCW_REG_CN_SEL_Pos     (7UL)                     /*!< PLLDIG RF_BMCW_REG: CN_SEL (Bit 7)                    */
#define PLLDIG_RF_BMCW_REG_CN_SEL_Msk     (0x80UL)                  /*!< PLLDIG RF_BMCW_REG: CN_SEL (Bitfield-Mask: 0x01)      */
#define PLLDIG_RF_BMCW_REG_HSI_WR_Pos     (6UL)                     /*!< PLLDIG RF_BMCW_REG: HSI_WR (Bit 6)                    */
#define PLLDIG_RF_BMCW_REG_HSI_WR_Msk     (0x40UL)                  /*!< PLLDIG RF_BMCW_REG: HSI_WR (Bitfield-Mask: 0x01)      */
#define PLLDIG_RF_BMCW_REG_CN_WR_Pos      (0UL)                     /*!< PLLDIG RF_BMCW_REG: CN_WR (Bit 0)                     */
#define PLLDIG_RF_BMCW_REG_CN_WR_Msk      (0x3fUL)                  /*!< PLLDIG RF_BMCW_REG: CN_WR (Bitfield-Mask: 0x3f)       */
/* ====================================================  RF_CALCAP1_REG  ===================================================== */
#define PLLDIG_RF_CALCAP1_REG_VCO_CALCAP_LOW_Pos (0UL)              /*!< PLLDIG RF_CALCAP1_REG: VCO_CALCAP_LOW (Bit 0)         */
#define PLLDIG_RF_CALCAP1_REG_VCO_CALCAP_LOW_Msk (0xffffUL)         /*!< PLLDIG RF_CALCAP1_REG: VCO_CALCAP_LOW (Bitfield-Mask: 0xffff) */
/* ====================================================  RF_CALCAP2_REG  ===================================================== */
#define PLLDIG_RF_CALCAP2_REG_VCO_CALCAP_HIGH_Pos (0UL)             /*!< PLLDIG RF_CALCAP2_REG: VCO_CALCAP_HIGH (Bit 0)        */
#define PLLDIG_RF_CALCAP2_REG_VCO_CALCAP_HIGH_Msk (0x3UL)           /*!< PLLDIG RF_CALCAP2_REG: VCO_CALCAP_HIGH (Bitfield-Mask: 0x03) */
/* =================================================  RF_CALTRIM_STEP1_REG  ================================================== */
#define PLLDIG_RF_CALTRIM_STEP1_REG_MDSTATE_RD_Pos (0UL)            /*!< PLLDIG RF_CALTRIM_STEP1_REG: MDSTATE_RD (Bit 0)       */
#define PLLDIG_RF_CALTRIM_STEP1_REG_MDSTATE_RD_Msk (0xffffUL)       /*!< PLLDIG RF_CALTRIM_STEP1_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */
/* =================================================  RF_CALTRIM_STEP2_REG  ================================================== */
#define PLLDIG_RF_CALTRIM_STEP2_REG_MDSTATE_RD_Pos (0UL)            /*!< PLLDIG RF_CALTRIM_STEP2_REG: MDSTATE_RD (Bit 0)       */
#define PLLDIG_RF_CALTRIM_STEP2_REG_MDSTATE_RD_Msk (0xffffUL)       /*!< PLLDIG RF_CALTRIM_STEP2_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */
/* =================================================  RF_CALTRIM_STEP3_REG  ================================================== */
#define PLLDIG_RF_CALTRIM_STEP3_REG_MDSTATE_RD_Pos (0UL)            /*!< PLLDIG RF_CALTRIM_STEP3_REG: MDSTATE_RD (Bit 0)       */
#define PLLDIG_RF_CALTRIM_STEP3_REG_MDSTATE_RD_Msk (0xffffUL)       /*!< PLLDIG RF_CALTRIM_STEP3_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */
/* =================================================  RF_CALTRIM_STEP4_REG  ================================================== */
#define PLLDIG_RF_CALTRIM_STEP4_REG_MDSTATE_RD_Pos (0UL)            /*!< PLLDIG RF_CALTRIM_STEP4_REG: MDSTATE_RD (Bit 0)       */
#define PLLDIG_RF_CALTRIM_STEP4_REG_MDSTATE_RD_Msk (0xffffUL)       /*!< PLLDIG RF_CALTRIM_STEP4_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */
/* ==================================================  RF_FTDF_PHYATTR_REG  ================================================== */
#define PLLDIG_RF_FTDF_PHYATTR_REG_FTDF_PHYATTR_Pos (0UL)           /*!< PLLDIG RF_FTDF_PHYATTR_REG: FTDF_PHYATTR (Bit 0)      */
#define PLLDIG_RF_FTDF_PHYATTR_REG_FTDF_PHYATTR_Msk (0xffffUL)      /*!< PLLDIG RF_FTDF_PHYATTR_REG: FTDF_PHYATTR (Bitfield-Mask: 0xffff) */
/* ===================================================  RF_KMOD_ALPHA_REG  =================================================== */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_FTDF_Pos (6UL)          /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_FTDF (Bit 6)     */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_FTDF_Msk (0xfc0UL)      /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_FTDF (Bitfield-Mask: 0x3f) */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_BLE_Pos (0UL)           /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_BLE (Bit 0)      */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_BLE_Msk (0x3fUL)        /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_BLE (Bitfield-Mask: 0x3f) */
/* ================================================  RF_MGAIN_COMP_VAL0_REG  ================================================= */
#define PLLDIG_RF_MGAIN_COMP_VAL0_REG_MGAIN_COMP_VAL_Pos (0UL)      /*!< PLLDIG RF_MGAIN_COMP_VAL0_REG: MGAIN_COMP_VAL (Bit 0) */
#define PLLDIG_RF_MGAIN_COMP_VAL0_REG_MGAIN_COMP_VAL_Msk (0x1fUL)   /*!< PLLDIG RF_MGAIN_COMP_VAL0_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */
/* ================================================  RF_MGAIN_COMP_VAL1_REG  ================================================= */
#define PLLDIG_RF_MGAIN_COMP_VAL1_REG_MGAIN_COMP_VAL_Pos (0UL)      /*!< PLLDIG RF_MGAIN_COMP_VAL1_REG: MGAIN_COMP_VAL (Bit 0) */
#define PLLDIG_RF_MGAIN_COMP_VAL1_REG_MGAIN_COMP_VAL_Msk (0x1fUL)   /*!< PLLDIG RF_MGAIN_COMP_VAL1_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */
/* ================================================  RF_MGAIN_COMP_VAL2_REG  ================================================= */
#define PLLDIG_RF_MGAIN_COMP_VAL2_REG_MGAIN_COMP_VAL_Pos (0UL)      /*!< PLLDIG RF_MGAIN_COMP_VAL2_REG: MGAIN_COMP_VAL (Bit 0) */
#define PLLDIG_RF_MGAIN_COMP_VAL2_REG_MGAIN_COMP_VAL_Msk (0x1fUL)   /*!< PLLDIG RF_MGAIN_COMP_VAL2_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */
/* ================================================  RF_MGAIN_COMP_VAL3_REG  ================================================= */
#define PLLDIG_RF_MGAIN_COMP_VAL3_REG_MGAIN_COMP_VAL_Pos (0UL)      /*!< PLLDIG RF_MGAIN_COMP_VAL3_REG: MGAIN_COMP_VAL (Bit 0) */
#define PLLDIG_RF_MGAIN_COMP_VAL3_REG_MGAIN_COMP_VAL_Msk (0x1fUL)   /*!< PLLDIG RF_MGAIN_COMP_VAL3_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */
/* ================================================  RF_MGAIN_COMP_VAL4_REG  ================================================= */
#define PLLDIG_RF_MGAIN_COMP_VAL4_REG_MGAIN_COMP_VAL_Pos (0UL)      /*!< PLLDIG RF_MGAIN_COMP_VAL4_REG: MGAIN_COMP_VAL (Bit 0) */
#define PLLDIG_RF_MGAIN_COMP_VAL4_REG_MGAIN_COMP_VAL_Msk (0x1fUL)   /*!< PLLDIG RF_MGAIN_COMP_VAL4_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */
/* ================================================  RF_MGAIN_COMP_VAL5_REG  ================================================= */
#define PLLDIG_RF_MGAIN_COMP_VAL5_REG_MGAIN_COMP_VAL_Pos (0UL)      /*!< PLLDIG RF_MGAIN_COMP_VAL5_REG: MGAIN_COMP_VAL (Bit 0) */
#define PLLDIG_RF_MGAIN_COMP_VAL5_REG_MGAIN_COMP_VAL_Msk (0x1fUL)   /*!< PLLDIG RF_MGAIN_COMP_VAL5_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */
/* ================================================  RF_MGAIN_COMP_VAL6_REG  ================================================= */
#define PLLDIG_RF_MGAIN_COMP_VAL6_REG_MGAIN_COMP_VAL_Pos (0UL)      /*!< PLLDIG RF_MGAIN_COMP_VAL6_REG: MGAIN_COMP_VAL (Bit 0) */
#define PLLDIG_RF_MGAIN_COMP_VAL6_REG_MGAIN_COMP_VAL_Msk (0x1fUL)   /*!< PLLDIG RF_MGAIN_COMP_VAL6_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */
/* ==================================================  RF_MGAIN_CTRL2_REG  =================================================== */
#define PLLDIG_RF_MGAIN_CTRL2_REG_MGAIN_TRANSMIT_LENGTH_Pos (0UL)   /*!< PLLDIG RF_MGAIN_CTRL2_REG: MGAIN_TRANSMIT_LENGTH (Bit 0) */
#define PLLDIG_RF_MGAIN_CTRL2_REG_MGAIN_TRANSMIT_LENGTH_Msk (0x7fUL) /*!< PLLDIG RF_MGAIN_CTRL2_REG: MGAIN_TRANSMIT_LENGTH (Bitfield-Mask: 0x7f) */
/* =================================================  RF_MGAIN_CTRL_BLE_REG  ================================================= */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_MGAIN_AVER_Pos (11UL)          /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: MGAIN_AVER (Bit 11)     */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_MGAIN_AVER_Msk (0x1800UL)      /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: MGAIN_AVER (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_MGAIN_CMP_INV_Pos (10UL)       /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: MGAIN_CMP_INV (Bit 10)  */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_MGAIN_CMP_INV_Msk (0x400UL)    /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: MGAIN_CMP_INV (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_BLE_TESTPAT_GEN_Pos (9UL)      /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: BLE_TESTPAT_GEN (Bit 9) */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_BLE_TESTPAT_GEN_Msk (0x200UL)  /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: BLE_TESTPAT_GEN (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_GAUSS_GAIN_SEL_Pos (8UL)       /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: GAUSS_GAIN_SEL (Bit 8)  */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_GAUSS_GAIN_SEL_Msk (0x100UL)   /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: GAUSS_GAIN_SEL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_GAUSS_GAIN_WR_Pos (0UL)        /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: GAUSS_GAIN_WR (Bit 0)   */
#define PLLDIG_RF_MGAIN_CTRL_BLE_REG_GAUSS_GAIN_WR_Msk (0xffUL)     /*!< PLLDIG RF_MGAIN_CTRL_BLE_REG: GAUSS_GAIN_WR (Bitfield-Mask: 0xff) */
/* ================================================  RF_MGAIN_CTRL_FTDF_REG  ================================================= */
#define PLLDIG_RF_MGAIN_CTRL_FTDF_REG_MSK_GAIN_OFFSET_Pos (8UL)     /*!< PLLDIG RF_MGAIN_CTRL_FTDF_REG: MSK_GAIN_OFFSET (Bit 8) */
#define PLLDIG_RF_MGAIN_CTRL_FTDF_REG_MSK_GAIN_OFFSET_Msk (0x3f00UL) /*!< PLLDIG RF_MGAIN_CTRL_FTDF_REG: MSK_GAIN_OFFSET (Bitfield-Mask: 0x3f) */
#define PLLDIG_RF_MGAIN_CTRL_FTDF_REG_MSK_GAIN_SEL_Pos (6UL)        /*!< PLLDIG RF_MGAIN_CTRL_FTDF_REG: MSK_GAIN_SEL (Bit 6)   */
#define PLLDIG_RF_MGAIN_CTRL_FTDF_REG_MSK_GAIN_SEL_Msk (0x40UL)     /*!< PLLDIG RF_MGAIN_CTRL_FTDF_REG: MSK_GAIN_SEL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MGAIN_CTRL_FTDF_REG_MSK_GAIN_WR_Pos (0UL)         /*!< PLLDIG RF_MGAIN_CTRL_FTDF_REG: MSK_GAIN_WR (Bit 0)    */
#define PLLDIG_RF_MGAIN_CTRL_FTDF_REG_MSK_GAIN_WR_Msk (0x3fUL)      /*!< PLLDIG RF_MGAIN_CTRL_FTDF_REG: MSK_GAIN_WR (Bitfield-Mask: 0x3f) */
/* ==================================================  RF_MSKMOD_CHIPH_REG  ================================================== */
#define PLLDIG_RF_MSKMOD_CHIPH_REG_MSK_CHIPH_Pos (0UL)              /*!< PLLDIG RF_MSKMOD_CHIPH_REG: MSK_CHIPH (Bit 0)         */
#define PLLDIG_RF_MSKMOD_CHIPH_REG_MSK_CHIPH_Msk (0xffffUL)         /*!< PLLDIG RF_MSKMOD_CHIPH_REG: MSK_CHIPH (Bitfield-Mask: 0xffff) */
/* ==================================================  RF_MSKMOD_CHIPL_REG  ================================================== */
#define PLLDIG_RF_MSKMOD_CHIPL_REG_MSK_CHIPL_Pos (0UL)              /*!< PLLDIG RF_MSKMOD_CHIPL_REG: MSK_CHIPL (Bit 0)         */
#define PLLDIG_RF_MSKMOD_CHIPL_REG_MSK_CHIPL_Msk (0xffffUL)         /*!< PLLDIG RF_MSKMOD_CHIPL_REG: MSK_CHIPL (Bitfield-Mask: 0xffff) */
/* ==================================================  RF_MSKMOD_CTRL1_REG  ================================================== */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_BYPASS_PHASE_Pos (7UL)       /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_BYPASS_PHASE (Bit 7)  */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_BYPASS_PHASE_Msk (0x80UL)    /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_BYPASS_PHASE (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_MOD_FROM_GPIO_Pos (6UL)       /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_MOD_FROM_GPIO (Bit 6)  */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_MOD_FROM_GPIO_Msk (0x40UL)    /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_MOD_FROM_GPIO (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_SDM_Pos (5UL)            /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_SDM (Bit 5)       */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_SDM_Msk (0x20UL)         /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_SDM (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_DAC_Pos (4UL)            /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_DAC (Bit 4)       */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_DAC_Msk (0x10UL)         /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_DAC (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_SDM_POL_Pos (3UL)            /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_SDM_POL (Bit 3)       */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_SDM_POL_Msk (0x8UL)          /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_SDM_POL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_DAC_POL_Pos (2UL)            /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_DAC_POL (Bit 2)       */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_DAC_POL_Msk (0x4UL)          /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_DAC_POL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_DAC_DELAY_Pos (0UL)           /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_DAC_DELAY (Bit 0)      */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_DAC_DELAY_Msk (0x3UL)         /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_DAC_DELAY (Bitfield-Mask: 0x03) */
/* ==================================================  RF_MSKMOD_CTRL2_REG  ================================================== */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_ALW_EN_Pos (6UL)             /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_ALW_EN (Bit 6)        */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_ALW_EN_Msk (0x40UL)          /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_ALW_EN (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_TX_SEL_Pos (5UL)             /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_TX_SEL (Bit 5)        */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_TX_SEL_Msk (0x20UL)          /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_TX_SEL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_VALID_Pos (4UL)               /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_VALID (Bit 4)          */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_VALID_Msk (0x10UL)            /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_VALID (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_DATA_Pos (0UL)                /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_DATA (Bit 0)           */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_DATA_Msk (0xfUL)              /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_DATA (Bitfield-Mask: 0x0f) */
/* ================================================  RF_SYNTH_CTRL1_BLE_REG  ================================================= */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_PLL_HSI_POL_Pos (14UL)        /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: PLL_HSI_POL (Bit 14)   */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_PLL_HSI_POL_Msk (0x4000UL)    /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: PLL_HSI_POL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CS_Pos (13UL)                 /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CS (Bit 13)            */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CS_Msk (0x2000UL)             /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CS (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_SGN_Pos (12UL)                /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: SGN (Bit 12)           */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_SGN_Msk (0x1000UL)            /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: SGN (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CHANNEL_ZERO_Pos (0UL)        /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CHANNEL_ZERO (Bit 0)   */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CHANNEL_ZERO_Msk (0xfffUL)    /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CHANNEL_ZERO (Bitfield-Mask: 0xfff) */
/* ================================================  RF_SYNTH_CTRL1_FTDF_REG  ================================================ */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_PLL_HSI_POL_Pos (14UL)       /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: PLL_HSI_POL (Bit 14)  */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_PLL_HSI_POL_Msk (0x4000UL)   /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: PLL_HSI_POL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CS_Pos (13UL)                /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CS (Bit 13)           */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CS_Msk (0x2000UL)            /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CS (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_SGN_Pos (12UL)               /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: SGN (Bit 12)          */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_SGN_Msk (0x1000UL)           /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: SGN (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CHANNEL_ZERO_Pos (0UL)       /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CHANNEL_ZERO (Bit 0)  */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CHANNEL_ZERO_Msk (0xfffUL)   /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CHANNEL_ZERO (Bitfield-Mask: 0xfff) */
/* ================================================  RF_SYNTH_CTRL2_BLE_REG  ================================================= */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_BT_SEL_Pos (12UL)             /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: BT_SEL (Bit 12)        */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_BT_SEL_Msk (0x1000UL)         /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: BT_SEL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_EO_PACKET_DIS_Pos (11UL)      /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: EO_PACKET_DIS (Bit 11) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_EO_PACKET_DIS_Msk (0x800UL)   /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: EO_PACKET_DIS (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_TXDATA_INV_Pos (10UL)         /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: TXDATA_INV (Bit 10)    */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_TXDATA_INV_Msk (0x400UL)      /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: TXDATA_INV (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_86_Pos (9UL)            /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_86 (Bit 9)       */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_86_Msk (0x200UL)        /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_86 (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_INV_Pos (8UL)           /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_INV (Bit 8)      */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_INV_Msk (0x100UL)       /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_INV (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_DELAY_Pos (6UL)               /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: DELAY (Bit 6)          */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_DELAY_Msk (0xc0UL)            /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: DELAY (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_MODINDEX_Pos (4UL)            /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: MODINDEX (Bit 4)       */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_MODINDEX_Msk (0x30UL)         /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: MODINDEX (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_TX_Pos (2UL)         /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_TX (Bit 2)    */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_TX_Msk (0xcUL)       /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_TX (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_RX_Pos (0UL)         /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_RX (Bit 0)    */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_RX_Msk (0x3UL)       /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_RX (Bitfield-Mask: 0x03) */
/* ================================================  RF_SYNTH_CTRL2_FTDF_REG  ================================================ */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_FTDF_MODINDEX_Pos (8UL)      /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: FTDF_MODINDEX (Bit 8) */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_FTDF_MODINDEX_Msk (0x3f00UL) /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: FTDF_MODINDEX (Bitfield-Mask: 0x3f) */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_DELAY_Pos (6UL)              /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: DELAY (Bit 6)         */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_DELAY_Msk (0xc0UL)           /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: DELAY (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_SD_ORDER_TX_Pos (2UL)        /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: SD_ORDER_TX (Bit 2)   */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_SD_ORDER_TX_Msk (0xcUL)      /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: SD_ORDER_TX (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_SD_ORDER_RX_Pos (0UL)        /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: SD_ORDER_RX (Bit 0)   */
#define PLLDIG_RF_SYNTH_CTRL2_FTDF_REG_SD_ORDER_RX_Msk (0x3UL)      /*!< PLLDIG RF_SYNTH_CTRL2_FTDF_REG: SD_ORDER_RX (Bitfield-Mask: 0x03) */
/* ==================================================  RF_SYNTH_CTRL3_REG  =================================================== */
#define PLLDIG_RF_SYNTH_CTRL3_REG_ZIF_MODE_EN_Pos (15UL)            /*!< PLLDIG RF_SYNTH_CTRL3_REG: ZIF_MODE_EN (Bit 15)       */
#define PLLDIG_RF_SYNTH_CTRL3_REG_ZIF_MODE_EN_Msk (0x8000UL)        /*!< PLLDIG RF_SYNTH_CTRL3_REG: ZIF_MODE_EN (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL3_REG_MODVAL_SEL_Pos (14UL)             /*!< PLLDIG RF_SYNTH_CTRL3_REG: MODVAL_SEL (Bit 14)        */
#define PLLDIG_RF_SYNTH_CTRL3_REG_MODVAL_SEL_Msk (0x4000UL)         /*!< PLLDIG RF_SYNTH_CTRL3_REG: MODVAL_SEL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL3_REG_MODVAL_WR_Pos (0UL)               /*!< PLLDIG RF_SYNTH_CTRL3_REG: MODVAL_WR (Bit 0)          */
#define PLLDIG_RF_SYNTH_CTRL3_REG_MODVAL_WR_Msk (0x3fffUL)          /*!< PLLDIG RF_SYNTH_CTRL3_REG: MODVAL_WR (Bitfield-Mask: 0x3fff) */
/* ===============================================  RF_SYNTH_RESULT2_BLE_REG  ================================================ */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_CN_CAL_RD_Pos (8UL)         /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: CN_CAL_RD (Bit 8)    */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_CN_CAL_RD_Msk (0x3f00UL)    /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: CN_CAL_RD (Bitfield-Mask: 0x3f) */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_GAUSS_GAIN_RD_Pos (0UL)     /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: GAUSS_GAIN_RD (Bit 0) */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_GAUSS_GAIN_RD_Msk (0xffUL)  /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: GAUSS_GAIN_RD (Bitfield-Mask: 0xff) */
/* ===============================================  RF_SYNTH_RESULT2_FTDF_REG  =============================================== */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_UPPER_RD_Pos (6UL) /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_UPPER_RD (Bit 6) */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_UPPER_RD_Msk (0xfc0UL) /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_UPPER_RD (Bitfield-Mask: 0x3f) */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_LOWER_RD_Pos (0UL) /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_LOWER_RD (Bit 0) */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_LOWER_RD_Msk (0x3fUL) /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_LOWER_RD (Bitfield-Mask: 0x3f) */
/* ===============================================  RF_SYNTH_RESULT3_FTDF_REG  =============================================== */
#define PLLDIG_RF_SYNTH_RESULT3_FTDF_REG_CN_CAL_FTDF_RD_Pos (0UL)   /*!< PLLDIG RF_SYNTH_RESULT3_FTDF_REG: CN_CAL_FTDF_RD (Bit 0) */
#define PLLDIG_RF_SYNTH_RESULT3_FTDF_REG_CN_CAL_FTDF_RD_Msk (0x3fUL) /*!< PLLDIG RF_SYNTH_RESULT3_FTDF_REG: CN_CAL_FTDF_RD (Bitfield-Mask: 0x3f) */
/* ================================================  RF_SYNTH_RESULT_BLE_REG  ================================================ */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_VCO_FREQTRIM_RD_Pos (8UL)    /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: VCO_FREQTRIM_RD (Bit 8) */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_VCO_FREQTRIM_RD_Msk (0xf00UL) /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: VCO_FREQTRIM_RD (Bitfield-Mask: 0x0f) */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_GAUSS_GAIN_CAL_RD_Pos (0UL)  /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: GAUSS_GAIN_CAL_RD (Bit 0) */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_GAUSS_GAIN_CAL_RD_Msk (0xffUL) /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: GAUSS_GAIN_CAL_RD (Bitfield-Mask: 0xff) */
