S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define RFCU_RF_IFF_CC_FTDF_SET1_REG_IF_CAL_CAP_WR_Msk (0x1fUL)     /*!< RFCU RF_IFF_CC_FTDF_SET1_REG: IF_CAL_CAP_WR (Bitfield-Mask: 0x1f) */
/* ================================================  RF_IFF_CC_FTDF_SET2_REG  ================================================ */
#define RFCU_RF_IFF_CC_FTDF_SET2_REG_IF_CAL_CAP_WR_Pos (0UL)        /*!< RFCU RF_IFF_CC_FTDF_SET2_REG: IF_CAL_CAP_WR (Bit 0)   */
#define RFCU_RF_IFF_CC_FTDF_SET2_REG_IF_CAL_CAP_WR_Msk (0x1fUL)     /*!< RFCU RF_IFF_CC_FTDF_SET2_REG: IF_CAL_CAP_WR (Bitfield-Mask: 0x1f) */
/* ===================================================  RF_IFF_CTRL1_REG  ==================================================== */
#define RFCU_RF_IFF_CTRL1_REG_IFF_COMPLEX_DIS_Pos (13UL)            /*!< RFCU RF_IFF_CTRL1_REG: IFF_COMPLEX_DIS (Bit 13)       */
#define RFCU_RF_IFF_CTRL1_REG_IFF_COMPLEX_DIS_Msk (0x2000UL)        /*!< RFCU RF_IFF_CTRL1_REG: IFF_COMPLEX_DIS (Bitfield-Mask: 0x01) */
#define RFCU_RF_IFF_CTRL1_REG_IF_SELECT_FSM_Pos (12UL)              /*!< RFCU RF_IFF_CTRL1_REG: IF_SELECT_FSM (Bit 12)         */
#define RFCU_RF_IFF_CTRL1_REG_IF_SELECT_FSM_Msk (0x1000UL)          /*!< RFCU RF_IFF_CTRL1_REG: IF_SELECT_FSM (Bitfield-Mask: 0x01) */
#define RFCU_RF_IFF_CTRL1_REG_IF_SEL_SET2_GT_Pos (8UL)              /*!< RFCU RF_IFF_CTRL1_REG: IF_SEL_SET2_GT (Bit 8)         */
#define RFCU_RF_IFF_CTRL1_REG_IF_SEL_SET2_GT_Msk (0xf00UL)          /*!< RFCU RF_IFF_CTRL1_REG: IF_SEL_SET2_GT (Bitfield-Mask: 0x0f) */
#define RFCU_RF_IFF_CTRL1_REG_RO_TO_PINS_Pos (7UL)                  /*!< RFCU RF_IFF_CTRL1_REG: RO_TO_PINS (Bit 7)             */
#define RFCU_RF_IFF_CTRL1_REG_RO_TO_PINS_Msk (0x80UL)               /*!< RFCU RF_IFF_CTRL1_REG: RO_TO_PINS (Bitfield-Mask: 0x01) */
#define RFCU_RF_IFF_CTRL1_REG_IFF_DCOC_DAC_DIS_Pos (6UL)            /*!< RFCU RF_IFF_CTRL1_REG: IFF_DCOC_DAC_DIS (Bit 6)       */
#define RFCU_RF_IFF_CTRL1_REG_IFF_DCOC_DAC_DIS_Msk (0x40UL)         /*!< RFCU RF_IFF_CTRL1_REG: IFF_DCOC_DAC_DIS (Bitfield-Mask: 0x01) */
#define RFCU_RF_IFF_CTRL1_REG_IF_MUTE_Pos (5UL)                     /*!< RFCU RF_IFF_CTRL1_REG: IF_MUTE (Bit 5)                */
#define RFCU_RF_IFF_CTRL1_REG_IF_MUTE_Msk (0x20UL)                  /*!< RFCU RF_IFF_CTRL1_REG: IF_MUTE (Bitfield-Mask: 0x01)  */
#define RFCU_RF_IFF_CTRL1_REG_IF_CAL_CAP_Pos (0UL)                  /*!< RFCU RF_IFF_CTRL1_REG: IF_CAL_CAP (Bit 0)             */
#define RFCU_RF_IFF_CTRL1_REG_IF_CAL_CAP_Msk (0x1fUL)               /*!< RFCU RF_IFF_CTRL1_REG: IF_CAL_CAP (Bitfield-Mask: 0x1f) */
/* ===================================================  RF_IFF_RESULT_REG  =================================================== */
#define RFCU_RF_IFF_RESULT_REG_IF_CAL_CAP_RD_Pos (0UL)              /*!< RFCU RF_IFF_RESULT_REG: IF_CAL_CAP_RD (Bit 0)         */
#define RFCU_RF_IFF_RESULT_REG_IF_CAL_CAP_RD_Msk (0x1fUL)           /*!< RFCU RF_IFF_RESULT_REG: IF_CAL_CAP_RD (Bitfield-Mask: 0x1f) */
/* ====================================================  RF_IO_CTRL1_REG  ==================================================== */
#define RFCU_RF_IO_CTRL1_REG_RFIO_TRIM1_CAP_Pos (0UL)               /*!< RFCU RF_IO_CTRL1_REG: RFIO_TRIM1_CAP (Bit 0)          */
#define RFCU_RF_IO_CTRL1_REG_RFIO_TRIM1_CAP_Msk (0xffUL)            /*!< RFCU RF_IO_CTRL1_REG: RFIO_TRIM1_CAP (Bitfield-Mask: 0xff) */
/* ====================================================  RF_IRQ_CTRL_REG  ==================================================== */
#define RFCU_RF_IRQ_CTRL_REG_EO_CAL_CLEAR_Pos (0UL)                 /*!< RFCU RF_IRQ_CTRL_REG: EO_CAL_CLEAR (Bit 0)            */
#define RFCU_RF_IRQ_CTRL_REG_EO_CAL_CLEAR_Msk (0x1UL)               /*!< RFCU RF_IRQ_CTRL_REG: EO_CAL_CLEAR (Bitfield-Mask: 0x01) */
/* ================================================  RF_LF_CAL_CAP_STAT_REG  ================================================= */
#define RFCU_RF_LF_CAL_CAP_STAT_REG_LF_SHORT_R4_RD_Pos (5UL)        /*!< RFCU RF_LF_CAL_CAP_STAT_REG: LF_SHORT_R4_RD (Bit 5)   */
#define RFCU_RF_LF_CAL_CAP_STAT_REG_LF_SHORT_R4_RD_Msk (0x20UL)     /*!< RFCU RF_LF_CAL_CAP_STAT_REG: LF_SHORT_R4_RD (Bitfield-Mask: 0x01) */
#define RFCU_RF_LF_CAL_CAP_STAT_REG_LF_CAL_CAP_RD_Pos (0UL)         /*!< RFCU RF_LF_CAL_CAP_STAT_REG: LF_CAL_CAP_RD (Bit 0)    */
#define RFCU_RF_LF_CAL_CAP_STAT_REG_LF_CAL_CAP_RD_Msk (0x1fUL)      /*!< RFCU RF_LF_CAL_CAP_STAT_REG: LF_CAL_CAP_RD (Bitfield-Mask: 0x1f) */
/* ====================================================  RF_LF_CTRL_REG  ===================================================== */
#define RFCU_RF_LF_CTRL_REG_LF_SHORT_R4_FTDF_Pos (7UL)              /*!< RFCU RF_LF_CTRL_REG: LF_SHORT_R4_FTDF (Bit 7)         */
#define RFCU_RF_LF_CTRL_REG_LF_SHORT_R4_FTDF_Msk (0x80UL)           /*!< RFCU RF_LF_CTRL_REG: LF_SHORT_R4_FTDF (Bitfield-Mask: 0x01) */
#define RFCU_RF_LF_CTRL_REG_LF_SHORT_R4_BLE_Pos (6UL)               /*!< RFCU RF_LF_CTRL_REG: LF_SHORT_R4_BLE (Bit 6)          */
#define RFCU_RF_LF_CTRL_REG_LF_SHORT_R4_BLE_Msk (0x40UL)            /*!< RFCU RF_LF_CTRL_REG: LF_SHORT_R4_BLE (Bitfield-Mask: 0x01) */
#define RFCU_RF_LF_CTRL_REG_LF_CAL_CAP_SEL_Pos (5UL)                /*!< RFCU RF_LF_CTRL_REG: LF_CAL_CAP_SEL (Bit 5)           */
#define RFCU_RF_LF_CTRL_REG_LF_CAL_CAP_SEL_Msk (0x20UL)             /*!< RFCU RF_LF_CTRL_REG: LF_CAL_CAP_SEL (Bitfield-Mask: 0x01) */
#define RFCU_RF_LF_CTRL_REG_LF_CAL_CAP_WR_Pos (0UL)                 /*!< RFCU RF_LF_CTRL_REG: LF_CAL_CAP_WR (Bit 0)            */
#define RFCU_RF_LF_CTRL_REG_LF_CAL_CAP_WR_Msk (0x1fUL)              /*!< RFCU RF_LF_CTRL_REG: LF_CAL_CAP_WR (Bitfield-Mask: 0x1f) */
/* ================================================  RF_LF_RES_CTRL_BLE_REG  ================================================= */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_BLE_TX_Pos (12UL)        /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_BLE_TX (Bit 12)   */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_BLE_TX_Msk (0xf000UL)    /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_BLE_TX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_BLE_RX_Pos (8UL)         /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_BLE_RX (Bit 8)    */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_BLE_RX_Msk (0xf00UL)     /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_BLE_RX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_SET_BLE_TX_Pos (4UL)     /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_SET_BLE_TX (Bit 4) */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_SET_BLE_TX_Msk (0xf0UL)  /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_SET_BLE_TX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_SET_BLE_RX_Pos (0UL)     /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_SET_BLE_RX (Bit 0) */
#define RFCU_RF_LF_RES_CTRL_BLE_REG_LF_RES_SET_BLE_RX_Msk (0xfUL)   /*!< RFCU RF_LF_RES_CTRL_BLE_REG: LF_RES_SET_BLE_RX (Bitfield-Mask: 0x0f) */
/* ================================================  RF_LF_RES_CTRL_FTDF_REG  ================================================ */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_FTDF_TX_Pos (12UL)      /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_FTDF_TX (Bit 12) */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_FTDF_TX_Msk (0xf000UL)  /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_FTDF_TX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_FTDF_RX_Pos (8UL)       /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_FTDF_RX (Bit 8)  */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_FTDF_RX_Msk (0xf00UL)   /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_FTDF_RX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_SET_FTDF_TX_Pos (4UL)   /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_SET_FTDF_TX (Bit 4) */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_SET_FTDF_TX_Msk (0xf0UL) /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_SET_FTDF_TX (Bitfield-Mask: 0x0f) */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_SET_FTDF_RX_Pos (0UL)   /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_SET_FTDF_RX (Bit 0) */
#define RFCU_RF_LF_RES_CTRL_FTDF_REG_LF_RES_SET_FTDF_RX_Msk (0xfUL) /*!< RFCU RF_LF_RES_CTRL_FTDF_REG: LF_RES_SET_FTDF_RX (Bitfield-Mask: 0x0f) */
/* ===================================================  RF_LNA_CTRL1_REG  ==================================================== */
#define RFCU_RF_LNA_CTRL1_REG_LNA_TRIM_CD_HF_Pos (6UL)              /*!< RFCU RF_LNA_CTRL1_REG: LNA_TRIM_CD_HF (Bit 6)         */
#define RFCU_RF_LNA_CTRL1_REG_LNA_TRIM_CD_HF_Msk (0xfc0UL)          /*!< RFCU RF_LNA_CTRL1_REG: LNA_TRIM_CD_HF (Bitfield-Mask: 0x3f) */
#define RFCU_RF_LNA_CTRL1_REG_LNA_TRIM_CD_LF_Pos (0UL)              /*!< RFCU RF_LNA_CTRL1_REG: LNA_TRIM_CD_LF (Bit 0)         */
#define RFCU_RF_LNA_CTRL1_REG_LNA_TRIM_CD_LF_Msk (0x3fUL)           /*!< RFCU RF_LNA_CTRL1_REG: LNA_TRIM_CD_LF (Bitfield-Mask: 0x3f) */
/* ===================================================  RF_LNA_CTRL2_REG  ==================================================== */
#define RFCU_RF_LNA_CTRL2_REG_LNA_TRIM_GM_LO_Pos (6UL)              /*!< RFCU RF_LNA_CTRL2_REG: LNA_TRIM_GM_LO (Bit 6)         */
#define RFCU_RF_LNA_CTRL2_REG_LNA_TRIM_GM_LO_Msk (0xfc0UL)          /*!< RFCU RF_LNA_CTRL2_REG: LNA_TRIM_GM_LO (Bitfield-Mask: 0x3f) */
#define RFCU_RF_LNA_CTRL2_REG_LNA_TRIM_GM_HI_Pos (0UL)              /*!< RFCU RF_LNA_CTRL2_REG: LNA_TRIM_GM_HI (Bit 0)         */
#define RFCU_RF_LNA_CTRL2_REG_LNA_TRIM_GM_HI_Msk (0x3fUL)           /*!< RFCU RF_LNA_CTRL2_REG: LNA_TRIM_GM_HI (Bitfield-Mask: 0x3f) */
/* ===================================================  RF_LNA_CTRL3_REG  ==================================================== */
#define RFCU_RF_LNA_CTRL3_REG_LNA_TRIM_CGS_Pos (0UL)                /*!< RFCU RF_LNA_CTRL3_REG: LNA_TRIM_CGS (Bit 0)           */
#define RFCU_RF_LNA_CTRL3_REG_LNA_TRIM_CGS_Msk (0x1fUL)             /*!< RFCU RF_LNA_CTRL3_REG: LNA_TRIM_CGS (Bitfield-Mask: 0x1f) */
/* ===================================================  RF_LO_IQ_TRIM_REG  =================================================== */
#define RFCU_RF_LO_IQ_TRIM_REG_RF_LO_IQ_TRIM_Pos (0UL)              /*!< RFCU RF_LO_IQ_TRIM_REG: RF_LO_IQ_TRIM (Bit 0)         */
#define RFCU_RF_LO_IQ_TRIM_REG_RF_LO_IQ_TRIM_Msk (0xffffUL)         /*!< RFCU RF_LO_IQ_TRIM_REG: RF_LO_IQ_TRIM (Bitfield-Mask: 0xffff) */
/* ====================================================  RF_MGC_CTRL_REG  ==================================================== */
#define RFCU_RF_MGC_CTRL_REG_GAUSS_DAC_CTRL_Pos (2UL)               /*!< RFCU RF_MGC_CTRL_REG: GAUSS_DAC_CTRL (Bit 2)          */
#define RFCU_RF_MGC_CTRL_REG_GAUSS_DAC_CTRL_Msk (0xcUL)             /*!< RFCU RF_MGC_CTRL_REG: GAUSS_DAC_CTRL (Bitfield-Mask: 0x03) */
#define RFCU_RF_MGC_CTRL_REG_MGC_POLE_SW_Pos (1UL)                  /*!< RFCU RF_MGC_CTRL_REG: MGC_POLE_SW (Bit 1)             */
#define RFCU_RF_MGC_CTRL_REG_MGC_POLE_SW_Msk (0x2UL)                /*!< RFCU RF_MGC_CTRL_REG: MGC_POLE_SW (Bitfield-Mask: 0x01) */
#define RFCU_RF_MGC_CTRL_REG_MGC_GAIN_SET_Pos (0UL)                 /*!< RFCU RF_MGC_CTRL_REG: MGC_GAIN_SET (Bit 0)            */
#define RFCU_RF_MGC_CTRL_REG_MGC_GAIN_SET_Msk (0x1UL)               /*!< RFCU RF_MGC_CTRL_REG: MGC_GAIN_SET (Bitfield-Mask: 0x01) */
/* ================================================  RF_MIXER_CTRL1_BLE_REG  ================================================= */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_SPARE_BLE_Pos (12UL)        /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_SPARE_BLE (Bit 12)   */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_SPARE_BLE_Msk (0xf000UL)    /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_SPARE_BLE (Bitfield-Mask: 0x0f) */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_TRIM_VCM_BLE_Pos (8UL)      /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_TRIM_VCM_BLE (Bit 8) */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_TRIM_VCM_BLE_Msk (0xf00UL)  /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_TRIM_VCM_BLE (Bitfield-Mask: 0x0f) */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_TRIM_IBIAS_BLE_Pos (4UL)    /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_TRIM_IBIAS_BLE (Bit 4) */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_TRIM_IBIAS_BLE_Msk (0xf0UL) /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_TRIM_IBIAS_BLE (Bitfield-Mask: 0x0f) */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_TRIM_GMBIAS_BLE_Pos (0UL)   /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_TRIM_GMBIAS_BLE (Bit 0) */
#define RFCU_RF_MIXER_CTRL1_BLE_REG_MIX_TRIM_GMBIAS_BLE_Msk (0xfUL) /*!< RFCU RF_MIXER_CTRL1_BLE_REG: MIX_TRIM_GMBIAS_BLE (Bitfield-Mask: 0x0f) */
/* ================================================  RF_MIXER_CTRL1_FTDF_REG  ================================================ */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_SPARE_Pos (12UL)           /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_SPARE (Bit 12)      */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_SPARE_Msk (0xf000UL)       /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_SPARE (Bitfield-Mask: 0x0f) */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_TRIM_VCM_FTDF_Pos (8UL)    /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_TRIM_VCM_FTDF (Bit 8) */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_TRIM_VCM_FTDF_Msk (0xf00UL) /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_TRIM_VCM_FTDF (Bitfield-Mask: 0x0f) */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_TRIM_IBIAS_FTDF_Pos (4UL)  /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_TRIM_IBIAS_FTDF (Bit 4) */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_TRIM_IBIAS_FTDF_Msk (0xf0UL) /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_TRIM_IBIAS_FTDF (Bitfield-Mask: 0x0f) */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_TRIM_GMBIAS_FTDF_Pos (0UL) /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_TRIM_GMBIAS_FTDF (Bit 0) */
#define RFCU_RF_MIXER_CTRL1_FTDF_REG_MIX_TRIM_GMBIAS_FTDF_Msk (0xfUL) /*!< RFCU RF_MIXER_CTRL1_FTDF_REG: MIX_TRIM_GMBIAS_FTDF (Bitfield-Mask: 0x0f) */
/* ==================================================  RF_MIXER_CTRL2_REG  =================================================== */
#define RFCU_RF_MIXER_CTRL2_REG_MIX_CAL_SELECT_Pos (5UL)            /*!< RFCU RF_MIXER_CTRL2_REG: MIX_CAL_SELECT (Bit 5)       */
#define RFCU_RF_MIXER_CTRL2_REG_MIX_CAL_SELECT_Msk (0x20UL)         /*!< RFCU RF_MIXER_CTRL2_REG: MIX_CAL_SELECT (Bitfield-Mask: 0x01) */
#define RFCU_RF_MIXER_CTRL2_REG_MIX_CAL_CAP_WR_Pos (0UL)            /*!< RFCU RF_MIXER_CTRL2_REG: MIX_CAL_CAP_WR (Bit 0)       */
#define RFCU_RF_MIXER_CTRL2_REG_MIX_CAL_CAP_WR_Msk (0x1fUL)         /*!< RFCU RF_MIXER_CTRL2_REG: MIX_CAL_CAP_WR (Bitfield-Mask: 0x1f) */
/* ================================================  RF_MIX_CAL_CAP_STAT_REG  ================================================ */
#define RFCU_RF_MIX_CAL_CAP_STAT_REG_MIX_CAL_CAP_RD_Pos (0UL)       /*!< RFCU RF_MIX_CAL_CAP_STAT_REG: MIX_CAL_CAP_RD (Bit 0)  */
#define RFCU_RF_MIX_CAL_CAP_STAT_REG_MIX_CAL_CAP_RD_Msk (0x1fUL)    /*!< RFCU RF_MIX_CAL_CAP_STAT_REG: MIX_CAL_CAP_RD (Bitfield-Mask: 0x1f) */
/* ====================================================  RF_OVERRULE_REG  ==================================================== */
#define RFCU_RF_OVERRULE_REG_CN_FTDF_TIMES2_Pos (14UL)              /*!< RFCU RF_OVERRULE_REG: CN_FTDF_TIMES2 (Bit 14)         */
#define RFCU_RF_OVERRULE_REG_CN_FTDF_TIMES2_Msk (0x4000UL)          /*!< RFCU RF_OVERRULE_REG: CN_FTDF_TIMES2 (Bitfield-Mask: 0x01) */
#define RFCU_RF_OVERRULE_REG_GAUSS_DAC_SEL_Pos (12UL)               /*!< RFCU RF_OVERRULE_REG: GAUSS_DAC_SEL (Bit 12)          */
#define RFCU_RF_OVERRULE_REG_GAUSS_DAC_SEL_Msk (0x3000UL)           /*!< RFCU RF_OVERRULE_REG: GAUSS_DAC_SEL (Bitfield-Mask: 0x03) */
#define RFCU_RF_OVERRULE_REG_TXDAC_SEL_Pos (10UL)                   /*!< RFCU RF_OVERRULE_REG: TXDAC_SEL (Bit 10)              */
#define RFCU_RF_OVERRULE_REG_TXDAC_SEL_Msk (0xc00UL)                /*!< RFCU RF_OVERRULE_REG: TXDAC_SEL (Bitfield-Mask: 0x03) */
#define RFCU_RF_OVERRULE_REG_MIX_FTDF_OVR_Pos (8UL)                 /*!< RFCU RF_OVERRULE_REG: MIX_FTDF_OVR (Bit 8)            */
#define RFCU_RF_OVERRULE_REG_MIX_FTDF_OVR_Msk (0x300UL)             /*!< RFCU RF_OVERRULE_REG: MIX_FTDF_OVR (Bitfield-Mask: 0x03) */
#define RFCU_RF_OVERRULE_REG_IFF_FTDF_OVR_Pos (6UL)                 /*!< RFCU RF_OVERRULE_REG: IFF_FTDF_OVR (Bit 6)            */
#define RFCU_RF_OVERRULE_REG_IFF_FTDF_OVR_Msk (0xc0UL)              /*!< RFCU RF_OVERRULE_REG: IFF_FTDF_OVR (Bitfield-Mask: 0x03) */
#define RFCU_RF_OVERRULE_REG_RF_MODE_OVR_Pos (4UL)                  /*!< RFCU RF_OVERRULE_REG: RF_MODE_OVR (Bit 4)             */
#define RFCU_RF_OVERRULE_REG_RF_MODE_OVR_Msk (0x30UL)               /*!< RFCU RF_OVERRULE_REG: RF_MODE_OVR (Bitfield-Mask: 0x03) */
#define RFCU_RF_OVERRULE_REG_RX_EN_OVR_Pos (2UL)                    /*!< RFCU RF_OVERRULE_REG: RX_EN_OVR (Bit 2)               */
#define RFCU_RF_OVERRULE_REG_RX_EN_OVR_Msk (0xcUL)                  /*!< RFCU RF_OVERRULE_REG: RX_EN_OVR (Bitfield-Mask: 0x03) */
#define RFCU_RF_OVERRULE_REG_TX_EN_OVR_Pos (0UL)                    /*!< RFCU RF_OVERRULE_REG: TX_EN_OVR (Bit 0)               */
#define RFCU_RF_OVERRULE_REG_TX_EN_OVR_Msk (0x3UL)                  /*!< RFCU RF_OVERRULE_REG: TX_EN_OVR (Bitfield-Mask: 0x03) */
/* ====================================================  RF_PA_CTRL_REG  ===================================================== */
#define RFCU_RF_PA_CTRL_REG_LEVEL_LDO_RFPA_Pos (11UL)               /*!< RFCU RF_PA_CTRL_REG: LEVEL_LDO_RFPA (Bit 11)          */
#define RFCU_RF_PA_CTRL_REG_LEVEL_LDO_RFPA_Msk (0x7800UL)           /*!< RFCU RF_PA_CTRL_REG: LEVEL_LDO_RFPA (Bitfield-Mask: 0x0f) */
#define RFCU_RF_PA_CTRL_REG_PA_RAMPSPEED_Pos (5UL)                  /*!< RFCU RF_PA_CTRL_REG: PA_RAMPSPEED (Bit 5)             */
#define RFCU_RF_PA_CTRL_REG_PA_RAMPSPEED_Msk (0x60UL)               /*!< RFCU RF_PA_CTRL_REG: PA_RAMPSPEED (Bitfield-Mask: 0x03) */
/* ====================================================  RF_PFD_CTRL_REG  ==================================================== */
#define RFCU_RF_PFD_CTRL_REG_PFD_POLARITY_Pos (3UL)                 /*!< RFCU RF_PFD_CTRL_REG: PFD_POLARITY (Bit 3)            */
#define RFCU_RF_PFD_CTRL_REG_PFD_POLARITY_Msk (0x8UL)               /*!< RFCU RF_PFD_CTRL_REG: PFD_POLARITY (Bitfield-Mask: 0x01) */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_EN_Pos (2UL)                 /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_EN (Bit 2)            */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_EN_Msk (0x4UL)               /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_EN (Bitfield-Mask: 0x01) */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_SET_Pos (0UL)                /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_SET (Bit 0)           */
#define RFCU_RF_PFD_CTRL_REG_FIXED_CUR_SET_Msk (0x3UL)              /*!< RFCU RF_PFD_CTRL_REG: FIXED_CUR_SET (Bitfield-Mask: 0x03) */
/* ==================================================  RF_REF_OSC_BLE_REG  =================================================== */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_CLK_Pos (6UL)                   /*!< RFCU RF_REF_OSC_BLE_REG: CNT_CLK (Bit 6)              */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_CLK_Msk (0x7fc0UL)              /*!< RFCU RF_REF_OSC_BLE_REG: CNT_CLK (Bitfield-Mask: 0x1ff) */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_RO_Pos (0UL)                    /*!< RFCU RF_REF_OSC_BLE_REG: CNT_RO (Bit 0)               */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_RO_Msk (0x3fUL)                 /*!< RFCU RF_REF_OSC_BLE_REG: CNT_RO (Bitfield-Mask: 0x3f) */
/* ==================================================  RF_REF_OSC_FTDF_REG  ================================================== */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_CLK_Pos (6UL)                  /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_CLK (Bit 6)             */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_CLK_Msk (0x7fc0UL)             /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_CLK (Bitfield-Mask: 0x1ff) */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_RO_Pos (0UL)                   /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_RO (Bit 0)              */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_RO_Msk (0x3fUL)                /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_RO (Bitfield-Mask: 0x3f) */
/* =================================================  RF_SCAN_FEEDBACK_REG  ================================================== */
#define RFCU_RF_SCAN_FEEDBACK_REG_CP_CUR_Pos (4UL)                  /*!< RFCU RF_SCAN_FEEDBACK_REG: CP_CUR (Bit 4)             */
#define RFCU_RF_SCAN_FEEDBACK_REG_CP_CUR_Msk (0xf0UL)               /*!< RFCU RF_SCAN_FEEDBACK_REG: CP_CUR (Bitfield-Mask: 0x0f) */
#define RFCU_RF_SCAN_FEEDBACK_REG_LF_RES_Pos (0UL)                  /*!< RFCU RF_SCAN_FEEDBACK_REG: LF_RES (Bit 0)             */
#define RFCU_RF_SCAN_FEEDBACK_REG_LF_RES_Msk (0xfUL)                /*!< RFCU RF_SCAN_FEEDBACK_REG: LF_RES (Bitfield-Mask: 0x0f) */
/* ===================================================  RF_SPARE1_BLE_REG  =================================================== */
#define RFCU_RF_SPARE1_BLE_REG_VCO_AMPL_SET_TX_Pos (8UL)            /*!< RFCU RF_SPARE1_BLE_REG: VCO_AMPL_SET_TX (Bit 8)       */
#define RFCU_RF_SPARE1_BLE_REG_VCO_AMPL_SET_TX_Msk (0xff00UL)       /*!< RFCU RF_SPARE1_BLE_REG: VCO_AMPL_SET_TX (Bitfield-Mask: 0xff) */
#define RFCU_RF_SPARE1_BLE_REG_RFCU_TXRX_EN_OLD_Pos (7UL)           /*!< RFCU RF_SPARE1_BLE_REG: RFCU_TXRX_EN_OLD (Bit 7)      */
#define RFCU_RF_SPARE1_BLE_REG_RFCU_TXRX_EN_OLD_Msk (0x80UL)        /*!< RFCU RF_SPARE1_BLE_REG: RFCU_TXRX_EN_OLD (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_BLE_REG_RF_VTUNE_TO_ADC_TEST_EN_Pos (2UL)    /*!< RFCU RF_SPARE1_BLE_REG: RF_VTUNE_TO_ADC_TEST_EN (Bit 2) */
#define RFCU_RF_SPARE1_BLE_REG_RF_VTUNE_TO_ADC_TEST_EN_Msk (0x4UL)  /*!< RFCU RF_SPARE1_BLE_REG: RF_VTUNE_TO_ADC_TEST_EN (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_PLL_DXTAL16_TEST_Pos (1UL)   /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_PLL_DXTAL16_TEST (Bit 1) */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_PLL_DXTAL16_TEST_Msk (0x2UL) /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_PLL_DXTAL16_TEST (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_RFCLK_TEST_Pos (0UL)         /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_RFCLK_TEST (Bit 0)    */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_RFCLK_TEST_Msk (0x1UL)       /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_RFCLK_TEST (Bitfield-Mask: 0x01) */
/* ==================================================  RF_SPARE1_FTDF_REG  =================================================== */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_SAT_TO_ZERO_Pos (15UL)      /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_SAT_TO_ZERO (Bit 15) */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_SAT_TO_ZERO_Msk (0x8000UL)  /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_SAT_TO_ZERO (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_WRAP_Pos (14UL)             /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_WRAP (Bit 14)        */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_WRAP_Msk (0x4000UL)         /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_WRAP (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_VCO_COARSECAL_DELAY_Pos (12UL)      /*!< RFCU RF_SPARE1_FTDF_REG: VCO_COARSECAL_DELAY (Bit 12) */
#define RFCU_RF_SPARE1_FTDF_REG_VCO_COARSECAL_DELAY_Msk (0x3000UL)  /*!< RFCU RF_SPARE1_FTDF_REG: VCO_COARSECAL_DELAY (Bitfield-Mask: 0x03) */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_AFC_ACTIVATION_MODE_Pos (11UL)  /*!< RFCU RF_SPARE1_FTDF_REG: DEM_AFC_ACTIVATION_MODE (Bit 11) */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_AFC_ACTIVATION_MODE_Msk (0x800UL) /*!< RFCU RF_SPARE1_FTDF_REG: DEM_AFC_ACTIVATION_MODE (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_RF_VTUNE_TO_ADC_TEST_EN_Pos (2UL)   /*!< RFCU RF_SPARE1_FTDF_REG: RF_VTUNE_TO_ADC_TEST_EN (Bit 2) */
#define RFCU_RF_SPARE1_FTDF_REG_RF_VTUNE_TO_ADC_TEST_EN_Msk (0x4UL) /*!< RFCU RF_SPARE1_FTDF_REG: RF_VTUNE_TO_ADC_TEST_EN (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_PLL_DXTAL16_TEST_Pos (1UL)  /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_PLL_DXTAL16_TEST (Bit 1) */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_PLL_DXTAL16_TEST_Msk (0x2UL) /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_PLL_DXTAL16_TEST (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_RFCLK_TEST_Pos (0UL)        /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_RFCLK_TEST (Bit 0)   */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_RFCLK_TEST_Msk (0x1UL)      /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_RFCLK_TEST (Bitfield-Mask: 0x01) */
