S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ====================================================  RF_TDC_CTRL_REG  ==================================================== */
#define RFCU_RF_TDC_CTRL_REG_TDC_CONNECT_Pos (12UL)                 /*!< RFCU RF_TDC_CTRL_REG: TDC_CONNECT (Bit 12)            */
#define RFCU_RF_TDC_CTRL_REG_TDC_CONNECT_Msk (0x1000UL)             /*!< RFCU RF_TDC_CTRL_REG: TDC_CONNECT (Bitfield-Mask: 0x01) */
#define RFCU_RF_TDC_CTRL_REG_REF_CTRL_Pos (10UL)                    /*!< RFCU RF_TDC_CTRL_REG: REF_CTRL (Bit 10)               */
#define RFCU_RF_TDC_CTRL_REG_REF_CTRL_Msk (0xc00UL)                 /*!< RFCU RF_TDC_CTRL_REG: REF_CTRL (Bitfield-Mask: 0x03)  */
#define RFCU_RF_TDC_CTRL_REG_CAL_PH_2_Pos (9UL)                     /*!< RFCU RF_TDC_CTRL_REG: CAL_PH_2 (Bit 9)                */
#define RFCU_RF_TDC_CTRL_REG_CAL_PH_2_Msk (0x200UL)                 /*!< RFCU RF_TDC_CTRL_REG: CAL_PH_2 (Bitfield-Mask: 0x01)  */
#define RFCU_RF_TDC_CTRL_REG_CAL_PH_1_Pos (8UL)                     /*!< RFCU RF_TDC_CTRL_REG: CAL_PH_1 (Bit 8)                */
#define RFCU_RF_TDC_CTRL_REG_CAL_PH_1_Msk (0x100UL)                 /*!< RFCU RF_TDC_CTRL_REG: CAL_PH_1 (Bitfield-Mask: 0x01)  */
#define RFCU_RF_TDC_CTRL_REG_CTRL_SLOW_Pos (4UL)                    /*!< RFCU RF_TDC_CTRL_REG: CTRL_SLOW (Bit 4)               */
#define RFCU_RF_TDC_CTRL_REG_CTRL_SLOW_Msk (0xf0UL)                 /*!< RFCU RF_TDC_CTRL_REG: CTRL_SLOW (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TDC_CTRL_REG_CTRL_FAST_Pos (0UL)                    /*!< RFCU RF_TDC_CTRL_REG: CTRL_FAST (Bit 0)               */
#define RFCU_RF_TDC_CTRL_REG_CTRL_FAST_Msk (0xfUL)                  /*!< RFCU RF_TDC_CTRL_REG: CTRL_FAST (Bitfield-Mask: 0x0f) */
/* ===================================================  RF_TXDAC_CTRL_REG  =================================================== */
#define RFCU_RF_TXDAC_CTRL_REG_TXDAC_CAP_SEL_Pos (0UL)              /*!< RFCU RF_TXDAC_CTRL_REG: TXDAC_CAP_SEL (Bit 0)         */
#define RFCU_RF_TXDAC_CTRL_REG_TXDAC_CAP_SEL_Msk (0xfUL)            /*!< RFCU RF_TXDAC_CTRL_REG: TXDAC_CAP_SEL (Bitfield-Mask: 0x0f) */
/* ==================================================  RF_TX_PWR_LUT_1_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_1_REG_TX_PWR_RF_LNA_CTRL3_REG_Pos (6UL)  /*!< RFCU RF_TX_PWR_LUT_1_REG: TX_PWR_RF_LNA_CTRL3_REG (Bit 6) */
#define RFCU_RF_TX_PWR_LUT_1_REG_TX_PWR_RF_LNA_CTRL3_REG_Msk (0x7c0UL) /*!< RFCU RF_TX_PWR_LUT_1_REG: TX_PWR_RF_LNA_CTRL3_REG (Bitfield-Mask: 0x1f) */
#define RFCU_RF_TX_PWR_LUT_1_REG_TX_PWR_RF_PA_CTRL_REG_Pos (2UL)    /*!< RFCU RF_TX_PWR_LUT_1_REG: TX_PWR_RF_PA_CTRL_REG (Bit 2) */
#define RFCU_RF_TX_PWR_LUT_1_REG_TX_PWR_RF_PA_CTRL_REG_Msk (0x3cUL) /*!< RFCU RF_TX_PWR_LUT_1_REG: TX_PWR_RF_PA_CTRL_REG (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TX_PWR_LUT_1_REG_TX_PWR_RF_IO_CTRL1_REG_Pos (0UL)   /*!< RFCU RF_TX_PWR_LUT_1_REG: TX_PWR_RF_IO_CTRL1_REG (Bit 0) */
#define RFCU_RF_TX_PWR_LUT_1_REG_TX_PWR_RF_IO_CTRL1_REG_Msk (0x3UL) /*!< RFCU RF_TX_PWR_LUT_1_REG: TX_PWR_RF_IO_CTRL1_REG (Bitfield-Mask: 0x03) */
/* ==================================================  RF_TX_PWR_LUT_2_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_2_REG_TX_PWR_RF_LNA_CTRL3_REG_Pos (6UL)  /*!< RFCU RF_TX_PWR_LUT_2_REG: TX_PWR_RF_LNA_CTRL3_REG (Bit 6) */
#define RFCU_RF_TX_PWR_LUT_2_REG_TX_PWR_RF_LNA_CTRL3_REG_Msk (0x7c0UL) /*!< RFCU RF_TX_PWR_LUT_2_REG: TX_PWR_RF_LNA_CTRL3_REG (Bitfield-Mask: 0x1f) */
#define RFCU_RF_TX_PWR_LUT_2_REG_TX_PWR_RF_PA_CTRL_REG_Pos (2UL)    /*!< RFCU RF_TX_PWR_LUT_2_REG: TX_PWR_RF_PA_CTRL_REG (Bit 2) */
#define RFCU_RF_TX_PWR_LUT_2_REG_TX_PWR_RF_PA_CTRL_REG_Msk (0x3cUL) /*!< RFCU RF_TX_PWR_LUT_2_REG: TX_PWR_RF_PA_CTRL_REG (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TX_PWR_LUT_2_REG_TX_PWR_RF_IO_CTRL1_REG_Pos (0UL)   /*!< RFCU RF_TX_PWR_LUT_2_REG: TX_PWR_RF_IO_CTRL1_REG (Bit 0) */
#define RFCU_RF_TX_PWR_LUT_2_REG_TX_PWR_RF_IO_CTRL1_REG_Msk (0x3UL) /*!< RFCU RF_TX_PWR_LUT_2_REG: TX_PWR_RF_IO_CTRL1_REG (Bitfield-Mask: 0x03) */
/* ==================================================  RF_TX_PWR_LUT_3_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_3_REG_TX_PWR_RF_LNA_CTRL3_REG_Pos (6UL)  /*!< RFCU RF_TX_PWR_LUT_3_REG: TX_PWR_RF_LNA_CTRL3_REG (Bit 6) */
#define RFCU_RF_TX_PWR_LUT_3_REG_TX_PWR_RF_LNA_CTRL3_REG_Msk (0x7c0UL) /*!< RFCU RF_TX_PWR_LUT_3_REG: TX_PWR_RF_LNA_CTRL3_REG (Bitfield-Mask: 0x1f) */
#define RFCU_RF_TX_PWR_LUT_3_REG_TX_PWR_RF_PA_CTRL_REG_Pos (2UL)    /*!< RFCU RF_TX_PWR_LUT_3_REG: TX_PWR_RF_PA_CTRL_REG (Bit 2) */
#define RFCU_RF_TX_PWR_LUT_3_REG_TX_PWR_RF_PA_CTRL_REG_Msk (0x3cUL) /*!< RFCU RF_TX_PWR_LUT_3_REG: TX_PWR_RF_PA_CTRL_REG (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TX_PWR_LUT_3_REG_TX_PWR_RF_IO_CTRL1_REG_Pos (0UL)   /*!< RFCU RF_TX_PWR_LUT_3_REG: TX_PWR_RF_IO_CTRL1_REG (Bit 0) */
#define RFCU_RF_TX_PWR_LUT_3_REG_TX_PWR_RF_IO_CTRL1_REG_Msk (0x3UL) /*!< RFCU RF_TX_PWR_LUT_3_REG: TX_PWR_RF_IO_CTRL1_REG (Bitfield-Mask: 0x03) */
/* ==================================================  RF_TX_PWR_LUT_4_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_4_REG_TX_PWR_RF_LNA_CTRL3_REG_Pos (6UL)  /*!< RFCU RF_TX_PWR_LUT_4_REG: TX_PWR_RF_LNA_CTRL3_REG (Bit 6) */
#define RFCU_RF_TX_PWR_LUT_4_REG_TX_PWR_RF_LNA_CTRL3_REG_Msk (0x7c0UL) /*!< RFCU RF_TX_PWR_LUT_4_REG: TX_PWR_RF_LNA_CTRL3_REG (Bitfield-Mask: 0x1f) */
#define RFCU_RF_TX_PWR_LUT_4_REG_TX_PWR_RF_PA_CTRL_REG_Pos (2UL)    /*!< RFCU RF_TX_PWR_LUT_4_REG: TX_PWR_RF_PA_CTRL_REG (Bit 2) */
#define RFCU_RF_TX_PWR_LUT_4_REG_TX_PWR_RF_PA_CTRL_REG_Msk (0x3cUL) /*!< RFCU RF_TX_PWR_LUT_4_REG: TX_PWR_RF_PA_CTRL_REG (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TX_PWR_LUT_4_REG_TX_PWR_RF_IO_CTRL1_REG_Pos (0UL)   /*!< RFCU RF_TX_PWR_LUT_4_REG: TX_PWR_RF_IO_CTRL1_REG (Bit 0) */
#define RFCU_RF_TX_PWR_LUT_4_REG_TX_PWR_RF_IO_CTRL1_REG_Msk (0x3UL) /*!< RFCU RF_TX_PWR_LUT_4_REG: TX_PWR_RF_IO_CTRL1_REG (Bitfield-Mask: 0x03) */
/* ==================================================  RF_TX_PWR_LUT_5_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_5_REG_TX_PWR_RF_LNA_CTRL3_REG_Pos (6UL)  /*!< RFCU RF_TX_PWR_LUT_5_REG: TX_PWR_RF_LNA_CTRL3_REG (Bit 6) */
#define RFCU_RF_TX_PWR_LUT_5_REG_TX_PWR_RF_LNA_CTRL3_REG_Msk (0x7c0UL) /*!< RFCU RF_TX_PWR_LUT_5_REG: TX_PWR_RF_LNA_CTRL3_REG (Bitfield-Mask: 0x1f) */
#define RFCU_RF_TX_PWR_LUT_5_REG_TX_PWR_RF_PA_CTRL_REG_Pos (2UL)    /*!< RFCU RF_TX_PWR_LUT_5_REG: TX_PWR_RF_PA_CTRL_REG (Bit 2) */
#define RFCU_RF_TX_PWR_LUT_5_REG_TX_PWR_RF_PA_CTRL_REG_Msk (0x3cUL) /*!< RFCU RF_TX_PWR_LUT_5_REG: TX_PWR_RF_PA_CTRL_REG (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TX_PWR_LUT_5_REG_TX_PWR_RF_IO_CTRL1_REG_Pos (0UL)   /*!< RFCU RF_TX_PWR_LUT_5_REG: TX_PWR_RF_IO_CTRL1_REG (Bit 0) */
#define RFCU_RF_TX_PWR_LUT_5_REG_TX_PWR_RF_IO_CTRL1_REG_Msk (0x3UL) /*!< RFCU RF_TX_PWR_LUT_5_REG: TX_PWR_RF_IO_CTRL1_REG (Bitfield-Mask: 0x03) */
/* ==================================================  RF_TX_PWR_LUT_6_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_6_REG_TX_PWR_RF_LNA_CTRL3_REG_Pos (6UL)  /*!< RFCU RF_TX_PWR_LUT_6_REG: TX_PWR_RF_LNA_CTRL3_REG (Bit 6) */
#define RFCU_RF_TX_PWR_LUT_6_REG_TX_PWR_RF_LNA_CTRL3_REG_Msk (0x7c0UL) /*!< RFCU RF_TX_PWR_LUT_6_REG: TX_PWR_RF_LNA_CTRL3_REG (Bitfield-Mask: 0x1f) */
#define RFCU_RF_TX_PWR_LUT_6_REG_TX_PWR_RF_PA_CTRL_REG_Pos (2UL)    /*!< RFCU RF_TX_PWR_LUT_6_REG: TX_PWR_RF_PA_CTRL_REG (Bit 2) */
#define RFCU_RF_TX_PWR_LUT_6_REG_TX_PWR_RF_PA_CTRL_REG_Msk (0x3cUL) /*!< RFCU RF_TX_PWR_LUT_6_REG: TX_PWR_RF_PA_CTRL_REG (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TX_PWR_LUT_6_REG_TX_PWR_RF_IO_CTRL1_REG_Pos (0UL)   /*!< RFCU RF_TX_PWR_LUT_6_REG: TX_PWR_RF_IO_CTRL1_REG (Bit 0) */
#define RFCU_RF_TX_PWR_LUT_6_REG_TX_PWR_RF_IO_CTRL1_REG_Msk (0x3UL) /*!< RFCU RF_TX_PWR_LUT_6_REG: TX_PWR_RF_IO_CTRL1_REG (Bitfield-Mask: 0x03) */
/* ==================================================  RF_TX_PWR_LUT_7_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_7_REG_TX_PWR_RF_LNA_CTRL3_REG_Pos (6UL)  /*!< RFCU RF_TX_PWR_LUT_7_REG: TX_PWR_RF_LNA_CTRL3_REG (Bit 6) */
#define RFCU_RF_TX_PWR_LUT_7_REG_TX_PWR_RF_LNA_CTRL3_REG_Msk (0x7c0UL) /*!< RFCU RF_TX_PWR_LUT_7_REG: TX_PWR_RF_LNA_CTRL3_REG (Bitfield-Mask: 0x1f) */
#define RFCU_RF_TX_PWR_LUT_7_REG_TX_PWR_RF_PA_CTRL_REG_Pos (2UL)    /*!< RFCU RF_TX_PWR_LUT_7_REG: TX_PWR_RF_PA_CTRL_REG (Bit 2) */
#define RFCU_RF_TX_PWR_LUT_7_REG_TX_PWR_RF_PA_CTRL_REG_Msk (0x3cUL) /*!< RFCU RF_TX_PWR_LUT_7_REG: TX_PWR_RF_PA_CTRL_REG (Bitfield-Mask: 0x0f) */
#define RFCU_RF_TX_PWR_LUT_7_REG_TX_PWR_RF_IO_CTRL1_REG_Pos (0UL)   /*!< RFCU RF_TX_PWR_LUT_7_REG: TX_PWR_RF_IO_CTRL1_REG (Bit 0) */
#define RFCU_RF_TX_PWR_LUT_7_REG_TX_PWR_RF_IO_CTRL1_REG_Msk (0x3UL) /*!< RFCU RF_TX_PWR_LUT_7_REG: TX_PWR_RF_IO_CTRL1_REG (Bitfield-Mask: 0x03) */
/* =================================================  RF_TX_PWR_LUT_RD_REG  ================================================== */
#define RFCU_RF_TX_PWR_LUT_RD_REG_RF_TX_PWR_LUT_RD_Pos (0UL)        /*!< RFCU RF_TX_PWR_LUT_RD_REG: RF_TX_PWR_LUT_RD (Bit 0)   */
#define RFCU_RF_TX_PWR_LUT_RD_REG_RF_TX_PWR_LUT_RD_Msk (0x7ffUL)    /*!< RFCU RF_TX_PWR_LUT_RD_REG: RF_TX_PWR_LUT_RD (Bitfield-Mask: 0x7ff) */
/* =====================================================  RF_TX_PWR_REG  ===================================================== */
#define RFCU_RF_TX_PWR_REG_TX_POWER_SET_Pos (0UL)                   /*!< RFCU RF_TX_PWR_REG: TX_POWER_SET (Bit 0)              */
#define RFCU_RF_TX_PWR_REG_TX_POWER_SET_Msk (0x7UL)                 /*!< RFCU RF_TX_PWR_REG: TX_POWER_SET (Bitfield-Mask: 0x07) */
/* ==================================================  RF_VCOVAR_CTRL_REG  =================================================== */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V1_Pos (14UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V1 (Bit 14)          */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V1_Msk (0xc000UL)           /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V1 (Bitfield-Mask: 0x03) */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V0_Pos (12UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V0 (Bit 12)          */
#define RFCU_RF_VCOVAR_CTRL_REG_MOD_VAR_V0_Msk (0x3000UL)           /*!< RFCU RF_VCOVAR_CTRL_REG: MOD_VAR_V0 (Bitfield-Mask: 0x03) */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V3_Pos (9UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V3 (Bit 9)          */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V3_Msk (0xe00UL)           /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V3 (Bitfield-Mask: 0x07) */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V2_Pos (6UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V2 (Bit 6)          */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V2_Msk (0x1c0UL)           /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V2 (Bitfield-Mask: 0x07) */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V1_Pos (3UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V1 (Bit 3)          */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V1_Msk (0x38UL)            /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V1 (Bitfield-Mask: 0x07) */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V0_Pos (0UL)               /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V0 (Bit 0)          */
#define RFCU_RF_VCOVAR_CTRL_REG_TUNE_VAR_V0_Msk (0x7UL)             /*!< RFCU RF_VCOVAR_CTRL_REG: TUNE_VAR_V0 (Bitfield-Mask: 0x07) */
/* ====================================================  RF_VCO_CTRL_REG  ==================================================== */
#define RFCU_RF_VCO_CTRL_REG_VCO_AMPL_MODE_Pos (8UL)                /*!< RFCU RF_VCO_CTRL_REG: VCO_AMPL_MODE (Bit 8)           */
#define RFCU_RF_VCO_CTRL_REG_VCO_AMPL_MODE_Msk (0x7f00UL)           /*!< RFCU RF_VCO_CTRL_REG: VCO_AMPL_MODE (Bitfield-Mask: 0x7f) */
#define RFCU_RF_VCO_CTRL_REG_VCO_AMPL_SET_Pos (0UL)                 /*!< RFCU RF_VCO_CTRL_REG: VCO_AMPL_SET (Bit 0)            */
#define RFCU_RF_VCO_CTRL_REG_VCO_AMPL_SET_Msk (0xffUL)              /*!< RFCU RF_VCO_CTRL_REG: VCO_AMPL_SET (Bitfield-Mask: 0xff) */


/* =========================================================================================================================== */
/* ================                                        RFCU_POWER                                         ================ */
/* =========================================================================================================================== */

