S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define RFCU_POWER_RF_CNTRL_TIMER_22_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_22_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_23_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_23_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_23_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_23_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_23_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_23_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_23_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_23_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_23_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_24_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_24_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_24_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_24_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_24_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_24_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_24_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_24_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_24_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_25_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_25_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_25_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_25_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_25_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_25_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_25_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_25_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_25_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_26_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_26_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_26_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_26_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_26_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_26_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_26_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_26_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_26_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_27_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_27_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_27_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_27_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_27_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_27_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_27_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_27_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_27_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_28_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_28_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_28_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_28_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_28_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_28_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_28_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_28_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_28_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_29_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_29_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_29_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_29_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_29_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_29_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_29_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_29_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_29_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_2_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_2_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_2_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_2_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_2_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_2_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_2_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_2_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_2_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_30_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_30_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_30_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_30_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_30_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_30_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_30_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_30_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_30_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_31_REG  ================================================= */
#define RFCU_POWER_RF_CNTRL_TIMER_31_REG_RESET_OFFSET_Pos (8UL)     /*!< RFCU_POWER RF_CNTRL_TIMER_31_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_31_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_31_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_31_REG_SET_OFFSET_Pos (0UL)       /*!< RFCU_POWER RF_CNTRL_TIMER_31_REG: SET_OFFSET (Bit 0)  */
#define RFCU_POWER_RF_CNTRL_TIMER_31_REG_SET_OFFSET_Msk (0xffUL)    /*!< RFCU_POWER RF_CNTRL_TIMER_31_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_3_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_3_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_3_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_3_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_3_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_3_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_3_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_3_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_3_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_4_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_4_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_4_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_4_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_4_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_4_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_4_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_4_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_4_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_5_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_5_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_5_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_5_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_5_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_5_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_5_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_5_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_5_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_6_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_6_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_6_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_6_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_6_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_6_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_6_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_6_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_6_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_7_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_7_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_7_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_7_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_7_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_7_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_7_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_7_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_7_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_8_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_8_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_8_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_8_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_8_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_8_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_8_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_8_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_8_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* =================================================  RF_CNTRL_TIMER_9_REG  ================================================== */
#define RFCU_POWER_RF_CNTRL_TIMER_9_REG_RESET_OFFSET_Pos (8UL)      /*!< RFCU_POWER RF_CNTRL_TIMER_9_REG: RESET_OFFSET (Bit 8) */
#define RFCU_POWER_RF_CNTRL_TIMER_9_REG_RESET_OFFSET_Msk (0xff00UL) /*!< RFCU_POWER RF_CNTRL_TIMER_9_REG: RESET_OFFSET (Bitfield-Mask: 0xff) */
#define RFCU_POWER_RF_CNTRL_TIMER_9_REG_SET_OFFSET_Pos (0UL)        /*!< RFCU_POWER RF_CNTRL_TIMER_9_REG: SET_OFFSET (Bit 0)   */
#define RFCU_POWER_RF_CNTRL_TIMER_9_REG_SET_OFFSET_Msk (0xffUL)     /*!< RFCU_POWER RF_CNTRL_TIMER_9_REG: SET_OFFSET (Bitfield-Mask: 0xff) */
/* ===============================================  RF_ENABLE_CONFIG0_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG0_BLE_REG_lna_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_BLE_REG: lna_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG0_BLE_REG_lna_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_BLE_REG: lna_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG0_BLE_REG_lna_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_BLE_REG: lna_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG0_BLE_REG_lna_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_BLE_REG: lna_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG0_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG0_FTDF_REG_lna_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_FTDF_REG: lna_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG0_FTDF_REG_lna_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_FTDF_REG: lna_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG0_FTDF_REG_lna_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_FTDF_REG: lna_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG0_FTDF_REG_lna_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG0_FTDF_REG: lna_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG10_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG10_BLE_REG_cp_switch_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_BLE_REG: cp_switch_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG10_BLE_REG_cp_switch_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_BLE_REG: cp_switch_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG10_BLE_REG_cp_switch_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_BLE_REG: cp_switch_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG10_BLE_REG_cp_switch_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_BLE_REG: cp_switch_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG10_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG10_FTDF_REG_cp_switch_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_FTDF_REG: cp_switch_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG10_FTDF_REG_cp_switch_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_FTDF_REG: cp_switch_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG10_FTDF_REG_cp_switch_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_FTDF_REG: cp_switch_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG10_FTDF_REG_cp_switch_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG10_FTDF_REG: cp_switch_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG11_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG11_BLE_REG_vco_bias_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_BLE_REG: vco_bias_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG11_BLE_REG_vco_bias_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_BLE_REG: vco_bias_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG11_BLE_REG_vco_bias_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_BLE_REG: vco_bias_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG11_BLE_REG_vco_bias_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_BLE_REG: vco_bias_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG11_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG11_FTDF_REG_vco_bias_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_FTDF_REG: vco_bias_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG11_FTDF_REG_vco_bias_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_FTDF_REG: vco_bias_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG11_FTDF_REG_vco_bias_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_FTDF_REG: vco_bias_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG11_FTDF_REG_vco_bias_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG11_FTDF_REG: vco_bias_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG12_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG12_BLE_REG_cp_bias_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_BLE_REG: cp_bias_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG12_BLE_REG_cp_bias_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_BLE_REG: cp_bias_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG12_BLE_REG_cp_bias_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_BLE_REG: cp_bias_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG12_BLE_REG_cp_bias_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_BLE_REG: cp_bias_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG12_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG12_FTDF_REG_cp_bias_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_FTDF_REG: cp_bias_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG12_FTDF_REG_cp_bias_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_FTDF_REG: cp_bias_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG12_FTDF_REG_cp_bias_en_tfdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_FTDF_REG: cp_bias_en_tfdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG12_FTDF_REG_cp_bias_en_tfdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG12_FTDF_REG: cp_bias_en_tfdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG13_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG13_BLE_REG_lna_ldo_zero_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_BLE_REG: lna_ldo_zero_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG13_BLE_REG_lna_ldo_zero_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_BLE_REG: lna_ldo_zero_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG13_BLE_REG_lna_ldo_zero_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_BLE_REG: lna_ldo_zero_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG13_BLE_REG_lna_ldo_zero_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_BLE_REG: lna_ldo_zero_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG13_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG13_FTDF_REG_lna_ldo_zero_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_FTDF_REG: lna_ldo_zero_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG13_FTDF_REG_lna_ldo_zero_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_FTDF_REG: lna_ldo_zero_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG13_FTDF_REG_lna_ldo_zero_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_FTDF_REG: lna_ldo_zero_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG13_FTDF_REG_lna_ldo_zero_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG13_FTDF_REG: lna_ldo_zero_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG14_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG14_BLE_REG_pa_ramp_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_BLE_REG: pa_ramp_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG14_BLE_REG_pa_ramp_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_BLE_REG: pa_ramp_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG14_BLE_REG_pa_ramp_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_BLE_REG: pa_ramp_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG14_BLE_REG_pa_ramp_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_BLE_REG: pa_ramp_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG14_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG14_FTDF_REG_pa_ramp_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_FTDF_REG: pa_ramp_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG14_FTDF_REG_pa_ramp_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_FTDF_REG: pa_ramp_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG14_FTDF_REG_pa_ramp_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_FTDF_REG: pa_ramp_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG14_FTDF_REG_pa_ramp_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG14_FTDF_REG: pa_ramp_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG15_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG15_BLE_REG_pa_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_BLE_REG: pa_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG15_BLE_REG_pa_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_BLE_REG: pa_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG15_BLE_REG_pa_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_BLE_REG: pa_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG15_BLE_REG_pa_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_BLE_REG: pa_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG15_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG15_FTDF_REG_pa_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_FTDF_REG: pa_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG15_FTDF_REG_pa_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_FTDF_REG: pa_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG15_FTDF_REG_pa_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_FTDF_REG: pa_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG15_FTDF_REG_pa_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG15_FTDF_REG: pa_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG16_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG16_BLE_REG_mix_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_BLE_REG: mix_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG16_BLE_REG_mix_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_BLE_REG: mix_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG16_BLE_REG_mix_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_BLE_REG: mix_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG16_BLE_REG_mix_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_BLE_REG: mix_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG16_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG16_FTDF_REG_mix_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_FTDF_REG: mix_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG16_FTDF_REG_mix_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_FTDF_REG: mix_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
