S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define RFCU_POWER_RF_ENABLE_CONFIG16_FTDF_REG_mix_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_FTDF_REG: mix_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG16_FTDF_REG_mix_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG16_FTDF_REG: mix_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG17_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG17_BLE_REG_iff_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_BLE_REG: iff_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG17_BLE_REG_iff_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_BLE_REG: iff_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG17_BLE_REG_iff_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_BLE_REG: iff_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG17_BLE_REG_iff_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_BLE_REG: iff_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG17_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG17_FTDF_REG_iff_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_FTDF_REG: iff_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG17_FTDF_REG_iff_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_FTDF_REG: iff_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG17_FTDF_REG_iff_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_FTDF_REG: iff_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG17_FTDF_REG_iff_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG17_FTDF_REG: iff_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG18_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG18_BLE_REG_adc_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_BLE_REG: adc_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG18_BLE_REG_adc_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_BLE_REG: adc_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG18_BLE_REG_adc_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_BLE_REG: adc_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG18_BLE_REG_adc_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_BLE_REG: adc_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG18_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG18_FTDF_REG_adc_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_FTDF_REG: adc_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG18_FTDF_REG_adc_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_FTDF_REG: adc_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG18_FTDF_REG_adc_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_FTDF_REG: adc_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG18_FTDF_REG_adc_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG18_FTDF_REG: adc_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG19_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG19_BLE_REG_vco_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_BLE_REG: vco_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG19_BLE_REG_vco_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_BLE_REG: vco_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG19_BLE_REG_vco_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_BLE_REG: vco_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG19_BLE_REG_vco_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_BLE_REG: vco_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG19_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG19_FTDF_REG_vco_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_FTDF_REG: vco_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG19_FTDF_REG_vco_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_FTDF_REG: vco_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG19_FTDF_REG_vco_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_FTDF_REG: vco_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG19_FTDF_REG_vco_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG19_FTDF_REG: vco_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG1_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG1_BLE_REG_lna_core_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_BLE_REG: lna_core_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG1_BLE_REG_lna_core_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_BLE_REG: lna_core_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG1_BLE_REG_lna_core_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_BLE_REG: lna_core_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG1_BLE_REG_lna_core_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_BLE_REG: lna_core_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG1_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG1_FTDF_REG_lna_core_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_FTDF_REG: lna_core_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG1_FTDF_REG_lna_core_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_FTDF_REG: lna_core_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG1_FTDF_REG_lna_core_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_FTDF_REG: lna_core_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG1_FTDF_REG_lna_core_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG1_FTDF_REG: lna_core_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG20_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG20_BLE_REG_lobuf_md_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_BLE_REG: lobuf_md_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG20_BLE_REG_lobuf_md_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_BLE_REG: lobuf_md_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG20_BLE_REG_lobuf_md_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_BLE_REG: lobuf_md_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG20_BLE_REG_lobuf_md_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_BLE_REG: lobuf_md_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG20_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG20_FTDF_REG_lobuf_md_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_FTDF_REG: lobuf_md_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG20_FTDF_REG_lobuf_md_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_FTDF_REG: lobuf_md_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG20_FTDF_REG_lobuf_md_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_FTDF_REG: lobuf_md_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG20_FTDF_REG_lobuf_md_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG20_FTDF_REG: lobuf_md_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG21_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG21_BLE_REG_cp_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_BLE_REG: cp_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG21_BLE_REG_cp_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_BLE_REG: cp_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG21_BLE_REG_cp_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_BLE_REG: cp_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG21_BLE_REG_cp_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_BLE_REG: cp_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG21_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG21_FTDF_REG_cp_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_FTDF_REG: cp_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG21_FTDF_REG_cp_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_FTDF_REG: cp_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG21_FTDF_REG_cp_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_FTDF_REG: cp_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG21_FTDF_REG_cp_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG21_FTDF_REG: cp_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG22_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG22_BLE_REG_pfd_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_BLE_REG: pfd_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG22_BLE_REG_pfd_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_BLE_REG: pfd_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG22_BLE_REG_pfd_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_BLE_REG: pfd_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG22_BLE_REG_pfd_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_BLE_REG: pfd_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG22_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG22_FTDF_REG_pfd_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_FTDF_REG: pfd_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG22_FTDF_REG_pfd_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_FTDF_REG: pfd_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG22_FTDF_REG_pfd_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_FTDF_REG: pfd_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG22_FTDF_REG_pfd_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG22_FTDF_REG: pfd_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG23_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG23_BLE_REG_gauss_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_BLE_REG: gauss_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG23_BLE_REG_gauss_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_BLE_REG: gauss_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG23_BLE_REG_gauss_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_BLE_REG: gauss_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG23_BLE_REG_gauss_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_BLE_REG: gauss_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG23_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG23_FTDF_REG_gauss_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_FTDF_REG: gauss_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG23_FTDF_REG_gauss_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_FTDF_REG: gauss_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG23_FTDF_REG_gauss_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_FTDF_REG: gauss_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG23_FTDF_REG_gauss_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG23_FTDF_REG: gauss_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG24_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG24_BLE_REG_rfio_txrx_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_BLE_REG: rfio_txrx_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG24_BLE_REG_rfio_txrx_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_BLE_REG: rfio_txrx_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG24_BLE_REG_rfio_txrx_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_BLE_REG: rfio_txrx_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG24_BLE_REG_rfio_txrx_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_BLE_REG: rfio_txrx_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG24_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG24_FTDF_REG_rfio_txrx_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_FTDF_REG: rfio_txrx_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG24_FTDF_REG_rfio_txrx_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_FTDF_REG: rfio_txrx_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG24_FTDF_REG_rfio_txrx_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_FTDF_REG: rfio_txrx_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG24_FTDF_REG_rfio_txrx_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG24_FTDF_REG: rfio_txrx_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG25_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG25_BLE_REG_lobuf_pa_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_BLE_REG: lobuf_pa_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG25_BLE_REG_lobuf_pa_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_BLE_REG: lobuf_pa_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG25_BLE_REG_lobuf_pa_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_BLE_REG: lobuf_pa_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG25_BLE_REG_lobuf_pa_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_BLE_REG: lobuf_pa_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG25_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG25_FTDF_REG_lobuf_pa_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_FTDF_REG: lobuf_pa_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG25_FTDF_REG_lobuf_pa_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_FTDF_REG: lobuf_pa_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG25_FTDF_REG_lobuf_pa_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_FTDF_REG: lobuf_pa_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG25_FTDF_REG_lobuf_pa_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG25_FTDF_REG: lobuf_pa_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG26_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG26_BLE_REG_lobuf_rxiq_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_BLE_REG: lobuf_rxiq_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG26_BLE_REG_lobuf_rxiq_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_BLE_REG: lobuf_rxiq_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG26_BLE_REG_lobuf_rxiq_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_BLE_REG: lobuf_rxiq_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG26_BLE_REG_lobuf_rxiq_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_BLE_REG: lobuf_rxiq_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG26_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG26_FTDF_REG_lobuf_rxiq_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_FTDF_REG: lobuf_rxiq_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG26_FTDF_REG_lobuf_rxiq_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_FTDF_REG: lobuf_rxiq_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG26_FTDF_REG_lobuf_rxiq_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_FTDF_REG: lobuf_rxiq_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG26_FTDF_REG_lobuf_rxiq_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG26_FTDF_REG: lobuf_rxiq_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG27_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG27_BLE_REG_div2_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_BLE_REG: div2_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG27_BLE_REG_div2_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_BLE_REG: div2_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG27_BLE_REG_div2_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_BLE_REG: div2_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG27_BLE_REG_div2_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_BLE_REG: div2_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG27_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG27_FTDF_REG_div2_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_FTDF_REG: div2_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG27_FTDF_REG_div2_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_FTDF_REG: div2_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG27_FTDF_REG_div2_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_FTDF_REG: div2_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG27_FTDF_REG_div2_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG27_FTDF_REG: div2_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG28_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG28_BLE_REG_cp_bias_sh_open_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_BLE_REG: cp_bias_sh_open_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG28_BLE_REG_cp_bias_sh_open_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_BLE_REG: cp_bias_sh_open_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG28_BLE_REG_cp_bias_sh_open_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_BLE_REG: cp_bias_sh_open_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG28_BLE_REG_cp_bias_sh_open_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_BLE_REG: cp_bias_sh_open_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG28_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG28_FTDF_REG_cp_bias_sh_open_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_FTDF_REG: cp_bias_sh_open_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG28_FTDF_REG_cp_bias_sh_open_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_FTDF_REG: cp_bias_sh_open_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG28_FTDF_REG_cp_bias_sh_open_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_FTDF_REG: cp_bias_sh_open_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG28_FTDF_REG_cp_bias_sh_open_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG28_FTDF_REG: cp_bias_sh_open_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG29_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG29_BLE_REG_vco_bias_sh_open_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_BLE_REG: vco_bias_sh_open_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG29_BLE_REG_vco_bias_sh_open_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_BLE_REG: vco_bias_sh_open_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG29_BLE_REG_vco_bias_sh_open_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_BLE_REG: vco_bias_sh_open_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG29_BLE_REG_vco_bias_sh_open_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_BLE_REG: vco_bias_sh_open_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG29_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG29_FTDF_REG_vco_bias_sh_open_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_FTDF_REG: vco_bias_sh_open_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG29_FTDF_REG_vco_bias_sh_open_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_FTDF_REG: vco_bias_sh_open_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG29_FTDF_REG_vco_bias_sh_open_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_FTDF_REG: vco_bias_sh_open_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG29_FTDF_REG_vco_bias_sh_open_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG29_FTDF_REG: vco_bias_sh_open_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG2_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG2_BLE_REG_lna_cgm_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_BLE_REG: lna_cgm_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG2_BLE_REG_lna_cgm_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_BLE_REG: lna_cgm_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG2_BLE_REG_lna_cgm_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_BLE_REG: lna_cgm_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG2_BLE_REG_lna_cgm_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_BLE_REG: lna_cgm_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG2_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG2_FTDF_REG_lna_cgm_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_FTDF_REG: lna_cgm_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG2_FTDF_REG_lna_cgm_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_FTDF_REG: lna_cgm_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG2_FTDF_REG_lna_cgm_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_FTDF_REG: lna_cgm_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG2_FTDF_REG_lna_cgm_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG2_FTDF_REG: lna_cgm_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
