S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ==============================================  RF_ENABLE_CONFIG30_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG30_BLE_REG_iffmix_bias_sh_open_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_BLE_REG: iffmix_bias_sh_open_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG30_BLE_REG_iffmix_bias_sh_open_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_BLE_REG: iffmix_bias_sh_open_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG30_BLE_REG_iffmix_bias_sh_open_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_BLE_REG: iffmix_bias_sh_open_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG30_BLE_REG_iffmix_bias_sh_open_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_BLE_REG: iffmix_bias_sh_open_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG30_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG30_FTDF_REG_iffmix_bias_sh_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_FTDF_REG: iffmix_bias_sh_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG30_FTDF_REG_iffmix_bias_sh_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_FTDF_REG: iffmix_bias_sh_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG30_FTDF_REG_iffmix_bias_sh_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_FTDF_REG: iffmix_bias_sh_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG30_FTDF_REG_iffmix_bias_sh_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG30_FTDF_REG: iffmix_bias_sh_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG31_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG31_BLE_REG_gauss_bias_sh_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_BLE_REG: gauss_bias_sh_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG31_BLE_REG_gauss_bias_sh_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_BLE_REG: gauss_bias_sh_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG31_BLE_REG_gauss_bias_sh_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_BLE_REG: gauss_bias_sh_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG31_BLE_REG_gauss_bias_sh_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_BLE_REG: gauss_bias_sh_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG31_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG31_FTDF_REG_gauss_bias_sh_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_FTDF_REG: gauss_bias_sh_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG31_FTDF_REG_gauss_bias_sh_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_FTDF_REG: gauss_bias_sh_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG31_FTDF_REG_gauss_bias_sh_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_FTDF_REG: gauss_bias_sh_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG31_FTDF_REG_gauss_bias_sh_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG31_FTDF_REG: gauss_bias_sh_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG32_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG32_BLE_REG_mix_bias_sh_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_BLE_REG: mix_bias_sh_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG32_BLE_REG_mix_bias_sh_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_BLE_REG: mix_bias_sh_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG32_BLE_REG_mix_bias_sh_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_BLE_REG: mix_bias_sh_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG32_BLE_REG_mix_bias_sh_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_BLE_REG: mix_bias_sh_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG32_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG32_FTDF_REG_mix_bias_sh_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_FTDF_REG: mix_bias_sh_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG32_FTDF_REG_mix_bias_sh_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_FTDF_REG: mix_bias_sh_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG32_FTDF_REG_mix_bias_sh_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_FTDF_REG: mix_bias_sh_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG32_FTDF_REG_mix_bias_sh_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG32_FTDF_REG: mix_bias_sh_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG33_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG33_BLE_REG_pll_dig_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_BLE_REG: pll_dig_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG33_BLE_REG_pll_dig_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_BLE_REG: pll_dig_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG33_BLE_REG_pll_dig_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_BLE_REG: pll_dig_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG33_BLE_REG_pll_dig_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_BLE_REG: pll_dig_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG33_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG33_FTDF_REG_pll_dig_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_FTDF_REG: pll_dig_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG33_FTDF_REG_pll_dig_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_FTDF_REG: pll_dig_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG33_FTDF_REG_pll_dig_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_FTDF_REG: pll_dig_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG33_FTDF_REG_pll_dig_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG33_FTDF_REG: pll_dig_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG34_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG34_BLE_REG_pllclosed_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_BLE_REG: pllclosed_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG34_BLE_REG_pllclosed_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_BLE_REG: pllclosed_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG34_BLE_REG_pllclosed_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_BLE_REG: pllclosed_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG34_BLE_REG_pllclosed_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_BLE_REG: pllclosed_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG34_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG34_FTDF_REG_pllclosed_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_FTDF_REG: pllclosed_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG34_FTDF_REG_pllclosed_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_FTDF_REG: pllclosed_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG34_FTDF_REG_pllclosed_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_FTDF_REG: pllclosed_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG34_FTDF_REG_pllclosed_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG34_FTDF_REG: pllclosed_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG35_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG35_BLE_REG_dem_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_BLE_REG: dem_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG35_BLE_REG_dem_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_BLE_REG: dem_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG35_BLE_REG_dem_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_BLE_REG: dem_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG35_BLE_REG_dem_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_BLE_REG: dem_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG35_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG35_FTDF_REG_dem_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_FTDF_REG: dem_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG35_FTDF_REG_dem_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_FTDF_REG: dem_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG35_FTDF_REG_dem_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_FTDF_REG: dem_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG35_FTDF_REG_dem_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG35_FTDF_REG: dem_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG36_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG36_BLE_REG_ldo_zero_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_BLE_REG: ldo_zero_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG36_BLE_REG_ldo_zero_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_BLE_REG: ldo_zero_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG36_BLE_REG_ldo_zero_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_BLE_REG: ldo_zero_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG36_BLE_REG_ldo_zero_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_BLE_REG: ldo_zero_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG36_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG36_FTDF_REG_ldo_zero_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_FTDF_REG: ldo_zero_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG36_FTDF_REG_ldo_zero_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_FTDF_REG: ldo_zero_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG36_FTDF_REG_ldo_zero_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_FTDF_REG: ldo_zero_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG36_FTDF_REG_ldo_zero_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG36_FTDF_REG: ldo_zero_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG37_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG37_BLE_REG_cal_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_BLE_REG: cal_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG37_BLE_REG_cal_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_BLE_REG: cal_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG37_BLE_REG_cal_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_BLE_REG: cal_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG37_BLE_REG_cal_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_BLE_REG: cal_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG37_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG37_FTDF_REG_cal_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_FTDF_REG: cal_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG37_FTDF_REG_cal_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_FTDF_REG: cal_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG37_FTDF_REG_cal_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_FTDF_REG: cal_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG37_FTDF_REG_cal_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG37_FTDF_REG: cal_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG38_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG38_BLE_REG_tdc_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_BLE_REG: tdc_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG38_BLE_REG_tdc_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_BLE_REG: tdc_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG38_BLE_REG_tdc_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_BLE_REG: tdc_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG38_BLE_REG_tdc_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_BLE_REG: tdc_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG38_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG38_FTDF_REG_tdc_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_FTDF_REG: tdc_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG38_FTDF_REG_tdc_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_FTDF_REG: tdc_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG38_FTDF_REG_tdc_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_FTDF_REG: tdc_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG38_FTDF_REG_tdc_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG38_FTDF_REG: tdc_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG39_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG39_BLE_REG_ldo_rfio_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_BLE_REG: ldo_rfio_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG39_BLE_REG_ldo_rfio_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_BLE_REG: ldo_rfio_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG39_BLE_REG_ldo_rfio_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_BLE_REG: ldo_rfio_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG39_BLE_REG_ldo_rfio_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_BLE_REG: ldo_rfio_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG39_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG39_FTDF_REG_ldo_rfio_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_FTDF_REG: ldo_rfio_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG39_FTDF_REG_ldo_rfio_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_FTDF_REG: ldo_rfio_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG39_FTDF_REG_ldo_rfio_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_FTDF_REG: ldo_rfio_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG39_FTDF_REG_ldo_rfio_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG39_FTDF_REG: ldo_rfio_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG3_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG3_BLE_REG_mix_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_BLE_REG: mix_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG3_BLE_REG_mix_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_BLE_REG: mix_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG3_BLE_REG_mix_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_BLE_REG: mix_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG3_BLE_REG_mix_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_BLE_REG: mix_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG3_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG3_FTDF_REG_mix_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_FTDF_REG: mix_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG3_FTDF_REG_mix_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_FTDF_REG: mix_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG3_FTDF_REG_mix_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_FTDF_REG: mix_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG3_FTDF_REG_mix_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG3_FTDF_REG: mix_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG40_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG40_BLE_REG_rfio_bias_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_BLE_REG: rfio_bias_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG40_BLE_REG_rfio_bias_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_BLE_REG: rfio_bias_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG40_BLE_REG_rfio_bias_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_BLE_REG: rfio_bias_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG40_BLE_REG_rfio_bias_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_BLE_REG: rfio_bias_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG40_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG40_FTDF_REG_rfio_bias_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_FTDF_REG: rfio_bias_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG40_FTDF_REG_rfio_bias_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_FTDF_REG: rfio_bias_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG40_FTDF_REG_rfio_bias_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_FTDF_REG: rfio_bias_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG40_FTDF_REG_rfio_bias_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG40_FTDF_REG: rfio_bias_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG41_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG41_BLE_REG_rfio_bias_sh_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_BLE_REG: rfio_bias_sh_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG41_BLE_REG_rfio_bias_sh_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_BLE_REG: rfio_bias_sh_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG41_BLE_REG_rfio_bias_sh_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_BLE_REG: rfio_bias_sh_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG41_BLE_REG_rfio_bias_sh_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_BLE_REG: rfio_bias_sh_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG41_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG41_FTDF_REG_rfio_bias_sh_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_FTDF_REG: rfio_bias_sh_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG41_FTDF_REG_rfio_bias_sh_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_FTDF_REG: rfio_bias_sh_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG41_FTDF_REG_rfio_bias_sh_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_FTDF_REG: rfio_bias_sh_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG41_FTDF_REG_rfio_bias_sh_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG41_FTDF_REG: rfio_bias_sh_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG42_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG42_BLE_REG_ldo_radio_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_BLE_REG: ldo_radio_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG42_BLE_REG_ldo_radio_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_BLE_REG: ldo_radio_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG42_BLE_REG_ldo_radio_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_BLE_REG: ldo_radio_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG42_BLE_REG_ldo_radio_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_BLE_REG: ldo_radio_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG42_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG42_FTDF_REG_ldo_radio_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_FTDF_REG: ldo_radio_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG42_FTDF_REG_ldo_radio_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_FTDF_REG: ldo_radio_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG42_FTDF_REG_ldo_radio_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_FTDF_REG: ldo_radio_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG42_FTDF_REG_ldo_radio_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG42_FTDF_REG: ldo_radio_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG43_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG43_BLE_REG_adc_clk_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_BLE_REG: adc_clk_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG43_BLE_REG_adc_clk_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_BLE_REG: adc_clk_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG43_BLE_REG_adc_clk_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_BLE_REG: adc_clk_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG43_BLE_REG_adc_clk_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_BLE_REG: adc_clk_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG43_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG43_FTDF_REG_adc_clk_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_FTDF_REG: adc_clk_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG43_FTDF_REG_adc_clk_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_FTDF_REG: adc_clk_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG43_FTDF_REG_adc_clk_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_FTDF_REG: adc_clk_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG43_FTDF_REG_adc_clk_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG43_FTDF_REG: adc_clk_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
