S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ==============================================  RF_ENABLE_CONFIG44_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG44_BLE_REG_tr_pwm_off_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_BLE_REG: tr_pwm_off_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG44_BLE_REG_tr_pwm_off_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_BLE_REG: tr_pwm_off_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG44_BLE_REG_tr_pwm_off_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_BLE_REG: tr_pwm_off_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG44_BLE_REG_tr_pwm_off_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_BLE_REG: tr_pwm_off_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG44_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG44_FTDF_REG_tr_pwm_off_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_FTDF_REG: tr_pwm_off_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG44_FTDF_REG_tr_pwm_off_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_FTDF_REG: tr_pwm_off_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG44_FTDF_REG_tr_pwm_off_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_FTDF_REG: tr_pwm_off_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG44_FTDF_REG_tr_pwm_off_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG44_FTDF_REG: tr_pwm_off_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG45_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG45_BLE_REG_txdac_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_BLE_REG: txdac_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG45_BLE_REG_txdac_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_BLE_REG: txdac_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG45_BLE_REG_txdac_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_BLE_REG: txdac_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG45_BLE_REG_txdac_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_BLE_REG: txdac_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG45_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG45_FTDF_REG_txdac_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_FTDF_REG: txdac_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG45_FTDF_REG_txdac_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_FTDF_REG: txdac_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG45_FTDF_REG_txdac_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_FTDF_REG: txdac_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG45_FTDF_REG_txdac_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG45_FTDF_REG: txdac_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG46_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG46_BLE_REG_spare2_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_BLE_REG: spare2_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG46_BLE_REG_spare2_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_BLE_REG: spare2_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG46_BLE_REG_dcparcal_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_BLE_REG: dcparcal_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG46_BLE_REG_dcparcal_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_BLE_REG: dcparcal_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG46_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG46_FTDF_REG_spare2_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_FTDF_REG: spare2_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG46_FTDF_REG_spare2_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_FTDF_REG: spare2_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG46_FTDF_REG_dcparcal_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_FTDF_REG: dcparcal_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG46_FTDF_REG_dcparcal_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG46_FTDF_REG: dcparcal_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG47_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG47_BLE_REG_spare3_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_BLE_REG: spare3_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG47_BLE_REG_spare3_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_BLE_REG: spare3_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG47_BLE_REG_agcunfreeze_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_BLE_REG: agcunfreeze_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG47_BLE_REG_agcunfreeze_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_BLE_REG: agcunfreeze_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG47_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG47_FTDF_REG_spare3_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_FTDF_REG: spare3_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG47_FTDF_REG_spare3_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_FTDF_REG: spare3_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG47_FTDF_REG_agcunfreeze_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_FTDF_REG: agcunfreeze_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG47_FTDF_REG_agcunfreeze_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG47_FTDF_REG: agcunfreeze_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG48_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG48_BLE_REG_spare4_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_BLE_REG: spare4_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG48_BLE_REG_spare4_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_BLE_REG: spare4_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG48_BLE_REG_sigdetect_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_BLE_REG: sigdetect_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG48_BLE_REG_sigdetect_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_BLE_REG: sigdetect_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG48_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG48_FTDF_REG_spare4_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_FTDF_REG: spare4_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG48_FTDF_REG_spare4_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_FTDF_REG: spare4_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG48_FTDF_REG_sigdetect_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_FTDF_REG: sigdetect_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG48_FTDF_REG_sigdetect_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG48_FTDF_REG: sigdetect_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG49_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG49_BLE_REG_dem_ftdf_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_BLE_REG: dem_ftdf_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG49_BLE_REG_dem_ftdf_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_BLE_REG: dem_ftdf_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG49_BLE_REG_dem_ftdf_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_BLE_REG: dem_ftdf_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG49_BLE_REG_dem_ftdf_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_BLE_REG: dem_ftdf_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG49_FTDF_REG  ============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG49_FTDF_REG_dem_ftdf_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_FTDF_REG: dem_ftdf_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG49_FTDF_REG_dem_ftdf_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_FTDF_REG: dem_ftdf_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG49_FTDF_REG_dem_ftdf_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_FTDF_REG: dem_ftdf_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG49_FTDF_REG_dem_ftdf_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG49_FTDF_REG: dem_ftdf_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG4_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG4_BLE_REG_iff_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_BLE_REG: iff_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG4_BLE_REG_iff_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_BLE_REG: iff_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG4_BLE_REG_iff_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_BLE_REG: iff_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG4_BLE_REG_iff_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_BLE_REG: iff_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG4_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG4_FTDF_REG_iff_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_FTDF_REG: iff_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG4_FTDF_REG_iff_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_FTDF_REG: iff_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG4_FTDF_REG_iff_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_FTDF_REG: iff_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG4_FTDF_REG_iff_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG4_FTDF_REG: iff_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG5_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG5_BLE_REG_iffadc_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_BLE_REG: iffadc_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG5_BLE_REG_iffadc_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_BLE_REG: iffadc_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG5_BLE_REG_iffadc_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_BLE_REG: iffadc_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG5_BLE_REG_iffadc_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_BLE_REG: iffadc_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG5_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG5_FTDF_REG_iffadc_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_FTDF_REG: iffadc_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG5_FTDF_REG_iffadc_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_FTDF_REG: iffadc_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG5_FTDF_REG_iffadc_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_FTDF_REG: iffadc_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG5_FTDF_REG_iffadc_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG5_FTDF_REG: iffadc_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG6_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG6_BLE_REG_vco_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_BLE_REG: vco_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG6_BLE_REG_vco_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_BLE_REG: vco_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG6_BLE_REG_vco_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_BLE_REG: vco_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG6_BLE_REG_vco_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_BLE_REG: vco_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG6_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG6_FTDF_REG_vco_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_FTDF_REG: vco_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG6_FTDF_REG_vco_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_FTDF_REG: vco_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG6_FTDF_REG_vco_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_FTDF_REG: vco_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG6_FTDF_REG_vco_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG6_FTDF_REG: vco_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG7_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG7_BLE_REG_md_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_BLE_REG: md_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG7_BLE_REG_md_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_BLE_REG: md_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG7_BLE_REG_md_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_BLE_REG: md_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG7_BLE_REG_md_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_BLE_REG: md_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG7_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG7_FTDF_REG_md_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_FTDF_REG: md_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG7_FTDF_REG_md_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_FTDF_REG: md_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG7_FTDF_REG_md_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_FTDF_REG: md_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG7_FTDF_REG_md_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG7_FTDF_REG: md_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG8_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG8_BLE_REG_pfd_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_BLE_REG: pfd_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG8_BLE_REG_pfd_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_BLE_REG: pfd_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG8_BLE_REG_pfd_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_BLE_REG: pfd_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG8_BLE_REG_pfd_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_BLE_REG: pfd_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG8_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG8_FTDF_REG_pfd_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_FTDF_REG: pfd_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG8_FTDF_REG_pfd_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_FTDF_REG: pfd_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG8_FTDF_REG_pfd_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_FTDF_REG: pfd_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG8_FTDF_REG_pfd_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG8_FTDF_REG: pfd_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ===============================================  RF_ENABLE_CONFIG9_BLE_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG9_BLE_REG_pa_ldo_en_ble_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_BLE_REG: pa_ldo_en_ble_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG9_BLE_REG_pa_ldo_en_ble_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_BLE_REG: pa_ldo_en_ble_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG9_BLE_REG_pa_ldo_en_ble_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_BLE_REG: pa_ldo_en_ble_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG9_BLE_REG_pa_ldo_en_ble_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_BLE_REG: pa_ldo_en_ble_dcf_rx (Bitfield-Mask: 0x1f) */
/* ==============================================  RF_ENABLE_CONFIG9_FTDF_REG  =============================================== */
#define RFCU_POWER_RF_ENABLE_CONFIG9_FTDF_REG_pa_ldo_en_ftdf_dcf_tx_Pos (5UL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_FTDF_REG: pa_ldo_en_ftdf_dcf_tx (Bit 5) */
#define RFCU_POWER_RF_ENABLE_CONFIG9_FTDF_REG_pa_ldo_en_ftdf_dcf_tx_Msk (0x3e0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_FTDF_REG: pa_ldo_en_ftdf_dcf_tx (Bitfield-Mask: 0x1f) */
#define RFCU_POWER_RF_ENABLE_CONFIG9_FTDF_REG_pa_ldo_en_ftdf_dcf_rx_Pos (0UL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_FTDF_REG: pa_ldo_en_ftdf_dcf_rx (Bit 0) */
#define RFCU_POWER_RF_ENABLE_CONFIG9_FTDF_REG_pa_ldo_en_ftdf_dcf_rx_Msk (0x1fUL) /*!< RFCU_POWER RF_ENABLE_CONFIG9_FTDF_REG: pa_ldo_en_ftdf_dcf_rx (Bitfield-Mask: 0x1f) */
/* ====================================================  RF_PORT_EN_REG  ===================================================== */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_TX_Pos (9UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_TX (Bit 9)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_TX_Msk (0x200UL)         /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_RX_Pos (8UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_RX (Bit 8)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_RX_Msk (0x100UL)         /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_TX_Pos (7UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_TX (Bit 7)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_TX_Msk (0x80UL)          /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_RX_Pos (6UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_RX (Bit 6)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_RX_Msk (0x40UL)          /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_TX_Pos (5UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_TX (Bit 5)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_TX_Msk (0x20UL)          /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_RX_Pos (4UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_RX (Bit 4)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_RX_Msk (0x10UL)          /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_TX_Pos (3UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_TX (Bit 3)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_TX_Msk (0x8UL)           /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_RX_Pos (2UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_RX (Bit 2)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_RX_Msk (0x4UL)           /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_TX_Pos (1UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_TX (Bit 1)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_TX_Msk (0x2UL)           /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_RX_Pos (0UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_RX (Bit 0)        */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_RX_Msk (0x1UL)           /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_RX (Bitfield-Mask: 0x01) */
/* ====================================================  RF_PORT_POL_REG  ==================================================== */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT4_POL_Pos (4UL)           /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT4_POL (Bit 4)      */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT4_POL_Msk (0x10UL)        /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT4_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT3_POL_Pos (3UL)           /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT3_POL (Bit 3)      */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT3_POL_Msk (0x8UL)         /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT3_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT2_POL_Pos (2UL)           /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT2_POL (Bit 2)      */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT2_POL_Msk (0x4UL)         /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT2_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT1_POL_Pos (1UL)           /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT1_POL (Bit 1)      */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT1_POL_Msk (0x2UL)         /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT1_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT0_POL_Pos (0UL)           /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT0_POL (Bit 0)      */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT0_POL_Msk (0x1UL)         /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT0_POL (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                           RFPT                                            ================ */
/* =========================================================================================================================== */

