S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* ===============================================  CAPTIM_CAPTURE_GPIO1_REG  ================================================ */
#define TIMER1_CAPTIM_CAPTURE_GPIO1_REG_CAPTIM_CAPTURE_GPIO1_Pos (0UL) /*!< TIMER1 CAPTIM_CAPTURE_GPIO1_REG: CAPTIM_CAPTURE_GPIO1 (Bit 0) */
#define TIMER1_CAPTIM_CAPTURE_GPIO1_REG_CAPTIM_CAPTURE_GPIO1_Msk (0xffffUL) /*!< TIMER1 CAPTIM_CAPTURE_GPIO1_REG: CAPTIM_CAPTURE_GPIO1 (Bitfield-Mask: 0xffff) */
/* ===============================================  CAPTIM_CAPTURE_GPIO2_REG  ================================================ */
#define TIMER1_CAPTIM_CAPTURE_GPIO2_REG_CAPTIM_CAPTURE_GPIO2_Pos (0UL) /*!< TIMER1 CAPTIM_CAPTURE_GPIO2_REG: CAPTIM_CAPTURE_GPIO2 (Bit 0) */
#define TIMER1_CAPTIM_CAPTURE_GPIO2_REG_CAPTIM_CAPTURE_GPIO2_Msk (0xffffUL) /*!< TIMER1 CAPTIM_CAPTURE_GPIO2_REG: CAPTIM_CAPTURE_GPIO2 (Bitfield-Mask: 0xffff) */
/* ====================================================  CAPTIM_CTRL_REG  ==================================================== */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_SYS_CLK_EN_Pos (7UL)          /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_SYS_CLK_EN (Bit 7)     */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_SYS_CLK_EN_Msk (0x80UL)       /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_SYS_CLK_EN (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_FREE_RUN_MODE_EN_Pos (6UL)    /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_FREE_RUN_MODE_EN (Bit 6) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_FREE_RUN_MODE_EN_Msk (0x40UL) /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_FREE_RUN_MODE_EN (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_IRQ_EN_Pos (5UL)              /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_IRQ_EN (Bit 5)         */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_IRQ_EN_Msk (0x20UL)           /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_IRQ_EN (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_IN2_EVENT_FALL_EN_Pos (4UL)   /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_IN2_EVENT_FALL_EN (Bit 4) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_IN2_EVENT_FALL_EN_Msk (0x10UL) /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_IN2_EVENT_FALL_EN (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_IN1_EVENT_FALL_EN_Pos (3UL)   /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_IN1_EVENT_FALL_EN (Bit 3) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_IN1_EVENT_FALL_EN_Msk (0x8UL) /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_IN1_EVENT_FALL_EN (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_COUNT_DOWN_EN_Pos (2UL)       /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_COUNT_DOWN_EN (Bit 2)  */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_COUNT_DOWN_EN_Msk (0x4UL)     /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_COUNT_DOWN_EN (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_ONESHOT_MODE_EN_Pos (1UL)     /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_ONESHOT_MODE_EN (Bit 1) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_ONESHOT_MODE_EN_Msk (0x2UL)   /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_ONESHOT_MODE_EN (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_EN_Pos (0UL)                  /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_EN (Bit 0)             */
#define TIMER1_CAPTIM_CTRL_REG_CAPTIM_EN_Msk (0x1UL)                /*!< TIMER1 CAPTIM_CTRL_REG: CAPTIM_EN (Bitfield-Mask: 0x01) */
/* =================================================  CAPTIM_GPIO1_CONF_REG  ================================================= */
#define TIMER1_CAPTIM_GPIO1_CONF_REG_CAPTIM_GPIO1_CONF_Pos (0UL)    /*!< TIMER1 CAPTIM_GPIO1_CONF_REG: CAPTIM_GPIO1_CONF (Bit 0) */
#define TIMER1_CAPTIM_GPIO1_CONF_REG_CAPTIM_GPIO1_CONF_Msk (0x3fUL) /*!< TIMER1 CAPTIM_GPIO1_CONF_REG: CAPTIM_GPIO1_CONF (Bitfield-Mask: 0x3f) */
/* =================================================  CAPTIM_GPIO2_CONF_REG  ================================================= */
#define TIMER1_CAPTIM_GPIO2_CONF_REG_CAPTIM_GPIO2_CONF_Pos (0UL)    /*!< TIMER1 CAPTIM_GPIO2_CONF_REG: CAPTIM_GPIO2_CONF (Bit 0) */
#define TIMER1_CAPTIM_GPIO2_CONF_REG_CAPTIM_GPIO2_CONF_Msk (0x3fUL) /*!< TIMER1 CAPTIM_GPIO2_CONF_REG: CAPTIM_GPIO2_CONF (Bitfield-Mask: 0x3f) */
/* =================================================  CAPTIM_PRESCALER_REG  ================================================== */
#define TIMER1_CAPTIM_PRESCALER_REG_CAPTIM_PRESCALER_Pos (0UL)      /*!< TIMER1 CAPTIM_PRESCALER_REG: CAPTIM_PRESCALER (Bit 0) */
#define TIMER1_CAPTIM_PRESCALER_REG_CAPTIM_PRESCALER_Msk (0xffffUL) /*!< TIMER1 CAPTIM_PRESCALER_REG: CAPTIM_PRESCALER (Bitfield-Mask: 0xffff) */
/* ===============================================  CAPTIM_PRESCALER_VAL_REG  ================================================ */
#define TIMER1_CAPTIM_PRESCALER_VAL_REG_CAPTIM_PRESCALER_VAL_Pos (0UL) /*!< TIMER1 CAPTIM_PRESCALER_VAL_REG: CAPTIM_PRESCALER_VAL (Bit 0) */
#define TIMER1_CAPTIM_PRESCALER_VAL_REG_CAPTIM_PRESCALER_VAL_Msk (0xffffUL) /*!< TIMER1 CAPTIM_PRESCALER_VAL_REG: CAPTIM_PRESCALER_VAL (Bitfield-Mask: 0xffff) */
/* ===================================================  CAPTIM_PWM_DC_REG  =================================================== */
#define TIMER1_CAPTIM_PWM_DC_REG_CAPTIM_PWM_DC_Pos (0UL)            /*!< TIMER1 CAPTIM_PWM_DC_REG: CAPTIM_PWM_DC (Bit 0)       */
#define TIMER1_CAPTIM_PWM_DC_REG_CAPTIM_PWM_DC_Msk (0xffffUL)       /*!< TIMER1 CAPTIM_PWM_DC_REG: CAPTIM_PWM_DC (Bitfield-Mask: 0xffff) */
/* ==================================================  CAPTIM_PWM_FREQ_REG  ================================================== */
#define TIMER1_CAPTIM_PWM_FREQ_REG_CAPTIM_PWM_FREQ_Pos (0UL)        /*!< TIMER1 CAPTIM_PWM_FREQ_REG: CAPTIM_PWM_FREQ (Bit 0)   */
#define TIMER1_CAPTIM_PWM_FREQ_REG_CAPTIM_PWM_FREQ_Msk (0xffffUL)   /*!< TIMER1 CAPTIM_PWM_FREQ_REG: CAPTIM_PWM_FREQ (Bitfield-Mask: 0xffff) */
/* ===================================================  CAPTIM_RELOAD_REG  =================================================== */
#define TIMER1_CAPTIM_RELOAD_REG_CAPTIM_RELOAD_Pos (0UL)            /*!< TIMER1 CAPTIM_RELOAD_REG: CAPTIM_RELOAD (Bit 0)       */
#define TIMER1_CAPTIM_RELOAD_REG_CAPTIM_RELOAD_Msk (0xffffUL)       /*!< TIMER1 CAPTIM_RELOAD_REG: CAPTIM_RELOAD (Bitfield-Mask: 0xffff) */
/* =================================================  CAPTIM_SHOTWIDTH_REG  ================================================== */
#define TIMER1_CAPTIM_SHOTWIDTH_REG_CAPTIM_SHOTWIDTH_Pos (0UL)      /*!< TIMER1 CAPTIM_SHOTWIDTH_REG: CAPTIM_SHOTWIDTH (Bit 0) */
#define TIMER1_CAPTIM_SHOTWIDTH_REG_CAPTIM_SHOTWIDTH_Msk (0xffffUL) /*!< TIMER1 CAPTIM_SHOTWIDTH_REG: CAPTIM_SHOTWIDTH (Bitfield-Mask: 0xffff) */
/* ===================================================  CAPTIM_STATUS_REG  =================================================== */
#define TIMER1_CAPTIM_STATUS_REG_CAPTIM_ONESHOT_PHASE_Pos (2UL)     /*!< TIMER1 CAPTIM_STATUS_REG: CAPTIM_ONESHOT_PHASE (Bit 2) */
#define TIMER1_CAPTIM_STATUS_REG_CAPTIM_ONESHOT_PHASE_Msk (0xcUL)   /*!< TIMER1 CAPTIM_STATUS_REG: CAPTIM_ONESHOT_PHASE (Bitfield-Mask: 0x03) */
#define TIMER1_CAPTIM_STATUS_REG_CAPTIM_IN2_STATE_Pos (1UL)         /*!< TIMER1 CAPTIM_STATUS_REG: CAPTIM_IN2_STATE (Bit 1)    */
#define TIMER1_CAPTIM_STATUS_REG_CAPTIM_IN2_STATE_Msk (0x2UL)       /*!< TIMER1 CAPTIM_STATUS_REG: CAPTIM_IN2_STATE (Bitfield-Mask: 0x01) */
#define TIMER1_CAPTIM_STATUS_REG_CAPTIM_IN1_STATE_Pos (0UL)         /*!< TIMER1 CAPTIM_STATUS_REG: CAPTIM_IN1_STATE (Bit 0)    */
#define TIMER1_CAPTIM_STATUS_REG_CAPTIM_IN1_STATE_Msk (0x1UL)       /*!< TIMER1 CAPTIM_STATUS_REG: CAPTIM_IN1_STATE (Bitfield-Mask: 0x01) */
/* =================================================  CAPTIM_TIMER_VAL_REG  ================================================== */
#define TIMER1_CAPTIM_TIMER_VAL_REG_CAPTIM_TIMER_VALUE_Pos (0UL)    /*!< TIMER1 CAPTIM_TIMER_VAL_REG: CAPTIM_TIMER_VALUE (Bit 0) */
#define TIMER1_CAPTIM_TIMER_VAL_REG_CAPTIM_TIMER_VALUE_Msk (0xffffUL) /*!< TIMER1 CAPTIM_TIMER_VAL_REG: CAPTIM_TIMER_VALUE (Bitfield-Mask: 0xffff) */


/* =========================================================================================================================== */
/* ================                                           TRNG                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  TRNG_CTRL_REG  ===================================================== */
#define TRNG_TRNG_CTRL_REG_TRNG_MODE_Pos  (1UL)                     /*!< TRNG TRNG_CTRL_REG: TRNG_MODE (Bit 1)                 */
#define TRNG_TRNG_CTRL_REG_TRNG_MODE_Msk  (0x2UL)                   /*!< TRNG TRNG_CTRL_REG: TRNG_MODE (Bitfield-Mask: 0x01)   */
#define TRNG_TRNG_CTRL_REG_TRNG_ENABLE_Pos (0UL)                    /*!< TRNG TRNG_CTRL_REG: TRNG_ENABLE (Bit 0)               */
#define TRNG_TRNG_CTRL_REG_TRNG_ENABLE_Msk (0x1UL)                  /*!< TRNG TRNG_CTRL_REG: TRNG_ENABLE (Bitfield-Mask: 0x01) */
/* ===================================================  TRNG_FIFOLVL_REG  ==================================================== */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOFULL_Pos (5UL)               /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOFULL (Bit 5)          */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOFULL_Msk (0x20UL)            /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOFULL (Bitfield-Mask: 0x01) */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOLVL_Pos (0UL)                /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOLVL (Bit 0)           */
#define TRNG_TRNG_FIFOLVL_REG_TRNG_FIFOLVL_Msk (0x1fUL)             /*!< TRNG TRNG_FIFOLVL_REG: TRNG_FIFOLVL (Bitfield-Mask: 0x1f) */
/* =====================================================  TRNG_VER_REG  ====================================================== */
#define TRNG_TRNG_VER_REG_TRNG_MAJ_Pos    (24UL)                    /*!< TRNG TRNG_VER_REG: TRNG_MAJ (Bit 24)                  */
#define TRNG_TRNG_VER_REG_TRNG_MAJ_Msk    (0xff000000UL)            /*!< TRNG TRNG_VER_REG: TRNG_MAJ (Bitfield-Mask: 0xff)     */
#define TRNG_TRNG_VER_REG_TRNG_MIN_Pos    (16UL)                    /*!< TRNG TRNG_VER_REG: TRNG_MIN (Bit 16)                  */
#define TRNG_TRNG_VER_REG_TRNG_MIN_Msk    (0xff0000UL)              /*!< TRNG TRNG_VER_REG: TRNG_MIN (Bitfield-Mask: 0xff)     */
#define TRNG_TRNG_VER_REG_TRNG_SVN_Pos    (0UL)                     /*!< TRNG TRNG_VER_REG: TRNG_SVN (Bit 0)                   */
#define TRNG_TRNG_VER_REG_TRNG_SVN_Msk    (0xffffUL)                /*!< TRNG TRNG_VER_REG: TRNG_SVN (Bitfield-Mask: 0xffff)   */


/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  UART_CPR_REG  ====================================================== */
#define UART_UART_CPR_REG_CPR_Pos         (0UL)                     /*!< UART UART_CPR_REG: CPR (Bit 0)                        */
#define UART_UART_CPR_REG_CPR_Msk         (0xffffUL)                /*!< UART UART_CPR_REG: CPR (Bitfield-Mask: 0xffff)        */
/* =====================================================  UART_CTR_REG  ====================================================== */
#define UART_UART_CTR_REG_CTR_Pos         (0UL)                     /*!< UART UART_CTR_REG: CTR (Bit 0)                        */
#define UART_UART_CTR_REG_CTR_Msk         (0xffffUL)                /*!< UART UART_CTR_REG: CTR (Bitfield-Mask: 0xffff)        */
/* =====================================================  UART_DLF_REG  ====================================================== */
#define UART_UART_DLF_REG_UART_DLF_Pos    (0UL)                     /*!< UART UART_DLF_REG: UART_DLF (Bit 0)                   */
#define UART_UART_DLF_REG_UART_DLF_Msk    (0xfUL)                   /*!< UART UART_DLF_REG: UART_DLF (Bitfield-Mask: 0x0f)     */
/* ====================================================  UART_DMASA_REG  ===================================================== */
#define UART_UART_DMASA_REG_DMASA_Pos     (0UL)                     /*!< UART UART_DMASA_REG: DMASA (Bit 0)                    */
#define UART_UART_DMASA_REG_DMASA_Msk     (0x1UL)                   /*!< UART UART_DMASA_REG: DMASA (Bitfield-Mask: 0x01)      */
/* ===================================================  UART_IER_DLH_REG  ==================================================== */
#define UART_UART_IER_DLH_REG_PTIME_dlh7_Pos (7UL)                  /*!< UART UART_IER_DLH_REG: PTIME_dlh7 (Bit 7)             */
#define UART_UART_IER_DLH_REG_PTIME_dlh7_Msk (0x80UL)               /*!< UART UART_IER_DLH_REG: PTIME_dlh7 (Bitfield-Mask: 0x01) */
#define UART_UART_IER_DLH_REG_ELSI_dhl2_Pos (2UL)                   /*!< UART UART_IER_DLH_REG: ELSI_dhl2 (Bit 2)              */
#define UART_UART_IER_DLH_REG_ELSI_dhl2_Msk (0x4UL)                 /*!< UART UART_IER_DLH_REG: ELSI_dhl2 (Bitfield-Mask: 0x01) */
#define UART_UART_IER_DLH_REG_ETBEI_dlh1_Pos (1UL)                  /*!< UART UART_IER_DLH_REG: ETBEI_dlh1 (Bit 1)             */
#define UART_UART_IER_DLH_REG_ETBEI_dlh1_Msk (0x2UL)                /*!< UART UART_IER_DLH_REG: ETBEI_dlh1 (Bitfield-Mask: 0x01) */
#define UART_UART_IER_DLH_REG_ERBFI_dlh0_Pos (0UL)                  /*!< UART UART_IER_DLH_REG: ERBFI_dlh0 (Bit 0)             */
#define UART_UART_IER_DLH_REG_ERBFI_dlh0_Msk (0x1UL)                /*!< UART UART_IER_DLH_REG: ERBFI_dlh0 (Bitfield-Mask: 0x01) */
/* ===================================================  UART_IIR_FCR_REG  ==================================================== */
#define UART_UART_IIR_FCR_REG_IIR_FCR_Pos (0UL)                     /*!< UART UART_IIR_FCR_REG: IIR_FCR (Bit 0)                */
#define UART_UART_IIR_FCR_REG_IIR_FCR_Msk (0xffffUL)                /*!< UART UART_IIR_FCR_REG: IIR_FCR (Bitfield-Mask: 0xffff) */
/* =====================================================  UART_LCR_REG  ====================================================== */
#define UART_UART_LCR_REG_UART_DLAB_Pos   (7UL)                     /*!< UART UART_LCR_REG: UART_DLAB (Bit 7)                  */
#define UART_UART_LCR_REG_UART_DLAB_Msk   (0x80UL)                  /*!< UART UART_LCR_REG: UART_DLAB (Bitfield-Mask: 0x01)    */
#define UART_UART_LCR_REG_UART_BC_Pos     (6UL)                     /*!< UART UART_LCR_REG: UART_BC (Bit 6)                    */
#define UART_UART_LCR_REG_UART_BC_Msk     (0x40UL)                  /*!< UART UART_LCR_REG: UART_BC (Bitfield-Mask: 0x01)      */
#define UART_UART_LCR_REG_UART_EPS_Pos    (4UL)                     /*!< UART UART_LCR_REG: UART_EPS (Bit 4)                   */
#define UART_UART_LCR_REG_UART_EPS_Msk    (0x10UL)                  /*!< UART UART_LCR_REG: UART_EPS (Bitfield-Mask: 0x01)     */
#define UART_UART_LCR_REG_UART_PEN_Pos    (3UL)                     /*!< UART UART_LCR_REG: UART_PEN (Bit 3)                   */
#define UART_UART_LCR_REG_UART_PEN_Msk    (0x8UL)                   /*!< UART UART_LCR_REG: UART_PEN (Bitfield-Mask: 0x01)     */
#define UART_UART_LCR_REG_UART_STOP_Pos   (2UL)                     /*!< UART UART_LCR_REG: UART_STOP (Bit 2)                  */
#define UART_UART_LCR_REG_UART_STOP_Msk   (0x4UL)                   /*!< UART UART_LCR_REG: UART_STOP (Bitfield-Mask: 0x01)    */
#define UART_UART_LCR_REG_UART_DLS_Pos    (0UL)                     /*!< UART UART_LCR_REG: UART_DLS (Bit 0)                   */
#define UART_UART_LCR_REG_UART_DLS_Msk    (0x3UL)                   /*!< UART UART_LCR_REG: UART_DLS (Bitfield-Mask: 0x03)     */
/* =====================================================  UART_LSR_REG  ====================================================== */
#define UART_UART_LSR_REG_UART_TEMT_Pos   (6UL)                     /*!< UART UART_LSR_REG: UART_TEMT (Bit 6)                  */
#define UART_UART_LSR_REG_UART_TEMT_Msk   (0x40UL)                  /*!< UART UART_LSR_REG: UART_TEMT (Bitfield-Mask: 0x01)    */
#define UART_UART_LSR_REG_UART_THRE_Pos   (5UL)                     /*!< UART UART_LSR_REG: UART_THRE (Bit 5)                  */
#define UART_UART_LSR_REG_UART_THRE_Msk   (0x20UL)                  /*!< UART UART_LSR_REG: UART_THRE (Bitfield-Mask: 0x01)    */
#define UART_UART_LSR_REG_UART_BI_Pos     (4UL)                     /*!< UART UART_LSR_REG: UART_BI (Bit 4)                    */
#define UART_UART_LSR_REG_UART_BI_Msk     (0x10UL)                  /*!< UART UART_LSR_REG: UART_BI (Bitfield-Mask: 0x01)      */
#define UART_UART_LSR_REG_UART_FE_Pos     (3UL)                     /*!< UART UART_LSR_REG: UART_FE (Bit 3)                    */
#define UART_UART_LSR_REG_UART_FE_Msk     (0x8UL)                   /*!< UART UART_LSR_REG: UART_FE (Bitfield-Mask: 0x01)      */
#define UART_UART_LSR_REG_UART_PE_Pos     (2UL)                     /*!< UART UART_LSR_REG: UART_PE (Bit 2)                    */
#define UART_UART_LSR_REG_UART_PE_Msk     (0x4UL)                   /*!< UART UART_LSR_REG: UART_PE (Bitfield-Mask: 0x01)      */
#define UART_UART_LSR_REG_UART_OE_Pos     (1UL)                     /*!< UART UART_LSR_REG: UART_OE (Bit 1)                    */
#define UART_UART_LSR_REG_UART_OE_Msk     (0x2UL)                   /*!< UART UART_LSR_REG: UART_OE (Bitfield-Mask: 0x01)      */
#define UART_UART_LSR_REG_UART_DR_Pos     (0UL)                     /*!< UART UART_LSR_REG: UART_DR (Bit 0)                    */
#define UART_UART_LSR_REG_UART_DR_Msk     (0x1UL)                   /*!< UART UART_LSR_REG: UART_DR (Bitfield-Mask: 0x01)      */
/* =====================================================  UART_MCR_REG  ====================================================== */
#define UART_UART_MCR_REG_UART_SIRE_Pos   (6UL)                     /*!< UART UART_MCR_REG: UART_SIRE (Bit 6)                  */
#define UART_UART_MCR_REG_UART_SIRE_Msk   (0x40UL)                  /*!< UART UART_MCR_REG: UART_SIRE (Bitfield-Mask: 0x01)    */
#define UART_UART_MCR_REG_UART_LB_Pos     (4UL)                     /*!< UART UART_MCR_REG: UART_LB (Bit 4)                    */
#define UART_UART_MCR_REG_UART_LB_Msk     (0x10UL)                  /*!< UART UART_MCR_REG: UART_LB (Bitfield-Mask: 0x01)      */
#define UART_UART_MCR_REG_UART_OUT2_Pos   (3UL)                     /*!< UART UART_MCR_REG: UART_OUT2 (Bit 3)                  */
#define UART_UART_MCR_REG_UART_OUT2_Msk   (0x8UL)                   /*!< UART UART_MCR_REG: UART_OUT2 (Bitfield-Mask: 0x01)    */
#define UART_UART_MCR_REG_UART_OUT1_Pos   (2UL)                     /*!< UART UART_MCR_REG: UART_OUT1 (Bit 2)                  */
#define UART_UART_MCR_REG_UART_OUT1_Msk   (0x4UL)                   /*!< UART UART_MCR_REG: UART_OUT1 (Bitfield-Mask: 0x01)    */
/* =================================================  UART_RBR_THR_DLL_REG  ================================================== */
#define UART_UART_RBR_THR_DLL_REG_RBR_THR_DLL_Pos (0UL)             /*!< UART UART_RBR_THR_DLL_REG: RBR_THR_DLL (Bit 0)        */
#define UART_UART_RBR_THR_DLL_REG_RBR_THR_DLL_Msk (0xffUL)          /*!< UART UART_RBR_THR_DLL_REG: RBR_THR_DLL (Bitfield-Mask: 0xff) */
/* =====================================================  UART_SBCR_REG  ===================================================== */
#define UART_UART_SBCR_REG_UART_SHADOW_BREAK_CONTROL_Pos (0UL)      /*!< UART UART_SBCR_REG: UART_SHADOW_BREAK_CONTROL (Bit 0) */
#define UART_UART_SBCR_REG_UART_SHADOW_BREAK_CONTROL_Msk (0x1UL)    /*!< UART UART_SBCR_REG: UART_SHADOW_BREAK_CONTROL (Bitfield-Mask: 0x01) */
/* =====================================================  UART_SCR_REG  ====================================================== */
#define UART_UART_SCR_REG_UART_SCRATCH_PAD_Pos (0UL)                /*!< UART UART_SCR_REG: UART_SCRATCH_PAD (Bit 0)           */
#define UART_UART_SCR_REG_UART_SCRATCH_PAD_Msk (0xffUL)             /*!< UART UART_SCR_REG: UART_SCRATCH_PAD (Bitfield-Mask: 0xff) */
/* =====================================================  UART_SRR_REG  ====================================================== */
#define UART_UART_SRR_REG_UART_UR_Pos     (0UL)                     /*!< UART UART_SRR_REG: UART_UR (Bit 0)                    */
#define UART_UART_SRR_REG_UART_UR_Msk     (0x1UL)                   /*!< UART UART_SRR_REG: UART_UR (Bitfield-Mask: 0x01)      */
/* =====================================================  UART_UCV_REG  ====================================================== */
#define UART_UART_UCV_REG_UCV_Pos         (0UL)                     /*!< UART UART_UCV_REG: UCV (Bit 0)                        */
#define UART_UART_UCV_REG_UCV_Msk         (0xffffUL)                /*!< UART UART_UCV_REG: UCV (Bitfield-Mask: 0xffff)        */
/* =====================================================  UART_USR_REG  ====================================================== */
#define UART_UART_USR_REG_UART_BUSY_Pos   (0UL)                     /*!< UART UART_USR_REG: UART_BUSY (Bit 0)                  */
#define UART_UART_USR_REG_UART_BUSY_Msk   (0x1UL)                   /*!< UART UART_USR_REG: UART_BUSY (Bitfield-Mask: 0x01)    */


/* =========================================================================================================================== */
/* ================                                           UART2                                           ================ */
/* =========================================================================================================================== */

