S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
/* =====================================================  USB_ALTEV_REG  ===================================================== */
#define USB_USB_ALTEV_REG_USB_RESUME_Pos  (7UL)                     /*!< USB USB_ALTEV_REG: USB_RESUME (Bit 7)                 */
#define USB_USB_ALTEV_REG_USB_RESUME_Msk  (0x80UL)                  /*!< USB USB_ALTEV_REG: USB_RESUME (Bitfield-Mask: 0x01)   */
#define USB_USB_ALTEV_REG_USB_RESET_Pos   (6UL)                     /*!< USB USB_ALTEV_REG: USB_RESET (Bit 6)                  */
#define USB_USB_ALTEV_REG_USB_RESET_Msk   (0x40UL)                  /*!< USB USB_ALTEV_REG: USB_RESET (Bitfield-Mask: 0x01)    */
#define USB_USB_ALTEV_REG_USB_SD5_Pos     (5UL)                     /*!< USB USB_ALTEV_REG: USB_SD5 (Bit 5)                    */
#define USB_USB_ALTEV_REG_USB_SD5_Msk     (0x20UL)                  /*!< USB USB_ALTEV_REG: USB_SD5 (Bitfield-Mask: 0x01)      */
#define USB_USB_ALTEV_REG_USB_SD3_Pos     (4UL)                     /*!< USB USB_ALTEV_REG: USB_SD3 (Bit 4)                    */
#define USB_USB_ALTEV_REG_USB_SD3_Msk     (0x10UL)                  /*!< USB USB_ALTEV_REG: USB_SD3 (Bitfield-Mask: 0x01)      */
#define USB_USB_ALTEV_REG_USB_EOP_Pos     (3UL)                     /*!< USB USB_ALTEV_REG: USB_EOP (Bit 3)                    */
#define USB_USB_ALTEV_REG_USB_EOP_Msk     (0x8UL)                   /*!< USB USB_ALTEV_REG: USB_EOP (Bitfield-Mask: 0x01)      */
/* ====================================================  USB_ALTMSK_REG  ===================================================== */
#define USB_USB_ALTMSK_REG_USB_M_RESUME_Pos (7UL)                   /*!< USB USB_ALTMSK_REG: USB_M_RESUME (Bit 7)              */
#define USB_USB_ALTMSK_REG_USB_M_RESUME_Msk (0x80UL)                /*!< USB USB_ALTMSK_REG: USB_M_RESUME (Bitfield-Mask: 0x01) */
#define USB_USB_ALTMSK_REG_USB_M_RESET_Pos (6UL)                    /*!< USB USB_ALTMSK_REG: USB_M_RESET (Bit 6)               */
#define USB_USB_ALTMSK_REG_USB_M_RESET_Msk (0x40UL)                 /*!< USB USB_ALTMSK_REG: USB_M_RESET (Bitfield-Mask: 0x01) */
#define USB_USB_ALTMSK_REG_USB_M_SD5_Pos  (5UL)                     /*!< USB USB_ALTMSK_REG: USB_M_SD5 (Bit 5)                 */
#define USB_USB_ALTMSK_REG_USB_M_SD5_Msk  (0x20UL)                  /*!< USB USB_ALTMSK_REG: USB_M_SD5 (Bitfield-Mask: 0x01)   */
#define USB_USB_ALTMSK_REG_USB_M_SD3_Pos  (4UL)                     /*!< USB USB_ALTMSK_REG: USB_M_SD3 (Bit 4)                 */
#define USB_USB_ALTMSK_REG_USB_M_SD3_Msk  (0x10UL)                  /*!< USB USB_ALTMSK_REG: USB_M_SD3 (Bitfield-Mask: 0x01)   */
#define USB_USB_ALTMSK_REG_USB_M_EOP_Pos  (3UL)                     /*!< USB USB_ALTMSK_REG: USB_M_EOP (Bit 3)                 */
#define USB_USB_ALTMSK_REG_USB_M_EOP_Msk  (0x8UL)                   /*!< USB USB_ALTMSK_REG: USB_M_EOP (Bitfield-Mask: 0x01)   */
/* =================================================  USB_CHARGER_CTRL_REG  ================================================== */
#define USB_USB_CHARGER_CTRL_REG_IDM_SINK_ON_Pos (5UL)              /*!< USB USB_CHARGER_CTRL_REG: IDM_SINK_ON (Bit 5)         */
#define USB_USB_CHARGER_CTRL_REG_IDM_SINK_ON_Msk (0x20UL)           /*!< USB USB_CHARGER_CTRL_REG: IDM_SINK_ON (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_CTRL_REG_IDP_SINK_ON_Pos (4UL)              /*!< USB USB_CHARGER_CTRL_REG: IDP_SINK_ON (Bit 4)         */
#define USB_USB_CHARGER_CTRL_REG_IDP_SINK_ON_Msk (0x10UL)           /*!< USB USB_CHARGER_CTRL_REG: IDP_SINK_ON (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_CTRL_REG_VDM_SRC_ON_Pos (3UL)               /*!< USB USB_CHARGER_CTRL_REG: VDM_SRC_ON (Bit 3)          */
#define USB_USB_CHARGER_CTRL_REG_VDM_SRC_ON_Msk (0x8UL)             /*!< USB USB_CHARGER_CTRL_REG: VDM_SRC_ON (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_CTRL_REG_VDP_SRC_ON_Pos (2UL)               /*!< USB USB_CHARGER_CTRL_REG: VDP_SRC_ON (Bit 2)          */
#define USB_USB_CHARGER_CTRL_REG_VDP_SRC_ON_Msk (0x4UL)             /*!< USB USB_CHARGER_CTRL_REG: VDP_SRC_ON (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_CTRL_REG_IDP_SRC_ON_Pos (1UL)               /*!< USB USB_CHARGER_CTRL_REG: IDP_SRC_ON (Bit 1)          */
#define USB_USB_CHARGER_CTRL_REG_IDP_SRC_ON_Msk (0x2UL)             /*!< USB USB_CHARGER_CTRL_REG: IDP_SRC_ON (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_CTRL_REG_USB_CHARGE_ON_Pos (0UL)            /*!< USB USB_CHARGER_CTRL_REG: USB_CHARGE_ON (Bit 0)       */
#define USB_USB_CHARGER_CTRL_REG_USB_CHARGE_ON_Msk (0x1UL)          /*!< USB USB_CHARGER_CTRL_REG: USB_CHARGE_ON (Bitfield-Mask: 0x01) */
/* =================================================  USB_CHARGER_STAT_REG  ================================================== */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL2_Pos (5UL)              /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL2 (Bit 5)         */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL2_Msk (0x20UL)           /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL2 (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL2_Pos (4UL)              /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL2 (Bit 4)         */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL2_Msk (0x10UL)           /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL2 (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL_Pos (3UL)               /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL (Bit 3)          */
#define USB_USB_CHARGER_STAT_REG_USB_DM_VAL_Msk (0x8UL)             /*!< USB USB_CHARGER_STAT_REG: USB_DM_VAL (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL_Pos (2UL)               /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL (Bit 2)          */
#define USB_USB_CHARGER_STAT_REG_USB_DP_VAL_Msk (0x4UL)             /*!< USB USB_CHARGER_STAT_REG: USB_DP_VAL (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_CHG_DET_Pos (1UL)              /*!< USB USB_CHARGER_STAT_REG: USB_CHG_DET (Bit 1)         */
#define USB_USB_CHARGER_STAT_REG_USB_CHG_DET_Msk (0x2UL)            /*!< USB USB_CHARGER_STAT_REG: USB_CHG_DET (Bitfield-Mask: 0x01) */
#define USB_USB_CHARGER_STAT_REG_USB_DCP_DET_Pos (0UL)              /*!< USB USB_CHARGER_STAT_REG: USB_DCP_DET (Bit 0)         */
#define USB_USB_CHARGER_STAT_REG_USB_DCP_DET_Msk (0x1UL)            /*!< USB USB_CHARGER_STAT_REG: USB_DCP_DET (Bitfield-Mask: 0x01) */
/* ===================================================  USB_DMA_CTRL_REG  ==================================================== */
#define USB_USB_DMA_CTRL_REG_USB_DMA_EN_Pos (6UL)                   /*!< USB USB_DMA_CTRL_REG: USB_DMA_EN (Bit 6)              */
#define USB_USB_DMA_CTRL_REG_USB_DMA_EN_Msk (0x40UL)                /*!< USB USB_DMA_CTRL_REG: USB_DMA_EN (Bitfield-Mask: 0x01) */
#define USB_USB_DMA_CTRL_REG_USB_DMA_TX_Pos (3UL)                   /*!< USB USB_DMA_CTRL_REG: USB_DMA_TX (Bit 3)              */
#define USB_USB_DMA_CTRL_REG_USB_DMA_TX_Msk (0x38UL)                /*!< USB USB_DMA_CTRL_REG: USB_DMA_TX (Bitfield-Mask: 0x07) */
#define USB_USB_DMA_CTRL_REG_USB_DMA_RX_Pos (0UL)                   /*!< USB USB_DMA_CTRL_REG: USB_DMA_RX (Bit 0)              */
#define USB_USB_DMA_CTRL_REG_USB_DMA_RX_Msk (0x7UL)                 /*!< USB USB_DMA_CTRL_REG: USB_DMA_RX (Bitfield-Mask: 0x07) */
/* ====================================================  USB_EP0_NAK_REG  ==================================================== */
#define USB_USB_EP0_NAK_REG_USB_EP0_OUTNAK_Pos (1UL)                /*!< USB USB_EP0_NAK_REG: USB_EP0_OUTNAK (Bit 1)           */
#define USB_USB_EP0_NAK_REG_USB_EP0_OUTNAK_Msk (0x2UL)              /*!< USB USB_EP0_NAK_REG: USB_EP0_OUTNAK (Bitfield-Mask: 0x01) */
#define USB_USB_EP0_NAK_REG_USB_EP0_INNAK_Pos (0UL)                 /*!< USB USB_EP0_NAK_REG: USB_EP0_INNAK (Bit 0)            */
#define USB_USB_EP0_NAK_REG_USB_EP0_INNAK_Msk (0x1UL)               /*!< USB USB_EP0_NAK_REG: USB_EP0_INNAK (Bitfield-Mask: 0x01) */
/* =====================================================  USB_EPC0_REG  ====================================================== */
#define USB_USB_EPC0_REG_USB_STALL_Pos    (7UL)                     /*!< USB USB_EPC0_REG: USB_STALL (Bit 7)                   */
#define USB_USB_EPC0_REG_USB_STALL_Msk    (0x80UL)                  /*!< USB USB_EPC0_REG: USB_STALL (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC0_REG_USB_DEF_Pos      (6UL)                     /*!< USB USB_EPC0_REG: USB_DEF (Bit 6)                     */
#define USB_USB_EPC0_REG_USB_DEF_Msk      (0x40UL)                  /*!< USB USB_EPC0_REG: USB_DEF (Bitfield-Mask: 0x01)       */
#define USB_USB_EPC0_REG_USB_EP_Pos       (0UL)                     /*!< USB USB_EPC0_REG: USB_EP (Bit 0)                      */
#define USB_USB_EPC0_REG_USB_EP_Msk       (0xfUL)                   /*!< USB USB_EPC0_REG: USB_EP (Bitfield-Mask: 0x0f)        */
/* =====================================================  USB_EPC1_REG  ====================================================== */
#define USB_USB_EPC1_REG_USB_STALL_Pos    (7UL)                     /*!< USB USB_EPC1_REG: USB_STALL (Bit 7)                   */
#define USB_USB_EPC1_REG_USB_STALL_Msk    (0x80UL)                  /*!< USB USB_EPC1_REG: USB_STALL (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC1_REG_USB_ISO_Pos      (5UL)                     /*!< USB USB_EPC1_REG: USB_ISO (Bit 5)                     */
#define USB_USB_EPC1_REG_USB_ISO_Msk      (0x20UL)                  /*!< USB USB_EPC1_REG: USB_ISO (Bitfield-Mask: 0x01)       */
#define USB_USB_EPC1_REG_USB_EP_EN_Pos    (4UL)                     /*!< USB USB_EPC1_REG: USB_EP_EN (Bit 4)                   */
#define USB_USB_EPC1_REG_USB_EP_EN_Msk    (0x10UL)                  /*!< USB USB_EPC1_REG: USB_EP_EN (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC1_REG_USB_EP_Pos       (0UL)                     /*!< USB USB_EPC1_REG: USB_EP (Bit 0)                      */
#define USB_USB_EPC1_REG_USB_EP_Msk       (0xfUL)                   /*!< USB USB_EPC1_REG: USB_EP (Bitfield-Mask: 0x0f)        */
/* =====================================================  USB_EPC2_REG  ====================================================== */
#define USB_USB_EPC2_REG_USB_STALL_Pos    (7UL)                     /*!< USB USB_EPC2_REG: USB_STALL (Bit 7)                   */
#define USB_USB_EPC2_REG_USB_STALL_Msk    (0x80UL)                  /*!< USB USB_EPC2_REG: USB_STALL (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC2_REG_USB_ISO_Pos      (5UL)                     /*!< USB USB_EPC2_REG: USB_ISO (Bit 5)                     */
#define USB_USB_EPC2_REG_USB_ISO_Msk      (0x20UL)                  /*!< USB USB_EPC2_REG: USB_ISO (Bitfield-Mask: 0x01)       */
#define USB_USB_EPC2_REG_USB_EP_EN_Pos    (4UL)                     /*!< USB USB_EPC2_REG: USB_EP_EN (Bit 4)                   */
#define USB_USB_EPC2_REG_USB_EP_EN_Msk    (0x10UL)                  /*!< USB USB_EPC2_REG: USB_EP_EN (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC2_REG_USB_EP_Pos       (0UL)                     /*!< USB USB_EPC2_REG: USB_EP (Bit 0)                      */
#define USB_USB_EPC2_REG_USB_EP_Msk       (0xfUL)                   /*!< USB USB_EPC2_REG: USB_EP (Bitfield-Mask: 0x0f)        */
/* =====================================================  USB_EPC3_REG  ====================================================== */
#define USB_USB_EPC3_REG_USB_STALL_Pos    (7UL)                     /*!< USB USB_EPC3_REG: USB_STALL (Bit 7)                   */
#define USB_USB_EPC3_REG_USB_STALL_Msk    (0x80UL)                  /*!< USB USB_EPC3_REG: USB_STALL (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC3_REG_USB_ISO_Pos      (5UL)                     /*!< USB USB_EPC3_REG: USB_ISO (Bit 5)                     */
#define USB_USB_EPC3_REG_USB_ISO_Msk      (0x20UL)                  /*!< USB USB_EPC3_REG: USB_ISO (Bitfield-Mask: 0x01)       */
#define USB_USB_EPC3_REG_USB_EP_EN_Pos    (4UL)                     /*!< USB USB_EPC3_REG: USB_EP_EN (Bit 4)                   */
#define USB_USB_EPC3_REG_USB_EP_EN_Msk    (0x10UL)                  /*!< USB USB_EPC3_REG: USB_EP_EN (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC3_REG_USB_EP_Pos       (0UL)                     /*!< USB USB_EPC3_REG: USB_EP (Bit 0)                      */
#define USB_USB_EPC3_REG_USB_EP_Msk       (0xfUL)                   /*!< USB USB_EPC3_REG: USB_EP (Bitfield-Mask: 0x0f)        */
/* =====================================================  USB_EPC4_REG  ====================================================== */
#define USB_USB_EPC4_REG_USB_STALL_Pos    (7UL)                     /*!< USB USB_EPC4_REG: USB_STALL (Bit 7)                   */
#define USB_USB_EPC4_REG_USB_STALL_Msk    (0x80UL)                  /*!< USB USB_EPC4_REG: USB_STALL (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC4_REG_USB_ISO_Pos      (5UL)                     /*!< USB USB_EPC4_REG: USB_ISO (Bit 5)                     */
#define USB_USB_EPC4_REG_USB_ISO_Msk      (0x20UL)                  /*!< USB USB_EPC4_REG: USB_ISO (Bitfield-Mask: 0x01)       */
#define USB_USB_EPC4_REG_USB_EP_EN_Pos    (4UL)                     /*!< USB USB_EPC4_REG: USB_EP_EN (Bit 4)                   */
#define USB_USB_EPC4_REG_USB_EP_EN_Msk    (0x10UL)                  /*!< USB USB_EPC4_REG: USB_EP_EN (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC4_REG_USB_EP_Pos       (0UL)                     /*!< USB USB_EPC4_REG: USB_EP (Bit 0)                      */
#define USB_USB_EPC4_REG_USB_EP_Msk       (0xfUL)                   /*!< USB USB_EPC4_REG: USB_EP (Bitfield-Mask: 0x0f)        */
/* =====================================================  USB_EPC5_REG  ====================================================== */
#define USB_USB_EPC5_REG_USB_STALL_Pos    (7UL)                     /*!< USB USB_EPC5_REG: USB_STALL (Bit 7)                   */
#define USB_USB_EPC5_REG_USB_STALL_Msk    (0x80UL)                  /*!< USB USB_EPC5_REG: USB_STALL (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC5_REG_USB_ISO_Pos      (5UL)                     /*!< USB USB_EPC5_REG: USB_ISO (Bit 5)                     */
#define USB_USB_EPC5_REG_USB_ISO_Msk      (0x20UL)                  /*!< USB USB_EPC5_REG: USB_ISO (Bitfield-Mask: 0x01)       */
#define USB_USB_EPC5_REG_USB_EP_EN_Pos    (4UL)                     /*!< USB USB_EPC5_REG: USB_EP_EN (Bit 4)                   */
#define USB_USB_EPC5_REG_USB_EP_EN_Msk    (0x10UL)                  /*!< USB USB_EPC5_REG: USB_EP_EN (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC5_REG_USB_EP_Pos       (0UL)                     /*!< USB USB_EPC5_REG: USB_EP (Bit 0)                      */
#define USB_USB_EPC5_REG_USB_EP_Msk       (0xfUL)                   /*!< USB USB_EPC5_REG: USB_EP (Bitfield-Mask: 0x0f)        */
/* =====================================================  USB_EPC6_REG  ====================================================== */
#define USB_USB_EPC6_REG_USB_STALL_Pos    (7UL)                     /*!< USB USB_EPC6_REG: USB_STALL (Bit 7)                   */
#define USB_USB_EPC6_REG_USB_STALL_Msk    (0x80UL)                  /*!< USB USB_EPC6_REG: USB_STALL (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC6_REG_USB_ISO_Pos      (5UL)                     /*!< USB USB_EPC6_REG: USB_ISO (Bit 5)                     */
#define USB_USB_EPC6_REG_USB_ISO_Msk      (0x20UL)                  /*!< USB USB_EPC6_REG: USB_ISO (Bitfield-Mask: 0x01)       */
#define USB_USB_EPC6_REG_USB_EP_EN_Pos    (4UL)                     /*!< USB USB_EPC6_REG: USB_EP_EN (Bit 4)                   */
#define USB_USB_EPC6_REG_USB_EP_EN_Msk    (0x10UL)                  /*!< USB USB_EPC6_REG: USB_EP_EN (Bitfield-Mask: 0x01)     */
#define USB_USB_EPC6_REG_USB_EP_Pos       (0UL)                     /*!< USB USB_EPC6_REG: USB_EP (Bit 0)                      */
#define USB_USB_EPC6_REG_USB_EP_Msk       (0xfUL)                   /*!< USB USB_EPC6_REG: USB_EP (Bitfield-Mask: 0x0f)        */
/* ======================================================  USB_FAR_REG  ====================================================== */
#define USB_USB_FAR_REG_USB_AD_EN_Pos     (7UL)                     /*!< USB USB_FAR_REG: USB_AD_EN (Bit 7)                    */
#define USB_USB_FAR_REG_USB_AD_EN_Msk     (0x80UL)                  /*!< USB USB_FAR_REG: USB_AD_EN (Bitfield-Mask: 0x01)      */
#define USB_USB_FAR_REG_USB_AD_Pos        (0UL)                     /*!< USB USB_FAR_REG: USB_AD (Bit 0)                       */
#define USB_USB_FAR_REG_USB_AD_Msk        (0x7fUL)                  /*!< USB USB_FAR_REG: USB_AD (Bitfield-Mask: 0x7f)         */
/* ======================================================  USB_FNH_REG  ====================================================== */
#define USB_USB_FNH_REG_USB_MF_Pos        (7UL)                     /*!< USB USB_FNH_REG: USB_MF (Bit 7)                       */
#define USB_USB_FNH_REG_USB_MF_Msk        (0x80UL)                  /*!< USB USB_FNH_REG: USB_MF (Bitfield-Mask: 0x01)         */
#define USB_USB_FNH_REG_USB_UL_Pos        (6UL)                     /*!< USB USB_FNH_REG: USB_UL (Bit 6)                       */
#define USB_USB_FNH_REG_USB_UL_Msk        (0x40UL)                  /*!< USB USB_FNH_REG: USB_UL (Bitfield-Mask: 0x01)         */
#define USB_USB_FNH_REG_USB_RFC_Pos       (5UL)                     /*!< USB USB_FNH_REG: USB_RFC (Bit 5)                      */
#define USB_USB_FNH_REG_USB_RFC_Msk       (0x20UL)                  /*!< USB USB_FNH_REG: USB_RFC (Bitfield-Mask: 0x01)        */
#define USB_USB_FNH_REG_USB_FN_10_8_Pos   (0UL)                     /*!< USB USB_FNH_REG: USB_FN_10_8 (Bit 0)                  */
#define USB_USB_FNH_REG_USB_FN_10_8_Msk   (0x7UL)                   /*!< USB USB_FNH_REG: USB_FN_10_8 (Bitfield-Mask: 0x07)    */
/* ======================================================  USB_FNL_REG  ====================================================== */
#define USB_USB_FNL_REG_USB_FN_Pos        (0UL)                     /*!< USB USB_FNL_REG: USB_FN (Bit 0)                       */
#define USB_USB_FNL_REG_USB_FN_Msk        (0xffUL)                  /*!< USB USB_FNL_REG: USB_FN (Bitfield-Mask: 0xff)         */
/* =====================================================  USB_FWEV_REG  ====================================================== */
#define USB_USB_FWEV_REG_USB_RXWARN31_Pos (4UL)                     /*!< USB USB_FWEV_REG: USB_RXWARN31 (Bit 4)                */
#define USB_USB_FWEV_REG_USB_RXWARN31_Msk (0x70UL)                  /*!< USB USB_FWEV_REG: USB_RXWARN31 (Bitfield-Mask: 0x07)  */
#define USB_USB_FWEV_REG_USB_TXWARN31_Pos (0UL)                     /*!< USB USB_FWEV_REG: USB_TXWARN31 (Bit 0)                */
#define USB_USB_FWEV_REG_USB_TXWARN31_Msk (0x7UL)                   /*!< USB USB_FWEV_REG: USB_TXWARN31 (Bitfield-Mask: 0x07)  */
/* =====================================================  USB_FWMSK_REG  ===================================================== */
#define USB_USB_FWMSK_REG_USB_M_RXWARN31_Pos (4UL)                  /*!< USB USB_FWMSK_REG: USB_M_RXWARN31 (Bit 4)             */
#define USB_USB_FWMSK_REG_USB_M_RXWARN31_Msk (0x70UL)               /*!< USB USB_FWMSK_REG: USB_M_RXWARN31 (Bitfield-Mask: 0x07) */
#define USB_USB_FWMSK_REG_USB_M_TXWARN31_Pos (0UL)                  /*!< USB USB_FWMSK_REG: USB_M_TXWARN31 (Bit 0)             */
#define USB_USB_FWMSK_REG_USB_M_TXWARN31_Msk (0x7UL)                /*!< USB USB_FWMSK_REG: USB_M_TXWARN31 (Bitfield-Mask: 0x07) */
/* =====================================================  USB_MAEV_REG  ====================================================== */
#define USB_USB_MAEV_REG_USB_CH_EV_Pos    (11UL)                    /*!< USB USB_MAEV_REG: USB_CH_EV (Bit 11)                  */
#define USB_USB_MAEV_REG_USB_CH_EV_Msk    (0x800UL)                 /*!< USB USB_MAEV_REG: USB_CH_EV (Bitfield-Mask: 0x01)     */
#define USB_USB_MAEV_REG_USB_EP0_NAK_Pos  (10UL)                    /*!< USB USB_MAEV_REG: USB_EP0_NAK (Bit 10)                */
#define USB_USB_MAEV_REG_USB_EP0_NAK_Msk  (0x400UL)                 /*!< USB USB_MAEV_REG: USB_EP0_NAK (Bitfield-Mask: 0x01)   */
#define USB_USB_MAEV_REG_USB_EP0_RX_Pos   (9UL)                     /*!< USB USB_MAEV_REG: USB_EP0_RX (Bit 9)                  */
#define USB_USB_MAEV_REG_USB_EP0_RX_Msk   (0x200UL)                 /*!< USB USB_MAEV_REG: USB_EP0_RX (Bitfield-Mask: 0x01)    */
#define USB_USB_MAEV_REG_USB_EP0_TX_Pos   (8UL)                     /*!< USB USB_MAEV_REG: USB_EP0_TX (Bit 8)                  */
#define USB_USB_MAEV_REG_USB_EP0_TX_Msk   (0x100UL)                 /*!< USB USB_MAEV_REG: USB_EP0_TX (Bitfield-Mask: 0x01)    */
#define USB_USB_MAEV_REG_USB_INTR_Pos     (7UL)                     /*!< USB USB_MAEV_REG: USB_INTR (Bit 7)                    */
#define USB_USB_MAEV_REG_USB_INTR_Msk     (0x80UL)                  /*!< USB USB_MAEV_REG: USB_INTR (Bitfield-Mask: 0x01)      */
#define USB_USB_MAEV_REG_USB_RX_EV_Pos    (6UL)                     /*!< USB USB_MAEV_REG: USB_RX_EV (Bit 6)                   */
#define USB_USB_MAEV_REG_USB_RX_EV_Msk    (0x40UL)                  /*!< USB USB_MAEV_REG: USB_RX_EV (Bitfield-Mask: 0x01)     */
#define USB_USB_MAEV_REG_USB_ULD_Pos      (5UL)                     /*!< USB USB_MAEV_REG: USB_ULD (Bit 5)                     */
#define USB_USB_MAEV_REG_USB_ULD_Msk      (0x20UL)                  /*!< USB USB_MAEV_REG: USB_ULD (Bitfield-Mask: 0x01)       */
#define USB_USB_MAEV_REG_USB_NAK_Pos      (4UL)                     /*!< USB USB_MAEV_REG: USB_NAK (Bit 4)                     */
#define USB_USB_MAEV_REG_USB_NAK_Msk      (0x10UL)                  /*!< USB USB_MAEV_REG: USB_NAK (Bitfield-Mask: 0x01)       */
#define USB_USB_MAEV_REG_USB_FRAME_Pos    (3UL)                     /*!< USB USB_MAEV_REG: USB_FRAME (Bit 3)                   */
#define USB_USB_MAEV_REG_USB_FRAME_Msk    (0x8UL)                   /*!< USB USB_MAEV_REG: USB_FRAME (Bitfield-Mask: 0x01)     */
#define USB_USB_MAEV_REG_USB_TX_EV_Pos    (2UL)                     /*!< USB USB_MAEV_REG: USB_TX_EV (Bit 2)                   */
#define USB_USB_MAEV_REG_USB_TX_EV_Msk    (0x4UL)                   /*!< USB USB_MAEV_REG: USB_TX_EV (Bitfield-Mask: 0x01)     */
#define USB_USB_MAEV_REG_USB_ALT_Pos      (1UL)                     /*!< USB USB_MAEV_REG: USB_ALT (Bit 1)                     */
#define USB_USB_MAEV_REG_USB_ALT_Msk      (0x2UL)                   /*!< USB USB_MAEV_REG: USB_ALT (Bitfield-Mask: 0x01)       */
#define USB_USB_MAEV_REG_USB_WARN_Pos     (0UL)                     /*!< USB USB_MAEV_REG: USB_WARN (Bit 0)                    */
#define USB_USB_MAEV_REG_USB_WARN_Msk     (0x1UL)                   /*!< USB USB_MAEV_REG: USB_WARN (Bitfield-Mask: 0x01)      */
/* =====================================================  USB_MAMSK_REG  ===================================================== */
#define USB_USB_MAMSK_REG_USB_M_CH_EV_Pos (11UL)                    /*!< USB USB_MAMSK_REG: USB_M_CH_EV (Bit 11)               */
#define USB_USB_MAMSK_REG_USB_M_CH_EV_Msk (0x800UL)                 /*!< USB USB_MAMSK_REG: USB_M_CH_EV (Bitfield-Mask: 0x01)  */
#define USB_USB_MAMSK_REG_USB_M_EP0_NAK_Pos (10UL)                  /*!< USB USB_MAMSK_REG: USB_M_EP0_NAK (Bit 10)             */
#define USB_USB_MAMSK_REG_USB_M_EP0_NAK_Msk (0x400UL)               /*!< USB USB_MAMSK_REG: USB_M_EP0_NAK (Bitfield-Mask: 0x01) */
#define USB_USB_MAMSK_REG_USB_M_EP0_RX_Pos (9UL)                    /*!< USB USB_MAMSK_REG: USB_M_EP0_RX (Bit 9)               */
#define USB_USB_MAMSK_REG_USB_M_EP0_RX_Msk (0x200UL)                /*!< USB USB_MAMSK_REG: USB_M_EP0_RX (Bitfield-Mask: 0x01) */
#define USB_USB_MAMSK_REG_USB_M_EP0_TX_Pos (8UL)                    /*!< USB USB_MAMSK_REG: USB_M_EP0_TX (Bit 8)               */
#define USB_USB_MAMSK_REG_USB_M_EP0_TX_Msk (0x100UL)                /*!< USB USB_MAMSK_REG: USB_M_EP0_TX (Bitfield-Mask: 0x01) */
#define USB_USB_MAMSK_REG_USB_M_INTR_Pos  (7UL)                     /*!< USB USB_MAMSK_REG: USB_M_INTR (Bit 7)                 */
