S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define USB_USB_MAMSK_REG_USB_M_INTR_Msk  (0x80UL)                  /*!< USB USB_MAMSK_REG: USB_M_INTR (Bitfield-Mask: 0x01)   */
#define USB_USB_MAMSK_REG_USB_M_RX_EV_Pos (6UL)                     /*!< USB USB_MAMSK_REG: USB_M_RX_EV (Bit 6)                */
#define USB_USB_MAMSK_REG_USB_M_RX_EV_Msk (0x40UL)                  /*!< USB USB_MAMSK_REG: USB_M_RX_EV (Bitfield-Mask: 0x01)  */
#define USB_USB_MAMSK_REG_USB_M_ULD_Pos   (5UL)                     /*!< USB USB_MAMSK_REG: USB_M_ULD (Bit 5)                  */
#define USB_USB_MAMSK_REG_USB_M_ULD_Msk   (0x20UL)                  /*!< USB USB_MAMSK_REG: USB_M_ULD (Bitfield-Mask: 0x01)    */
#define USB_USB_MAMSK_REG_USB_M_NAK_Pos   (4UL)                     /*!< USB USB_MAMSK_REG: USB_M_NAK (Bit 4)                  */
#define USB_USB_MAMSK_REG_USB_M_NAK_Msk   (0x10UL)                  /*!< USB USB_MAMSK_REG: USB_M_NAK (Bitfield-Mask: 0x01)    */
#define USB_USB_MAMSK_REG_USB_M_FRAME_Pos (3UL)                     /*!< USB USB_MAMSK_REG: USB_M_FRAME (Bit 3)                */
#define USB_USB_MAMSK_REG_USB_M_FRAME_Msk (0x8UL)                   /*!< USB USB_MAMSK_REG: USB_M_FRAME (Bitfield-Mask: 0x01)  */
#define USB_USB_MAMSK_REG_USB_M_TX_EV_Pos (2UL)                     /*!< USB USB_MAMSK_REG: USB_M_TX_EV (Bit 2)                */
#define USB_USB_MAMSK_REG_USB_M_TX_EV_Msk (0x4UL)                   /*!< USB USB_MAMSK_REG: USB_M_TX_EV (Bitfield-Mask: 0x01)  */
#define USB_USB_MAMSK_REG_USB_M_ALT_Pos   (1UL)                     /*!< USB USB_MAMSK_REG: USB_M_ALT (Bit 1)                  */
#define USB_USB_MAMSK_REG_USB_M_ALT_Msk   (0x2UL)                   /*!< USB USB_MAMSK_REG: USB_M_ALT (Bitfield-Mask: 0x01)    */
#define USB_USB_MAMSK_REG_USB_M_WARN_Pos  (0UL)                     /*!< USB USB_MAMSK_REG: USB_M_WARN (Bit 0)                 */
#define USB_USB_MAMSK_REG_USB_M_WARN_Msk  (0x1UL)                   /*!< USB USB_MAMSK_REG: USB_M_WARN (Bitfield-Mask: 0x01)   */
/* =====================================================  USB_MCTRL_REG  ===================================================== */
#define USB_USB_MCTRL_REG_LSMODE_Pos      (4UL)                     /*!< USB USB_MCTRL_REG: LSMODE (Bit 4)                     */
#define USB_USB_MCTRL_REG_LSMODE_Msk      (0x10UL)                  /*!< USB USB_MCTRL_REG: LSMODE (Bitfield-Mask: 0x01)       */
#define USB_USB_MCTRL_REG_USB_NAT_Pos     (3UL)                     /*!< USB USB_MCTRL_REG: USB_NAT (Bit 3)                    */
#define USB_USB_MCTRL_REG_USB_NAT_Msk     (0x8UL)                   /*!< USB USB_MCTRL_REG: USB_NAT (Bitfield-Mask: 0x01)      */
#define USB_USB_MCTRL_REG_USB_DBG_Pos     (1UL)                     /*!< USB USB_MCTRL_REG: USB_DBG (Bit 1)                    */
#define USB_USB_MCTRL_REG_USB_DBG_Msk     (0x2UL)                   /*!< USB USB_MCTRL_REG: USB_DBG (Bitfield-Mask: 0x01)      */
#define USB_USB_MCTRL_REG_USBEN_Pos       (0UL)                     /*!< USB USB_MCTRL_REG: USBEN (Bit 0)                      */
#define USB_USB_MCTRL_REG_USBEN_Msk       (0x1UL)                   /*!< USB USB_MCTRL_REG: USBEN (Bitfield-Mask: 0x01)        */
/* =====================================================  USB_NAKEV_REG  ===================================================== */
#define USB_USB_NAKEV_REG_USB_OUT31_Pos   (4UL)                     /*!< USB USB_NAKEV_REG: USB_OUT31 (Bit 4)                  */
#define USB_USB_NAKEV_REG_USB_OUT31_Msk   (0x70UL)                  /*!< USB USB_NAKEV_REG: USB_OUT31 (Bitfield-Mask: 0x07)    */
#define USB_USB_NAKEV_REG_USB_IN31_Pos    (0UL)                     /*!< USB USB_NAKEV_REG: USB_IN31 (Bit 0)                   */
#define USB_USB_NAKEV_REG_USB_IN31_Msk    (0x7UL)                   /*!< USB USB_NAKEV_REG: USB_IN31 (Bitfield-Mask: 0x07)     */
/* ====================================================  USB_NAKMSK_REG  ===================================================== */
#define USB_USB_NAKMSK_REG_USB_M_OUT31_Pos (4UL)                    /*!< USB USB_NAKMSK_REG: USB_M_OUT31 (Bit 4)               */
#define USB_USB_NAKMSK_REG_USB_M_OUT31_Msk (0x70UL)                 /*!< USB USB_NAKMSK_REG: USB_M_OUT31 (Bitfield-Mask: 0x07) */
#define USB_USB_NAKMSK_REG_USB_M_IN31_Pos (0UL)                     /*!< USB USB_NAKMSK_REG: USB_M_IN31 (Bit 0)                */
#define USB_USB_NAKMSK_REG_USB_M_IN31_Msk (0x7UL)                   /*!< USB USB_NAKMSK_REG: USB_M_IN31 (Bitfield-Mask: 0x07)  */
/* =====================================================  USB_NFSR_REG  ====================================================== */
#define USB_USB_NFSR_REG_USB_NFS_Pos      (0UL)                     /*!< USB USB_NFSR_REG: USB_NFS (Bit 0)                     */
#define USB_USB_NFSR_REG_USB_NFS_Msk      (0x3UL)                   /*!< USB USB_NFSR_REG: USB_NFS (Bitfield-Mask: 0x03)       */
/* =====================================================  USB_RXC0_REG  ====================================================== */
#define USB_USB_RXC0_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_RXC0_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_RXC0_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_RXC0_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_RXC0_REG_USB_IGN_SETUP_Pos (2UL)                    /*!< USB USB_RXC0_REG: USB_IGN_SETUP (Bit 2)               */
#define USB_USB_RXC0_REG_USB_IGN_SETUP_Msk (0x4UL)                  /*!< USB USB_RXC0_REG: USB_IGN_SETUP (Bitfield-Mask: 0x01) */
#define USB_USB_RXC0_REG_USB_IGN_OUT_Pos  (1UL)                     /*!< USB USB_RXC0_REG: USB_IGN_OUT (Bit 1)                 */
#define USB_USB_RXC0_REG_USB_IGN_OUT_Msk  (0x2UL)                   /*!< USB USB_RXC0_REG: USB_IGN_OUT (Bitfield-Mask: 0x01)   */
#define USB_USB_RXC0_REG_USB_RX_EN_Pos    (0UL)                     /*!< USB USB_RXC0_REG: USB_RX_EN (Bit 0)                   */
#define USB_USB_RXC0_REG_USB_RX_EN_Msk    (0x1UL)                   /*!< USB USB_RXC0_REG: USB_RX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_RXC1_REG  ====================================================== */
#define USB_USB_RXC1_REG_USB_RFWL_Pos     (5UL)                     /*!< USB USB_RXC1_REG: USB_RFWL (Bit 5)                    */
#define USB_USB_RXC1_REG_USB_RFWL_Msk     (0x60UL)                  /*!< USB USB_RXC1_REG: USB_RFWL (Bitfield-Mask: 0x03)      */
#define USB_USB_RXC1_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_RXC1_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_RXC1_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_RXC1_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_RXC1_REG_USB_IGN_SETUP_Pos (2UL)                    /*!< USB USB_RXC1_REG: USB_IGN_SETUP (Bit 2)               */
#define USB_USB_RXC1_REG_USB_IGN_SETUP_Msk (0x4UL)                  /*!< USB USB_RXC1_REG: USB_IGN_SETUP (Bitfield-Mask: 0x01) */
#define USB_USB_RXC1_REG_USB_RX_EN_Pos    (0UL)                     /*!< USB USB_RXC1_REG: USB_RX_EN (Bit 0)                   */
#define USB_USB_RXC1_REG_USB_RX_EN_Msk    (0x1UL)                   /*!< USB USB_RXC1_REG: USB_RX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_RXC2_REG  ====================================================== */
#define USB_USB_RXC2_REG_USB_RFWL_Pos     (5UL)                     /*!< USB USB_RXC2_REG: USB_RFWL (Bit 5)                    */
#define USB_USB_RXC2_REG_USB_RFWL_Msk     (0x60UL)                  /*!< USB USB_RXC2_REG: USB_RFWL (Bitfield-Mask: 0x03)      */
#define USB_USB_RXC2_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_RXC2_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_RXC2_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_RXC2_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_RXC2_REG_USB_IGN_SETUP_Pos (2UL)                    /*!< USB USB_RXC2_REG: USB_IGN_SETUP (Bit 2)               */
#define USB_USB_RXC2_REG_USB_IGN_SETUP_Msk (0x4UL)                  /*!< USB USB_RXC2_REG: USB_IGN_SETUP (Bitfield-Mask: 0x01) */
#define USB_USB_RXC2_REG_USB_RX_EN_Pos    (0UL)                     /*!< USB USB_RXC2_REG: USB_RX_EN (Bit 0)                   */
#define USB_USB_RXC2_REG_USB_RX_EN_Msk    (0x1UL)                   /*!< USB USB_RXC2_REG: USB_RX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_RXC3_REG  ====================================================== */
#define USB_USB_RXC3_REG_USB_RFWL_Pos     (5UL)                     /*!< USB USB_RXC3_REG: USB_RFWL (Bit 5)                    */
#define USB_USB_RXC3_REG_USB_RFWL_Msk     (0x60UL)                  /*!< USB USB_RXC3_REG: USB_RFWL (Bitfield-Mask: 0x03)      */
#define USB_USB_RXC3_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_RXC3_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_RXC3_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_RXC3_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_RXC3_REG_USB_IGN_SETUP_Pos (2UL)                    /*!< USB USB_RXC3_REG: USB_IGN_SETUP (Bit 2)               */
#define USB_USB_RXC3_REG_USB_IGN_SETUP_Msk (0x4UL)                  /*!< USB USB_RXC3_REG: USB_IGN_SETUP (Bitfield-Mask: 0x01) */
#define USB_USB_RXC3_REG_USB_RX_EN_Pos    (0UL)                     /*!< USB USB_RXC3_REG: USB_RX_EN (Bit 0)                   */
#define USB_USB_RXC3_REG_USB_RX_EN_Msk    (0x1UL)                   /*!< USB USB_RXC3_REG: USB_RX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_RXD0_REG  ====================================================== */
#define USB_USB_RXD0_REG_USB_RXFD_Pos     (0UL)                     /*!< USB USB_RXD0_REG: USB_RXFD (Bit 0)                    */
#define USB_USB_RXD0_REG_USB_RXFD_Msk     (0xffUL)                  /*!< USB USB_RXD0_REG: USB_RXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_RXD1_REG  ====================================================== */
#define USB_USB_RXD1_REG_USB_RXFD_Pos     (0UL)                     /*!< USB USB_RXD1_REG: USB_RXFD (Bit 0)                    */
#define USB_USB_RXD1_REG_USB_RXFD_Msk     (0xffUL)                  /*!< USB USB_RXD1_REG: USB_RXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_RXD2_REG  ====================================================== */
#define USB_USB_RXD2_REG_USB_RXFD_Pos     (0UL)                     /*!< USB USB_RXD2_REG: USB_RXFD (Bit 0)                    */
#define USB_USB_RXD2_REG_USB_RXFD_Msk     (0xffUL)                  /*!< USB USB_RXD2_REG: USB_RXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_RXD3_REG  ====================================================== */
#define USB_USB_RXD3_REG_USB_RXFD_Pos     (0UL)                     /*!< USB USB_RXD3_REG: USB_RXFD (Bit 0)                    */
#define USB_USB_RXD3_REG_USB_RXFD_Msk     (0xffUL)                  /*!< USB USB_RXD3_REG: USB_RXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_RXEV_REG  ====================================================== */
#define USB_USB_RXEV_REG_USB_RXOVRRN31_Pos (4UL)                    /*!< USB USB_RXEV_REG: USB_RXOVRRN31 (Bit 4)               */
#define USB_USB_RXEV_REG_USB_RXOVRRN31_Msk (0x70UL)                 /*!< USB USB_RXEV_REG: USB_RXOVRRN31 (Bitfield-Mask: 0x07) */
#define USB_USB_RXEV_REG_USB_RXFIFO31_Pos (0UL)                     /*!< USB USB_RXEV_REG: USB_RXFIFO31 (Bit 0)                */
#define USB_USB_RXEV_REG_USB_RXFIFO31_Msk (0x7UL)                   /*!< USB USB_RXEV_REG: USB_RXFIFO31 (Bitfield-Mask: 0x07)  */
/* =====================================================  USB_RXMSK_REG  ===================================================== */
#define USB_USB_RXMSK_REG_USB_M_RXOVRRN31_Pos (4UL)                 /*!< USB USB_RXMSK_REG: USB_M_RXOVRRN31 (Bit 4)            */
#define USB_USB_RXMSK_REG_USB_M_RXOVRRN31_Msk (0x70UL)              /*!< USB USB_RXMSK_REG: USB_M_RXOVRRN31 (Bitfield-Mask: 0x07) */
#define USB_USB_RXMSK_REG_USB_M_RXFIFO31_Pos (0UL)                  /*!< USB USB_RXMSK_REG: USB_M_RXFIFO31 (Bit 0)             */
#define USB_USB_RXMSK_REG_USB_M_RXFIFO31_Msk (0x7UL)                /*!< USB USB_RXMSK_REG: USB_M_RXFIFO31 (Bitfield-Mask: 0x07) */
/* =====================================================  USB_RXS0_REG  ====================================================== */
#define USB_USB_RXS0_REG_USB_SETUP_Pos    (6UL)                     /*!< USB USB_RXS0_REG: USB_SETUP (Bit 6)                   */
#define USB_USB_RXS0_REG_USB_SETUP_Msk    (0x40UL)                  /*!< USB USB_RXS0_REG: USB_SETUP (Bitfield-Mask: 0x01)     */
#define USB_USB_RXS0_REG_USB_TOGGLE_RX0_Pos (5UL)                   /*!< USB USB_RXS0_REG: USB_TOGGLE_RX0 (Bit 5)              */
#define USB_USB_RXS0_REG_USB_TOGGLE_RX0_Msk (0x20UL)                /*!< USB USB_RXS0_REG: USB_TOGGLE_RX0 (Bitfield-Mask: 0x01) */
#define USB_USB_RXS0_REG_USB_RX_LAST_Pos  (4UL)                     /*!< USB USB_RXS0_REG: USB_RX_LAST (Bit 4)                 */
#define USB_USB_RXS0_REG_USB_RX_LAST_Msk  (0x10UL)                  /*!< USB USB_RXS0_REG: USB_RX_LAST (Bitfield-Mask: 0x01)   */
#define USB_USB_RXS0_REG_USB_RCOUNT_Pos   (0UL)                     /*!< USB USB_RXS0_REG: USB_RCOUNT (Bit 0)                  */
#define USB_USB_RXS0_REG_USB_RCOUNT_Msk   (0xfUL)                   /*!< USB USB_RXS0_REG: USB_RCOUNT (Bitfield-Mask: 0x0f)    */
/* =====================================================  USB_RXS1_REG  ====================================================== */
#define USB_USB_RXS1_REG_USB_RX_ERR_Pos   (7UL)                     /*!< USB USB_RXS1_REG: USB_RX_ERR (Bit 7)                  */
#define USB_USB_RXS1_REG_USB_RX_ERR_Msk   (0x80UL)                  /*!< USB USB_RXS1_REG: USB_RX_ERR (Bitfield-Mask: 0x01)    */
#define USB_USB_RXS1_REG_USB_SETUP_Pos    (6UL)                     /*!< USB USB_RXS1_REG: USB_SETUP (Bit 6)                   */
#define USB_USB_RXS1_REG_USB_SETUP_Msk    (0x40UL)                  /*!< USB USB_RXS1_REG: USB_SETUP (Bitfield-Mask: 0x01)     */
#define USB_USB_RXS1_REG_USB_TOGGLE_RX_Pos (5UL)                    /*!< USB USB_RXS1_REG: USB_TOGGLE_RX (Bit 5)               */
#define USB_USB_RXS1_REG_USB_TOGGLE_RX_Msk (0x20UL)                 /*!< USB USB_RXS1_REG: USB_TOGGLE_RX (Bitfield-Mask: 0x01) */
#define USB_USB_RXS1_REG_USB_RX_LAST_Pos  (4UL)                     /*!< USB USB_RXS1_REG: USB_RX_LAST (Bit 4)                 */
#define USB_USB_RXS1_REG_USB_RX_LAST_Msk  (0x10UL)                  /*!< USB USB_RXS1_REG: USB_RX_LAST (Bitfield-Mask: 0x01)   */
#define USB_USB_RXS1_REG_USB_RCOUNT_Pos   (0UL)                     /*!< USB USB_RXS1_REG: USB_RCOUNT (Bit 0)                  */
#define USB_USB_RXS1_REG_USB_RCOUNT_Msk   (0xfUL)                   /*!< USB USB_RXS1_REG: USB_RCOUNT (Bitfield-Mask: 0x0f)    */
/* =====================================================  USB_RXS2_REG  ====================================================== */
#define USB_USB_RXS2_REG_USB_RX_ERR_Pos   (7UL)                     /*!< USB USB_RXS2_REG: USB_RX_ERR (Bit 7)                  */
#define USB_USB_RXS2_REG_USB_RX_ERR_Msk   (0x80UL)                  /*!< USB USB_RXS2_REG: USB_RX_ERR (Bitfield-Mask: 0x01)    */
#define USB_USB_RXS2_REG_USB_SETUP_Pos    (6UL)                     /*!< USB USB_RXS2_REG: USB_SETUP (Bit 6)                   */
#define USB_USB_RXS2_REG_USB_SETUP_Msk    (0x40UL)                  /*!< USB USB_RXS2_REG: USB_SETUP (Bitfield-Mask: 0x01)     */
#define USB_USB_RXS2_REG_USB_TOGGLE_RX_Pos (5UL)                    /*!< USB USB_RXS2_REG: USB_TOGGLE_RX (Bit 5)               */
#define USB_USB_RXS2_REG_USB_TOGGLE_RX_Msk (0x20UL)                 /*!< USB USB_RXS2_REG: USB_TOGGLE_RX (Bitfield-Mask: 0x01) */
#define USB_USB_RXS2_REG_USB_RX_LAST_Pos  (4UL)                     /*!< USB USB_RXS2_REG: USB_RX_LAST (Bit 4)                 */
#define USB_USB_RXS2_REG_USB_RX_LAST_Msk  (0x10UL)                  /*!< USB USB_RXS2_REG: USB_RX_LAST (Bitfield-Mask: 0x01)   */
#define USB_USB_RXS2_REG_USB_RCOUNT_Pos   (0UL)                     /*!< USB USB_RXS2_REG: USB_RCOUNT (Bit 0)                  */
#define USB_USB_RXS2_REG_USB_RCOUNT_Msk   (0xfUL)                   /*!< USB USB_RXS2_REG: USB_RCOUNT (Bitfield-Mask: 0x0f)    */
/* =====================================================  USB_RXS3_REG  ====================================================== */
#define USB_USB_RXS3_REG_USB_RX_ERR_Pos   (7UL)                     /*!< USB USB_RXS3_REG: USB_RX_ERR (Bit 7)                  */
#define USB_USB_RXS3_REG_USB_RX_ERR_Msk   (0x80UL)                  /*!< USB USB_RXS3_REG: USB_RX_ERR (Bitfield-Mask: 0x01)    */
#define USB_USB_RXS3_REG_USB_SETUP_Pos    (6UL)                     /*!< USB USB_RXS3_REG: USB_SETUP (Bit 6)                   */
#define USB_USB_RXS3_REG_USB_SETUP_Msk    (0x40UL)                  /*!< USB USB_RXS3_REG: USB_SETUP (Bitfield-Mask: 0x01)     */
#define USB_USB_RXS3_REG_USB_TOGGLE_RX_Pos (5UL)                    /*!< USB USB_RXS3_REG: USB_TOGGLE_RX (Bit 5)               */
#define USB_USB_RXS3_REG_USB_TOGGLE_RX_Msk (0x20UL)                 /*!< USB USB_RXS3_REG: USB_TOGGLE_RX (Bitfield-Mask: 0x01) */
#define USB_USB_RXS3_REG_USB_RX_LAST_Pos  (4UL)                     /*!< USB USB_RXS3_REG: USB_RX_LAST (Bit 4)                 */
#define USB_USB_RXS3_REG_USB_RX_LAST_Msk  (0x10UL)                  /*!< USB USB_RXS3_REG: USB_RX_LAST (Bitfield-Mask: 0x01)   */
#define USB_USB_RXS3_REG_USB_RCOUNT_Pos   (0UL)                     /*!< USB USB_RXS3_REG: USB_RCOUNT (Bit 0)                  */
#define USB_USB_RXS3_REG_USB_RCOUNT_Msk   (0xfUL)                   /*!< USB USB_RXS3_REG: USB_RCOUNT (Bitfield-Mask: 0x0f)    */
/* ======================================================  USB_TCR_REG  ====================================================== */
#define USB_USB_TCR_REG_USB_VADJ_Pos      (5UL)                     /*!< USB USB_TCR_REG: USB_VADJ (Bit 5)                     */
#define USB_USB_TCR_REG_USB_VADJ_Msk      (0xe0UL)                  /*!< USB USB_TCR_REG: USB_VADJ (Bitfield-Mask: 0x07)       */
#define USB_USB_TCR_REG_USB_CADJ_Pos      (0UL)                     /*!< USB USB_TCR_REG: USB_CADJ (Bit 0)                     */
#define USB_USB_TCR_REG_USB_CADJ_Msk      (0x1fUL)                  /*!< USB USB_TCR_REG: USB_CADJ (Bitfield-Mask: 0x1f)       */
/* =====================================================  USB_TXC0_REG  ====================================================== */
#define USB_USB_TXC0_REG_USB_IGN_IN_Pos   (4UL)                     /*!< USB USB_TXC0_REG: USB_IGN_IN (Bit 4)                  */
#define USB_USB_TXC0_REG_USB_IGN_IN_Msk   (0x10UL)                  /*!< USB USB_TXC0_REG: USB_IGN_IN (Bitfield-Mask: 0x01)    */
#define USB_USB_TXC0_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_TXC0_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_TXC0_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_TXC0_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_TXC0_REG_USB_TOGGLE_TX0_Pos (2UL)                   /*!< USB USB_TXC0_REG: USB_TOGGLE_TX0 (Bit 2)              */
#define USB_USB_TXC0_REG_USB_TOGGLE_TX0_Msk (0x4UL)                 /*!< USB USB_TXC0_REG: USB_TOGGLE_TX0 (Bitfield-Mask: 0x01) */
#define USB_USB_TXC0_REG_USB_TX_EN_Pos    (0UL)                     /*!< USB USB_TXC0_REG: USB_TX_EN (Bit 0)                   */
#define USB_USB_TXC0_REG_USB_TX_EN_Msk    (0x1UL)                   /*!< USB USB_TXC0_REG: USB_TX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_TXC1_REG  ====================================================== */
#define USB_USB_TXC1_REG_USB_IGN_ISOMSK_Pos (7UL)                   /*!< USB USB_TXC1_REG: USB_IGN_ISOMSK (Bit 7)              */
#define USB_USB_TXC1_REG_USB_IGN_ISOMSK_Msk (0x80UL)                /*!< USB USB_TXC1_REG: USB_IGN_ISOMSK (Bitfield-Mask: 0x01) */
#define USB_USB_TXC1_REG_USB_TFWL_Pos     (5UL)                     /*!< USB USB_TXC1_REG: USB_TFWL (Bit 5)                    */
#define USB_USB_TXC1_REG_USB_TFWL_Msk     (0x60UL)                  /*!< USB USB_TXC1_REG: USB_TFWL (Bitfield-Mask: 0x03)      */
#define USB_USB_TXC1_REG_USB_RFF_Pos      (4UL)                     /*!< USB USB_TXC1_REG: USB_RFF (Bit 4)                     */
#define USB_USB_TXC1_REG_USB_RFF_Msk      (0x10UL)                  /*!< USB USB_TXC1_REG: USB_RFF (Bitfield-Mask: 0x01)       */
#define USB_USB_TXC1_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_TXC1_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_TXC1_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_TXC1_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_TXC1_REG_USB_TOGGLE_TX_Pos (2UL)                    /*!< USB USB_TXC1_REG: USB_TOGGLE_TX (Bit 2)               */
#define USB_USB_TXC1_REG_USB_TOGGLE_TX_Msk (0x4UL)                  /*!< USB USB_TXC1_REG: USB_TOGGLE_TX (Bitfield-Mask: 0x01) */
#define USB_USB_TXC1_REG_USB_LAST_Pos     (1UL)                     /*!< USB USB_TXC1_REG: USB_LAST (Bit 1)                    */
#define USB_USB_TXC1_REG_USB_LAST_Msk     (0x2UL)                   /*!< USB USB_TXC1_REG: USB_LAST (Bitfield-Mask: 0x01)      */
#define USB_USB_TXC1_REG_USB_TX_EN_Pos    (0UL)                     /*!< USB USB_TXC1_REG: USB_TX_EN (Bit 0)                   */
#define USB_USB_TXC1_REG_USB_TX_EN_Msk    (0x1UL)                   /*!< USB USB_TXC1_REG: USB_TX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_TXC2_REG  ====================================================== */
#define USB_USB_TXC2_REG_USB_IGN_ISOMSK_Pos (7UL)                   /*!< USB USB_TXC2_REG: USB_IGN_ISOMSK (Bit 7)              */
#define USB_USB_TXC2_REG_USB_IGN_ISOMSK_Msk (0x80UL)                /*!< USB USB_TXC2_REG: USB_IGN_ISOMSK (Bitfield-Mask: 0x01) */
#define USB_USB_TXC2_REG_USB_TFWL_Pos     (5UL)                     /*!< USB USB_TXC2_REG: USB_TFWL (Bit 5)                    */
#define USB_USB_TXC2_REG_USB_TFWL_Msk     (0x60UL)                  /*!< USB USB_TXC2_REG: USB_TFWL (Bitfield-Mask: 0x03)      */
#define USB_USB_TXC2_REG_USB_RFF_Pos      (4UL)                     /*!< USB USB_TXC2_REG: USB_RFF (Bit 4)                     */
#define USB_USB_TXC2_REG_USB_RFF_Msk      (0x10UL)                  /*!< USB USB_TXC2_REG: USB_RFF (Bitfield-Mask: 0x01)       */
#define USB_USB_TXC2_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_TXC2_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_TXC2_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_TXC2_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_TXC2_REG_USB_TOGGLE_TX_Pos (2UL)                    /*!< USB USB_TXC2_REG: USB_TOGGLE_TX (Bit 2)               */
#define USB_USB_TXC2_REG_USB_TOGGLE_TX_Msk (0x4UL)                  /*!< USB USB_TXC2_REG: USB_TOGGLE_TX (Bitfield-Mask: 0x01) */
#define USB_USB_TXC2_REG_USB_LAST_Pos     (1UL)                     /*!< USB USB_TXC2_REG: USB_LAST (Bit 1)                    */
#define USB_USB_TXC2_REG_USB_LAST_Msk     (0x2UL)                   /*!< USB USB_TXC2_REG: USB_LAST (Bitfield-Mask: 0x01)      */
#define USB_USB_TXC2_REG_USB_TX_EN_Pos    (0UL)                     /*!< USB USB_TXC2_REG: USB_TX_EN (Bit 0)                   */
#define USB_USB_TXC2_REG_USB_TX_EN_Msk    (0x1UL)                   /*!< USB USB_TXC2_REG: USB_TX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_TXC3_REG  ====================================================== */
#define USB_USB_TXC3_REG_USB_IGN_ISOMSK_Pos (7UL)                   /*!< USB USB_TXC3_REG: USB_IGN_ISOMSK (Bit 7)              */
#define USB_USB_TXC3_REG_USB_IGN_ISOMSK_Msk (0x80UL)                /*!< USB USB_TXC3_REG: USB_IGN_ISOMSK (Bitfield-Mask: 0x01) */
