S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/bsp/include/DA14680AE.h
#define USB_USB_TXC3_REG_USB_TFWL_Pos     (5UL)                     /*!< USB USB_TXC3_REG: USB_TFWL (Bit 5)                    */
#define USB_USB_TXC3_REG_USB_TFWL_Msk     (0x60UL)                  /*!< USB USB_TXC3_REG: USB_TFWL (Bitfield-Mask: 0x03)      */
#define USB_USB_TXC3_REG_USB_RFF_Pos      (4UL)                     /*!< USB USB_TXC3_REG: USB_RFF (Bit 4)                     */
#define USB_USB_TXC3_REG_USB_RFF_Msk      (0x10UL)                  /*!< USB USB_TXC3_REG: USB_RFF (Bitfield-Mask: 0x01)       */
#define USB_USB_TXC3_REG_USB_FLUSH_Pos    (3UL)                     /*!< USB USB_TXC3_REG: USB_FLUSH (Bit 3)                   */
#define USB_USB_TXC3_REG_USB_FLUSH_Msk    (0x8UL)                   /*!< USB USB_TXC3_REG: USB_FLUSH (Bitfield-Mask: 0x01)     */
#define USB_USB_TXC3_REG_USB_TOGGLE_TX_Pos (2UL)                    /*!< USB USB_TXC3_REG: USB_TOGGLE_TX (Bit 2)               */
#define USB_USB_TXC3_REG_USB_TOGGLE_TX_Msk (0x4UL)                  /*!< USB USB_TXC3_REG: USB_TOGGLE_TX (Bitfield-Mask: 0x01) */
#define USB_USB_TXC3_REG_USB_LAST_Pos     (1UL)                     /*!< USB USB_TXC3_REG: USB_LAST (Bit 1)                    */
#define USB_USB_TXC3_REG_USB_LAST_Msk     (0x2UL)                   /*!< USB USB_TXC3_REG: USB_LAST (Bitfield-Mask: 0x01)      */
#define USB_USB_TXC3_REG_USB_TX_EN_Pos    (0UL)                     /*!< USB USB_TXC3_REG: USB_TX_EN (Bit 0)                   */
#define USB_USB_TXC3_REG_USB_TX_EN_Msk    (0x1UL)                   /*!< USB USB_TXC3_REG: USB_TX_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  USB_TXD0_REG  ====================================================== */
#define USB_USB_TXD0_REG_USB_TXFD_Pos     (0UL)                     /*!< USB USB_TXD0_REG: USB_TXFD (Bit 0)                    */
#define USB_USB_TXD0_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB USB_TXD0_REG: USB_TXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_TXD1_REG  ====================================================== */
#define USB_USB_TXD1_REG_USB_TXFD_Pos     (0UL)                     /*!< USB USB_TXD1_REG: USB_TXFD (Bit 0)                    */
#define USB_USB_TXD1_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB USB_TXD1_REG: USB_TXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_TXD2_REG  ====================================================== */
#define USB_USB_TXD2_REG_USB_TXFD_Pos     (0UL)                     /*!< USB USB_TXD2_REG: USB_TXFD (Bit 0)                    */
#define USB_USB_TXD2_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB USB_TXD2_REG: USB_TXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_TXD3_REG  ====================================================== */
#define USB_USB_TXD3_REG_USB_TXFD_Pos     (0UL)                     /*!< USB USB_TXD3_REG: USB_TXFD (Bit 0)                    */
#define USB_USB_TXD3_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB USB_TXD3_REG: USB_TXFD (Bitfield-Mask: 0xff)      */
/* =====================================================  USB_TXEV_REG  ====================================================== */
#define USB_USB_TXEV_REG_USB_TXUDRRN31_Pos (4UL)                    /*!< USB USB_TXEV_REG: USB_TXUDRRN31 (Bit 4)               */
#define USB_USB_TXEV_REG_USB_TXUDRRN31_Msk (0x70UL)                 /*!< USB USB_TXEV_REG: USB_TXUDRRN31 (Bitfield-Mask: 0x07) */
#define USB_USB_TXEV_REG_USB_TXFIFO31_Pos (0UL)                     /*!< USB USB_TXEV_REG: USB_TXFIFO31 (Bit 0)                */
#define USB_USB_TXEV_REG_USB_TXFIFO31_Msk (0x7UL)                   /*!< USB USB_TXEV_REG: USB_TXFIFO31 (Bitfield-Mask: 0x07)  */
/* =====================================================  USB_TXMSK_REG  ===================================================== */
#define USB_USB_TXMSK_REG_USB_M_TXUDRRN31_Pos (4UL)                 /*!< USB USB_TXMSK_REG: USB_M_TXUDRRN31 (Bit 4)            */
#define USB_USB_TXMSK_REG_USB_M_TXUDRRN31_Msk (0x70UL)              /*!< USB USB_TXMSK_REG: USB_M_TXUDRRN31 (Bitfield-Mask: 0x07) */
#define USB_USB_TXMSK_REG_USB_M_TXFIFO31_Pos (0UL)                  /*!< USB USB_TXMSK_REG: USB_M_TXFIFO31 (Bit 0)             */
#define USB_USB_TXMSK_REG_USB_M_TXFIFO31_Msk (0x7UL)                /*!< USB USB_TXMSK_REG: USB_M_TXFIFO31 (Bitfield-Mask: 0x07) */
/* =====================================================  USB_TXS0_REG  ====================================================== */
#define USB_USB_TXS0_REG_USB_ACK_STAT_Pos (6UL)                     /*!< USB USB_TXS0_REG: USB_ACK_STAT (Bit 6)                */
#define USB_USB_TXS0_REG_USB_ACK_STAT_Msk (0x40UL)                  /*!< USB USB_TXS0_REG: USB_ACK_STAT (Bitfield-Mask: 0x01)  */
#define USB_USB_TXS0_REG_USB_TX_DONE_Pos  (5UL)                     /*!< USB USB_TXS0_REG: USB_TX_DONE (Bit 5)                 */
#define USB_USB_TXS0_REG_USB_TX_DONE_Msk  (0x20UL)                  /*!< USB USB_TXS0_REG: USB_TX_DONE (Bitfield-Mask: 0x01)   */
#define USB_USB_TXS0_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB USB_TXS0_REG: USB_TCOUNT (Bit 0)                  */
#define USB_USB_TXS0_REG_USB_TCOUNT_Msk   (0x1fUL)                  /*!< USB USB_TXS0_REG: USB_TCOUNT (Bitfield-Mask: 0x1f)    */
/* =====================================================  USB_TXS1_REG  ====================================================== */
#define USB_USB_TXS1_REG_USB_TX_URUN_Pos  (7UL)                     /*!< USB USB_TXS1_REG: USB_TX_URUN (Bit 7)                 */
#define USB_USB_TXS1_REG_USB_TX_URUN_Msk  (0x80UL)                  /*!< USB USB_TXS1_REG: USB_TX_URUN (Bitfield-Mask: 0x01)   */
#define USB_USB_TXS1_REG_USB_ACK_STAT_Pos (6UL)                     /*!< USB USB_TXS1_REG: USB_ACK_STAT (Bit 6)                */
#define USB_USB_TXS1_REG_USB_ACK_STAT_Msk (0x40UL)                  /*!< USB USB_TXS1_REG: USB_ACK_STAT (Bitfield-Mask: 0x01)  */
#define USB_USB_TXS1_REG_USB_TX_DONE_Pos  (5UL)                     /*!< USB USB_TXS1_REG: USB_TX_DONE (Bit 5)                 */
#define USB_USB_TXS1_REG_USB_TX_DONE_Msk  (0x20UL)                  /*!< USB USB_TXS1_REG: USB_TX_DONE (Bitfield-Mask: 0x01)   */
#define USB_USB_TXS1_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB USB_TXS1_REG: USB_TCOUNT (Bit 0)                  */
#define USB_USB_TXS1_REG_USB_TCOUNT_Msk   (0x1fUL)                  /*!< USB USB_TXS1_REG: USB_TCOUNT (Bitfield-Mask: 0x1f)    */
/* =====================================================  USB_TXS2_REG  ====================================================== */
#define USB_USB_TXS2_REG_USB_TX_URUN_Pos  (7UL)                     /*!< USB USB_TXS2_REG: USB_TX_URUN (Bit 7)                 */
#define USB_USB_TXS2_REG_USB_TX_URUN_Msk  (0x80UL)                  /*!< USB USB_TXS2_REG: USB_TX_URUN (Bitfield-Mask: 0x01)   */
#define USB_USB_TXS2_REG_USB_ACK_STAT_Pos (6UL)                     /*!< USB USB_TXS2_REG: USB_ACK_STAT (Bit 6)                */
#define USB_USB_TXS2_REG_USB_ACK_STAT_Msk (0x40UL)                  /*!< USB USB_TXS2_REG: USB_ACK_STAT (Bitfield-Mask: 0x01)  */
#define USB_USB_TXS2_REG_USB_TX_DONE_Pos  (5UL)                     /*!< USB USB_TXS2_REG: USB_TX_DONE (Bit 5)                 */
#define USB_USB_TXS2_REG_USB_TX_DONE_Msk  (0x20UL)                  /*!< USB USB_TXS2_REG: USB_TX_DONE (Bitfield-Mask: 0x01)   */
#define USB_USB_TXS2_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB USB_TXS2_REG: USB_TCOUNT (Bit 0)                  */
#define USB_USB_TXS2_REG_USB_TCOUNT_Msk   (0x1fUL)                  /*!< USB USB_TXS2_REG: USB_TCOUNT (Bitfield-Mask: 0x1f)    */
/* =====================================================  USB_TXS3_REG  ====================================================== */
#define USB_USB_TXS3_REG_USB_TX_URUN_Pos  (7UL)                     /*!< USB USB_TXS3_REG: USB_TX_URUN (Bit 7)                 */
#define USB_USB_TXS3_REG_USB_TX_URUN_Msk  (0x80UL)                  /*!< USB USB_TXS3_REG: USB_TX_URUN (Bitfield-Mask: 0x01)   */
#define USB_USB_TXS3_REG_USB_ACK_STAT_Pos (6UL)                     /*!< USB USB_TXS3_REG: USB_ACK_STAT (Bit 6)                */
#define USB_USB_TXS3_REG_USB_ACK_STAT_Msk (0x40UL)                  /*!< USB USB_TXS3_REG: USB_ACK_STAT (Bitfield-Mask: 0x01)  */
#define USB_USB_TXS3_REG_USB_TX_DONE_Pos  (5UL)                     /*!< USB USB_TXS3_REG: USB_TX_DONE (Bit 5)                 */
#define USB_USB_TXS3_REG_USB_TX_DONE_Msk  (0x20UL)                  /*!< USB USB_TXS3_REG: USB_TX_DONE (Bitfield-Mask: 0x01)   */
#define USB_USB_TXS3_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB USB_TXS3_REG: USB_TCOUNT (Bit 0)                  */
#define USB_USB_TXS3_REG_USB_TCOUNT_Msk   (0x1fUL)                  /*!< USB USB_TXS3_REG: USB_TCOUNT (Bitfield-Mask: 0x1f)    */
/* ======================================================  USB_UTR_REG  ====================================================== */
#define USB_USB_UTR_REG_USB_DIAG_Pos      (7UL)                     /*!< USB USB_UTR_REG: USB_DIAG (Bit 7)                     */
#define USB_USB_UTR_REG_USB_DIAG_Msk      (0x80UL)                  /*!< USB USB_UTR_REG: USB_DIAG (Bitfield-Mask: 0x01)       */
#define USB_USB_UTR_REG_USB_NCRC_Pos      (6UL)                     /*!< USB USB_UTR_REG: USB_NCRC (Bit 6)                     */
#define USB_USB_UTR_REG_USB_NCRC_Msk      (0x40UL)                  /*!< USB USB_UTR_REG: USB_NCRC (Bitfield-Mask: 0x01)       */
#define USB_USB_UTR_REG_USB_SF_Pos        (5UL)                     /*!< USB USB_UTR_REG: USB_SF (Bit 5)                       */
#define USB_USB_UTR_REG_USB_SF_Msk        (0x20UL)                  /*!< USB USB_UTR_REG: USB_SF (Bitfield-Mask: 0x01)         */
#define USB_USB_UTR_REG_USB_UTR_RES_Pos   (0UL)                     /*!< USB USB_UTR_REG: USB_UTR_RES (Bit 0)                  */
#define USB_USB_UTR_REG_USB_UTR_RES_Msk   (0x1fUL)                  /*!< USB USB_UTR_REG: USB_UTR_RES (Bitfield-Mask: 0x1f)    */
/* ====================================================  USB_UX20CDR_REG  ==================================================== */
#define USB_USB_UX20CDR_REG_RPU_TEST7_Pos (7UL)                     /*!< USB USB_UX20CDR_REG: RPU_TEST7 (Bit 7)                */
#define USB_USB_UX20CDR_REG_RPU_TEST7_Msk (0x80UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST7 (Bitfield-Mask: 0x01)  */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW2_Pos (6UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST_SW2 (Bit 6)             */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW2_Msk (0x40UL)               /*!< USB USB_UX20CDR_REG: RPU_TEST_SW2 (Bitfield-Mask: 0x01) */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1_Pos (5UL)                  /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1 (Bit 5)             */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1_Msk (0x20UL)               /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1 (Bitfield-Mask: 0x01) */
#define USB_USB_UX20CDR_REG_RPU_TEST_EN_Pos (4UL)                   /*!< USB USB_UX20CDR_REG: RPU_TEST_EN (Bit 4)              */
#define USB_USB_UX20CDR_REG_RPU_TEST_EN_Msk (0x10UL)                /*!< USB USB_UX20CDR_REG: RPU_TEST_EN (Bitfield-Mask: 0x01) */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1DM_Pos (2UL)                /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1DM (Bit 2)           */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1DM_Msk (0x4UL)              /*!< USB USB_UX20CDR_REG: RPU_TEST_SW1DM (Bitfield-Mask: 0x01) */
#define USB_USB_UX20CDR_REG_RPU_RCDELAY_Pos (1UL)                   /*!< USB USB_UX20CDR_REG: RPU_RCDELAY (Bit 1)              */
#define USB_USB_UX20CDR_REG_RPU_RCDELAY_Msk (0x2UL)                 /*!< USB USB_UX20CDR_REG: RPU_RCDELAY (Bitfield-Mask: 0x01) */
#define USB_USB_UX20CDR_REG_RPU_SSPROTEN_Pos (0UL)                  /*!< USB USB_UX20CDR_REG: RPU_SSPROTEN (Bit 0)             */
#define USB_USB_UX20CDR_REG_RPU_SSPROTEN_Msk (0x1UL)                /*!< USB USB_UX20CDR_REG: RPU_SSPROTEN (Bitfield-Mask: 0x01) */
/* ====================================================  USB_XCVDIAG_REG  ==================================================== */
#define USB_USB_XCVDIAG_REG_USB_VPIN_Pos  (7UL)                     /*!< USB USB_XCVDIAG_REG: USB_VPIN (Bit 7)                 */
#define USB_USB_XCVDIAG_REG_USB_VPIN_Msk  (0x80UL)                  /*!< USB USB_XCVDIAG_REG: USB_VPIN (Bitfield-Mask: 0x01)   */
#define USB_USB_XCVDIAG_REG_USB_VMIN_Pos  (6UL)                     /*!< USB USB_XCVDIAG_REG: USB_VMIN (Bit 6)                 */
#define USB_USB_XCVDIAG_REG_USB_VMIN_Msk  (0x40UL)                  /*!< USB USB_XCVDIAG_REG: USB_VMIN (Bitfield-Mask: 0x01)   */
#define USB_USB_XCVDIAG_REG_USB_RCV_Pos   (5UL)                     /*!< USB USB_XCVDIAG_REG: USB_RCV (Bit 5)                  */
#define USB_USB_XCVDIAG_REG_USB_RCV_Msk   (0x20UL)                  /*!< USB USB_XCVDIAG_REG: USB_RCV (Bitfield-Mask: 0x01)    */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXEN_Pos (3UL)                  /*!< USB USB_XCVDIAG_REG: USB_XCV_TXEN (Bit 3)             */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXEN_Msk (0x8UL)                /*!< USB USB_XCVDIAG_REG: USB_XCV_TXEN (Bitfield-Mask: 0x01) */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXn_Pos (2UL)                   /*!< USB USB_XCVDIAG_REG: USB_XCV_TXn (Bit 2)              */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXn_Msk (0x4UL)                 /*!< USB USB_XCVDIAG_REG: USB_XCV_TXn (Bitfield-Mask: 0x01) */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXp_Pos (1UL)                   /*!< USB USB_XCVDIAG_REG: USB_XCV_TXp (Bit 1)              */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXp_Msk (0x2UL)                 /*!< USB USB_XCVDIAG_REG: USB_XCV_TXp (Bitfield-Mask: 0x01) */
#define USB_USB_XCVDIAG_REG_USB_XCV_TEST_Pos (0UL)                  /*!< USB USB_XCVDIAG_REG: USB_XCV_TEST (Bit 0)             */
#define USB_USB_XCVDIAG_REG_USB_XCV_TEST_Msk (0x1UL)                /*!< USB USB_XCVDIAG_REG: USB_XCV_TEST (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                          WAKEUP                                           ================ */
/* =========================================================================================================================== */

/* ===================================================  WKUP_COMPARE_REG  ==================================================== */
#define WAKEUP_WKUP_COMPARE_REG_COMPARE_Pos (0UL)                   /*!< WAKEUP WKUP_COMPARE_REG: COMPARE (Bit 0)              */
#define WAKEUP_WKUP_COMPARE_REG_COMPARE_Msk (0xffUL)                /*!< WAKEUP WKUP_COMPARE_REG: COMPARE (Bitfield-Mask: 0xff) */
/* ===================================================  WKUP_COUNTER_REG  ==================================================== */
#define WAKEUP_WKUP_COUNTER_REG_EVENT_VALUE_Pos (0UL)               /*!< WAKEUP WKUP_COUNTER_REG: EVENT_VALUE (Bit 0)          */
#define WAKEUP_WKUP_COUNTER_REG_EVENT_VALUE_Msk (0xffUL)            /*!< WAKEUP WKUP_COUNTER_REG: EVENT_VALUE (Bitfield-Mask: 0xff) */
/* =====================================================  WKUP_CTRL_REG  ===================================================== */
#define WAKEUP_WKUP_CTRL_REG_WKUP_ENABLE_IRQ_Pos (7UL)              /*!< WAKEUP WKUP_CTRL_REG: WKUP_ENABLE_IRQ (Bit 7)         */
#define WAKEUP_WKUP_CTRL_REG_WKUP_ENABLE_IRQ_Msk (0x80UL)           /*!< WAKEUP WKUP_CTRL_REG: WKUP_ENABLE_IRQ (Bitfield-Mask: 0x01) */
#define WAKEUP_WKUP_CTRL_REG_WKUP_SFT_KEYHIT_Pos (6UL)              /*!< WAKEUP WKUP_CTRL_REG: WKUP_SFT_KEYHIT (Bit 6)         */
#define WAKEUP_WKUP_CTRL_REG_WKUP_SFT_KEYHIT_Msk (0x40UL)           /*!< WAKEUP WKUP_CTRL_REG: WKUP_SFT_KEYHIT (Bitfield-Mask: 0x01) */
#define WAKEUP_WKUP_CTRL_REG_WKUP_DEB_VALUE_Pos (0UL)               /*!< WAKEUP WKUP_CTRL_REG: WKUP_DEB_VALUE (Bit 0)          */
#define WAKEUP_WKUP_CTRL_REG_WKUP_DEB_VALUE_Msk (0x3fUL)            /*!< WAKEUP WKUP_CTRL_REG: WKUP_DEB_VALUE (Bitfield-Mask: 0x3f) */
/* ====================================================  WKUP_POL_P0_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Pos (0UL)                /*!< WAKEUP WKUP_POL_P0_REG: WKUP_POL_P0 (Bit 0)           */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Msk (0xffUL)             /*!< WAKEUP WKUP_POL_P0_REG: WKUP_POL_P0 (Bitfield-Mask: 0xff) */
/* ====================================================  WKUP_POL_P1_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Pos (0UL)                /*!< WAKEUP WKUP_POL_P1_REG: WKUP_POL_P1 (Bit 0)           */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Msk (0xffUL)             /*!< WAKEUP WKUP_POL_P1_REG: WKUP_POL_P1 (Bitfield-Mask: 0xff) */
/* ====================================================  WKUP_POL_P2_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Pos (0UL)                /*!< WAKEUP WKUP_POL_P2_REG: WKUP_POL_P2 (Bit 0)           */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Msk (0x1fUL)             /*!< WAKEUP WKUP_POL_P2_REG: WKUP_POL_P2 (Bitfield-Mask: 0x1f) */
/* ====================================================  WKUP_POL_P3_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P3_REG_WKUP_POL_P3_Pos (0UL)                /*!< WAKEUP WKUP_POL_P3_REG: WKUP_POL_P3 (Bit 0)           */
#define WAKEUP_WKUP_POL_P3_REG_WKUP_POL_P3_Msk (0xffUL)             /*!< WAKEUP WKUP_POL_P3_REG: WKUP_POL_P3 (Bitfield-Mask: 0xff) */
/* ====================================================  WKUP_POL_P4_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P4_REG_WKUP_POL_P4_Pos (0UL)                /*!< WAKEUP WKUP_POL_P4_REG: WKUP_POL_P4 (Bit 0)           */
#define WAKEUP_WKUP_POL_P4_REG_WKUP_POL_P4_Msk (0xffUL)             /*!< WAKEUP WKUP_POL_P4_REG: WKUP_POL_P4 (Bitfield-Mask: 0xff) */
/* ==================================================  WKUP_RESET_CNTR_REG  ================================================== */
#define WAKEUP_WKUP_RESET_CNTR_REG_WKUP_CNTR_RST_Pos (0UL)          /*!< WAKEUP WKUP_RESET_CNTR_REG: WKUP_CNTR_RST (Bit 0)     */
#define WAKEUP_WKUP_RESET_CNTR_REG_WKUP_CNTR_RST_Msk (0xffffUL)     /*!< WAKEUP WKUP_RESET_CNTR_REG: WKUP_CNTR_RST (Bitfield-Mask: 0xffff) */
/* ==================================================  WKUP_RESET_IRQ_REG  =================================================== */
#define WAKEUP_WKUP_RESET_IRQ_REG_WKUP_IRQ_RST_Pos (0UL)            /*!< WAKEUP WKUP_RESET_IRQ_REG: WKUP_IRQ_RST (Bit 0)       */
#define WAKEUP_WKUP_RESET_IRQ_REG_WKUP_IRQ_RST_Msk (0xffffUL)       /*!< WAKEUP WKUP_RESET_IRQ_REG: WKUP_IRQ_RST (Bitfield-Mask: 0xffff) */
/* ==================================================  WKUP_SELECT_P0_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P0_REG_WKUP_SELECT_P0_Pos (0UL)          /*!< WAKEUP WKUP_SELECT_P0_REG: WKUP_SELECT_P0 (Bit 0)     */
#define WAKEUP_WKUP_SELECT_P0_REG_WKUP_SELECT_P0_Msk (0xffUL)       /*!< WAKEUP WKUP_SELECT_P0_REG: WKUP_SELECT_P0 (Bitfield-Mask: 0xff) */
/* ==================================================  WKUP_SELECT_P1_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P1_REG_WKUP_SELECT_P1_Pos (0UL)          /*!< WAKEUP WKUP_SELECT_P1_REG: WKUP_SELECT_P1 (Bit 0)     */
#define WAKEUP_WKUP_SELECT_P1_REG_WKUP_SELECT_P1_Msk (0xffUL)       /*!< WAKEUP WKUP_SELECT_P1_REG: WKUP_SELECT_P1 (Bitfield-Mask: 0xff) */
/* ==================================================  WKUP_SELECT_P2_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P2_REG_WKUP_SELECT_P2_Pos (0UL)          /*!< WAKEUP WKUP_SELECT_P2_REG: WKUP_SELECT_P2 (Bit 0)     */
#define WAKEUP_WKUP_SELECT_P2_REG_WKUP_SELECT_P2_Msk (0x1fUL)       /*!< WAKEUP WKUP_SELECT_P2_REG: WKUP_SELECT_P2 (Bitfield-Mask: 0x1f) */
/* ==================================================  WKUP_SELECT_P3_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P3_REG_WKUP_SELECT_P3_Pos (0UL)          /*!< WAKEUP WKUP_SELECT_P3_REG: WKUP_SELECT_P3 (Bit 0)     */
#define WAKEUP_WKUP_SELECT_P3_REG_WKUP_SELECT_P3_Msk (0xffUL)       /*!< WAKEUP WKUP_SELECT_P3_REG: WKUP_SELECT_P3 (Bitfield-Mask: 0xff) */
/* ==================================================  WKUP_SELECT_P4_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P4_REG_WKUP_SELECT_P4_Pos (0UL)          /*!< WAKEUP WKUP_SELECT_P4_REG: WKUP_SELECT_P4 (Bit 0)     */
#define WAKEUP_WKUP_SELECT_P4_REG_WKUP_SELECT_P4_Msk (0xffUL)       /*!< WAKEUP WKUP_SELECT_P4_REG: WKUP_SELECT_P4 (Bitfield-Mask: 0xff) */


/* =========================================================================================================================== */
/* ================                                           WDOG                                            ================ */
/* =========================================================================================================================== */

/* ===================================================  WATCHDOG_CTRL_REG  =================================================== */
#define WDOG_WATCHDOG_CTRL_REG_NMI_RST_Pos (0UL)                    /*!< WDOG WATCHDOG_CTRL_REG: NMI_RST (Bit 0)               */
#define WDOG_WATCHDOG_CTRL_REG_NMI_RST_Msk (0x1UL)                  /*!< WDOG WATCHDOG_CTRL_REG: NMI_RST (Bitfield-Mask: 0x01) */
/* =====================================================  WATCHDOG_REG  ====================================================== */
#define WDOG_WATCHDOG_REG_WDOG_WEN_Pos    (9UL)                     /*!< WDOG WATCHDOG_REG: WDOG_WEN (Bit 9)                   */
#define WDOG_WATCHDOG_REG_WDOG_WEN_Msk    (0xfe00UL)                /*!< WDOG WATCHDOG_REG: WDOG_WEN (Bitfield-Mask: 0x7f)     */
#define WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Pos (8UL)                    /*!< WDOG WATCHDOG_REG: WDOG_VAL_NEG (Bit 8)               */
#define WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Msk (0x100UL)                /*!< WDOG WATCHDOG_REG: WDOG_VAL_NEG (Bitfield-Mask: 0x01) */
#define WDOG_WATCHDOG_REG_WDOG_VAL_Pos    (0UL)                     /*!< WDOG WATCHDOG_REG: WDOG_VAL (Bit 0)                   */
#define WDOG_WATCHDOG_REG_WDOG_VAL_Msk    (0xffUL)                  /*!< WDOG WATCHDOG_REG: WDOG_VAL (Bitfield-Mask: 0xff)     */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* DA14680AE_H */


/** @} */ /* End of group DA14680AE */

/** @} */ /* End of group Dialog */
